espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
// Copyright 2017-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#pragma once

#ifdef __cplusplus
extern "C" {
#endif

#include "soc.h"

#define DMA_CONF0_CH0_REG (DR_REG_DMA_BASE + 0x000)
/* DMA_MEM_TRANS_EN_CH0 : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit 1 to enable automatic transmitting data from memory
 to memory via DMA.*/
#define DMA_MEM_TRANS_EN_CH0 (BIT(10))
#define DMA_MEM_TRANS_EN_CH0_M (BIT(10))
#define DMA_MEM_TRANS_EN_CH0_V 0x1
#define DMA_MEM_TRANS_EN_CH0_S 10
/* DMA_IN_DATA_BURST_EN_CH0 : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 0 receiving data when accessing internal SRAM.*/
#define DMA_IN_DATA_BURST_EN_CH0 (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH0_M (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH0_V 0x1
#define DMA_IN_DATA_BURST_EN_CH0_S 9
/* DMA_OUT_DATA_BURST_EN_CH0 : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 0 transmitting data when accessing internal SRAM.*/
#define DMA_OUT_DATA_BURST_EN_CH0 (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH0_M (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH0_V 0x1
#define DMA_OUT_DATA_BURST_EN_CH0_S 8
/* DMA_INDSCR_BURST_EN_CH0 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 0 reading link descriptor when accessing internal SRAM.*/
#define DMA_INDSCR_BURST_EN_CH0 (BIT(7))
#define DMA_INDSCR_BURST_EN_CH0_M (BIT(7))
#define DMA_INDSCR_BURST_EN_CH0_V 0x1
#define DMA_INDSCR_BURST_EN_CH0_S 7
/* DMA_OUTDSCR_BURST_EN_CH0 : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 0 reading link descriptor when accessing internal SRAM.*/
#define DMA_OUTDSCR_BURST_EN_CH0 (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH0_M (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH0_V 0x1
#define DMA_OUTDSCR_BURST_EN_CH0_S 6
/* DMA_OUT_EOF_MODE_CH0 : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: EOF flag generation mode when transmitting data. 1: EOF flag
 for Tx channel 0 is generated when data need to transmit has been popped from FIFO in DMA*/
#define DMA_OUT_EOF_MODE_CH0 (BIT(5))
#define DMA_OUT_EOF_MODE_CH0_M (BIT(5))
#define DMA_OUT_EOF_MODE_CH0_V 0x1
#define DMA_OUT_EOF_MODE_CH0_S 5
/* DMA_OUT_AUTO_WRBACK_CH0 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to enable automatic outlink-writeback when all the
 data in tx buffer has been transmitted.*/
#define DMA_OUT_AUTO_WRBACK_CH0 (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH0_M (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH0_V 0x1
#define DMA_OUT_AUTO_WRBACK_CH0_S 4
/* DMA_OUT_LOOP_TEST_CH0 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_LOOP_TEST_CH0 (BIT(3))
#define DMA_OUT_LOOP_TEST_CH0_M (BIT(3))
#define DMA_OUT_LOOP_TEST_CH0_V 0x1
#define DMA_OUT_LOOP_TEST_CH0_S 3
/* DMA_IN_LOOP_TEST_CH0 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_LOOP_TEST_CH0 (BIT(2))
#define DMA_IN_LOOP_TEST_CH0_M (BIT(2))
#define DMA_IN_LOOP_TEST_CH0_V 0x1
#define DMA_IN_LOOP_TEST_CH0_S 2
/* DMA_OUT_RST_CH0 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: This bit is used to reset DMA channel 0 Tx FSM and Tx FIFO pointer.*/
#define DMA_OUT_RST_CH0 (BIT(1))
#define DMA_OUT_RST_CH0_M (BIT(1))
#define DMA_OUT_RST_CH0_V 0x1
#define DMA_OUT_RST_CH0_S 1
/* DMA_IN_RST_CH0 : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: This bit is used to reset DMA channel 0 Rx FSM and Rx FIFO pointer.*/
#define DMA_IN_RST_CH0 (BIT(0))
#define DMA_IN_RST_CH0_M (BIT(0))
#define DMA_IN_RST_CH0_V 0x1
#define DMA_IN_RST_CH0_S 0

#define DMA_CONF0_CH1_REG (DR_REG_DMA_BASE + 0x004)
/* DMA_MEM_TRANS_EN_CH1 : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit 1 to enable automatic transmitting data from memory
 to memory via DMA.*/
#define DMA_MEM_TRANS_EN_CH1 (BIT(10))
#define DMA_MEM_TRANS_EN_CH1_M (BIT(10))
#define DMA_MEM_TRANS_EN_CH1_V 0x1
#define DMA_MEM_TRANS_EN_CH1_S 10
/* DMA_IN_DATA_BURST_EN_CH1 : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 1 receiving data when accessing internal SRAM.*/
#define DMA_IN_DATA_BURST_EN_CH1 (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH1_M (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH1_V 0x1
#define DMA_IN_DATA_BURST_EN_CH1_S 9
/* DMA_OUT_DATA_BURST_EN_CH1 : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 1 transmitting data when accessing internal SRAM.*/
#define DMA_OUT_DATA_BURST_EN_CH1 (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH1_M (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH1_V 0x1
#define DMA_OUT_DATA_BURST_EN_CH1_S 8
/* DMA_INDSCR_BURST_EN_CH1 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 1 reading link descriptor when accessing internal SRAM.*/
#define DMA_INDSCR_BURST_EN_CH1 (BIT(7))
#define DMA_INDSCR_BURST_EN_CH1_M (BIT(7))
#define DMA_INDSCR_BURST_EN_CH1_V 0x1
#define DMA_INDSCR_BURST_EN_CH1_S 7
/* DMA_OUTDSCR_BURST_EN_CH1 : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 1 reading link descriptor when accessing internal SRAM.*/
#define DMA_OUTDSCR_BURST_EN_CH1 (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH1_M (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH1_V 0x1
#define DMA_OUTDSCR_BURST_EN_CH1_S 6
/* DMA_OUT_EOF_MODE_CH1 : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: EOF flag generation mode when transmitting data. 1: EOF flag
 for Tx channel 1 is generated when data need to transmit has been popped from FIFO in DMA*/
#define DMA_OUT_EOF_MODE_CH1 (BIT(5))
#define DMA_OUT_EOF_MODE_CH1_M (BIT(5))
#define DMA_OUT_EOF_MODE_CH1_V 0x1
#define DMA_OUT_EOF_MODE_CH1_S 5
/* DMA_OUT_AUTO_WRBACK_CH1 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to enable automatic outlink-writeback when all the
 data in tx buffer has been transmitted.*/
#define DMA_OUT_AUTO_WRBACK_CH1 (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH1_M (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH1_V 0x1
#define DMA_OUT_AUTO_WRBACK_CH1_S 4
/* DMA_OUT_LOOP_TEST_CH1 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_LOOP_TEST_CH1 (BIT(3))
#define DMA_OUT_LOOP_TEST_CH1_M (BIT(3))
#define DMA_OUT_LOOP_TEST_CH1_V 0x1
#define DMA_OUT_LOOP_TEST_CH1_S 3
/* DMA_IN_LOOP_TEST_CH1 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_LOOP_TEST_CH1 (BIT(2))
#define DMA_IN_LOOP_TEST_CH1_M (BIT(2))
#define DMA_IN_LOOP_TEST_CH1_V 0x1
#define DMA_IN_LOOP_TEST_CH1_S 2
/* DMA_OUT_RST_CH1 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: This bit is used to reset DMA channel 1 Tx FSM and Tx FIFO pointer.*/
#define DMA_OUT_RST_CH1 (BIT(1))
#define DMA_OUT_RST_CH1_M (BIT(1))
#define DMA_OUT_RST_CH1_V 0x1
#define DMA_OUT_RST_CH1_S 1
/* DMA_IN_RST_CH1 : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: This bit is used to reset DMA channel 1 Rx FSM and Rx FIFO pointer.*/
#define DMA_IN_RST_CH1 (BIT(0))
#define DMA_IN_RST_CH1_M (BIT(0))
#define DMA_IN_RST_CH1_V 0x1
#define DMA_IN_RST_CH1_S 0

#define DMA_CONF0_CH2_REG (DR_REG_DMA_BASE + 0x008)
/* DMA_MEM_TRANS_EN_CH2 : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit 1 to enable automatic transmitting data from memory
 to memory via DMA.*/
#define DMA_MEM_TRANS_EN_CH2 (BIT(10))
#define DMA_MEM_TRANS_EN_CH2_M (BIT(10))
#define DMA_MEM_TRANS_EN_CH2_V 0x1
#define DMA_MEM_TRANS_EN_CH2_S 10
/* DMA_IN_DATA_BURST_EN_CH2 : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 2 receiving data when accessing internal SRAM.*/
#define DMA_IN_DATA_BURST_EN_CH2 (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH2_M (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH2_V 0x1
#define DMA_IN_DATA_BURST_EN_CH2_S 9
/* DMA_OUT_DATA_BURST_EN_CH2 : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 2 transmitting data when accessing internal SRAM.*/
#define DMA_OUT_DATA_BURST_EN_CH2 (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH2_M (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH2_V 0x1
#define DMA_OUT_DATA_BURST_EN_CH2_S 8
/* DMA_INDSCR_BURST_EN_CH2 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 2 reading link descriptor when accessing internal SRAM.*/
#define DMA_INDSCR_BURST_EN_CH2 (BIT(7))
#define DMA_INDSCR_BURST_EN_CH2_M (BIT(7))
#define DMA_INDSCR_BURST_EN_CH2_V 0x1
#define DMA_INDSCR_BURST_EN_CH2_S 7
/* DMA_OUTDSCR_BURST_EN_CH2 : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 2 reading link descriptor when accessing internal SRAM.*/
#define DMA_OUTDSCR_BURST_EN_CH2 (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH2_M (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH2_V 0x1
#define DMA_OUTDSCR_BURST_EN_CH2_S 6
/* DMA_OUT_EOF_MODE_CH2 : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: EOF flag generation mode when transmitting data. 1: EOF flag
 for Tx channel 2 is generated when data need to transmit has been popped from FIFO in DMA*/
#define DMA_OUT_EOF_MODE_CH2 (BIT(5))
#define DMA_OUT_EOF_MODE_CH2_M (BIT(5))
#define DMA_OUT_EOF_MODE_CH2_V 0x1
#define DMA_OUT_EOF_MODE_CH2_S 5
/* DMA_OUT_AUTO_WRBACK_CH2 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to enable automatic outlink-writeback when all the
 data in tx buffer has been transmitted.*/
#define DMA_OUT_AUTO_WRBACK_CH2 (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH2_M (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH2_V 0x1
#define DMA_OUT_AUTO_WRBACK_CH2_S 4
/* DMA_OUT_LOOP_TEST_CH2 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_LOOP_TEST_CH2 (BIT(3))
#define DMA_OUT_LOOP_TEST_CH2_M (BIT(3))
#define DMA_OUT_LOOP_TEST_CH2_V 0x1
#define DMA_OUT_LOOP_TEST_CH2_S 3
/* DMA_IN_LOOP_TEST_CH2 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_LOOP_TEST_CH2 (BIT(2))
#define DMA_IN_LOOP_TEST_CH2_M (BIT(2))
#define DMA_IN_LOOP_TEST_CH2_V 0x1
#define DMA_IN_LOOP_TEST_CH2_S 2
/* DMA_OUT_RST_CH2 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: This bit is used to reset DMA channel 2 Tx FSM and Tx FIFO pointer.*/
#define DMA_OUT_RST_CH2 (BIT(1))
#define DMA_OUT_RST_CH2_M (BIT(1))
#define DMA_OUT_RST_CH2_V 0x1
#define DMA_OUT_RST_CH2_S 1
/* DMA_IN_RST_CH2 : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: This bit is used to reset DMA channel 2 Rx FSM and Rx FIFO pointer.*/
#define DMA_IN_RST_CH2 (BIT(0))
#define DMA_IN_RST_CH2_M (BIT(0))
#define DMA_IN_RST_CH2_V 0x1
#define DMA_IN_RST_CH2_S 0

#define DMA_CONF0_CH3_REG (DR_REG_DMA_BASE + 0x00C)
/* DMA_MEM_TRANS_EN_CH3 : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit 1 to enable automatic transmitting data from memory
 to memory via DMA.*/
#define DMA_MEM_TRANS_EN_CH3 (BIT(10))
#define DMA_MEM_TRANS_EN_CH3_M (BIT(10))
#define DMA_MEM_TRANS_EN_CH3_V 0x1
#define DMA_MEM_TRANS_EN_CH3_S 10
/* DMA_IN_DATA_BURST_EN_CH3 : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 3 receiving data when accessing internal SRAM.*/
#define DMA_IN_DATA_BURST_EN_CH3 (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH3_M (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH3_V 0x1
#define DMA_IN_DATA_BURST_EN_CH3_S 9
/* DMA_OUT_DATA_BURST_EN_CH3 : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 3 transmitting data when accessing internal SRAM.*/
#define DMA_OUT_DATA_BURST_EN_CH3 (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH3_M (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH3_V 0x1
#define DMA_OUT_DATA_BURST_EN_CH3_S 8
/* DMA_INDSCR_BURST_EN_CH3 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 3 reading link descriptor when accessing internal SRAM.*/
#define DMA_INDSCR_BURST_EN_CH3 (BIT(7))
#define DMA_INDSCR_BURST_EN_CH3_M (BIT(7))
#define DMA_INDSCR_BURST_EN_CH3_V 0x1
#define DMA_INDSCR_BURST_EN_CH3_S 7
/* DMA_OUTDSCR_BURST_EN_CH3 : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 3 reading link descriptor when accessing internal SRAM.*/
#define DMA_OUTDSCR_BURST_EN_CH3 (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH3_M (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH3_V 0x1
#define DMA_OUTDSCR_BURST_EN_CH3_S 6
/* DMA_OUT_EOF_MODE_CH3 : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: EOF flag generation mode when transmitting data. 1: EOF flag
 for Tx channel 3 is generated when data need to transmit has been popped from FIFO in DMA*/
#define DMA_OUT_EOF_MODE_CH3 (BIT(5))
#define DMA_OUT_EOF_MODE_CH3_M (BIT(5))
#define DMA_OUT_EOF_MODE_CH3_V 0x1
#define DMA_OUT_EOF_MODE_CH3_S 5
/* DMA_OUT_AUTO_WRBACK_CH3 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to enable automatic outlink-writeback when all the
 data in tx buffer has been transmitted.*/
#define DMA_OUT_AUTO_WRBACK_CH3 (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH3_M (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH3_V 0x1
#define DMA_OUT_AUTO_WRBACK_CH3_S 4
/* DMA_OUT_LOOP_TEST_CH3 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_LOOP_TEST_CH3 (BIT(3))
#define DMA_OUT_LOOP_TEST_CH3_M (BIT(3))
#define DMA_OUT_LOOP_TEST_CH3_V 0x1
#define DMA_OUT_LOOP_TEST_CH3_S 3
/* DMA_IN_LOOP_TEST_CH3 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_LOOP_TEST_CH3 (BIT(2))
#define DMA_IN_LOOP_TEST_CH3_M (BIT(2))
#define DMA_IN_LOOP_TEST_CH3_V 0x1
#define DMA_IN_LOOP_TEST_CH3_S 2
/* DMA_OUT_RST_CH3 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: This bit is used to reset DMA channel 3 Tx FSM and Tx FIFO pointer.*/
#define DMA_OUT_RST_CH3 (BIT(1))
#define DMA_OUT_RST_CH3_M (BIT(1))
#define DMA_OUT_RST_CH3_V 0x1
#define DMA_OUT_RST_CH3_S 1
/* DMA_IN_RST_CH3 : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: This bit is used to reset DMA channel 3 Rx FSM and Rx FIFO pointer.*/
#define DMA_IN_RST_CH3 (BIT(0))
#define DMA_IN_RST_CH3_M (BIT(0))
#define DMA_IN_RST_CH3_V 0x1
#define DMA_IN_RST_CH3_S 0

