espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_CONF0_CH4_REG (DR_REG_DMA_BASE + 0x010)
/* DMA_MEM_TRANS_EN_CH4 : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit 1 to enable automatic transmitting data from memory
 to memory via DMA.*/
#define DMA_MEM_TRANS_EN_CH4 (BIT(10))
#define DMA_MEM_TRANS_EN_CH4_M (BIT(10))
#define DMA_MEM_TRANS_EN_CH4_V 0x1
#define DMA_MEM_TRANS_EN_CH4_S 10
/* DMA_IN_DATA_BURST_EN_CH4 : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 4 receiving data when accessing internal SRAM.*/
#define DMA_IN_DATA_BURST_EN_CH4 (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH4_M (BIT(9))
#define DMA_IN_DATA_BURST_EN_CH4_V 0x1
#define DMA_IN_DATA_BURST_EN_CH4_S 9
/* DMA_OUT_DATA_BURST_EN_CH4 : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 4 transmitting data when accessing internal SRAM.*/
#define DMA_OUT_DATA_BURST_EN_CH4 (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH4_M (BIT(8))
#define DMA_OUT_DATA_BURST_EN_CH4_V 0x1
#define DMA_OUT_DATA_BURST_EN_CH4_S 8
/* DMA_INDSCR_BURST_EN_CH4 : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Rx channel
 4 reading link descriptor when accessing internal SRAM.*/
#define DMA_INDSCR_BURST_EN_CH4 (BIT(7))
#define DMA_INDSCR_BURST_EN_CH4_M (BIT(7))
#define DMA_INDSCR_BURST_EN_CH4_V 0x1
#define DMA_INDSCR_BURST_EN_CH4_S 7
/* DMA_OUTDSCR_BURST_EN_CH4 : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to 1 to enable INCR burst transfer for Tx channel
 4 reading link descriptor when accessing internal SRAM.*/
#define DMA_OUTDSCR_BURST_EN_CH4 (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH4_M (BIT(6))
#define DMA_OUTDSCR_BURST_EN_CH4_V 0x1
#define DMA_OUTDSCR_BURST_EN_CH4_S 6
/* DMA_OUT_EOF_MODE_CH4 : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: EOF flag generation mode when transmitting data. 1: EOF flag
 for Tx channel 4 is generated when data need to transmit has been popped from FIFO in DMA*/
#define DMA_OUT_EOF_MODE_CH4 (BIT(5))
#define DMA_OUT_EOF_MODE_CH4_M (BIT(5))
#define DMA_OUT_EOF_MODE_CH4_V 0x1
#define DMA_OUT_EOF_MODE_CH4_S 5
/* DMA_OUT_AUTO_WRBACK_CH4 : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to enable automatic outlink-writeback when all the
 data in tx buffer has been transmitted.*/
#define DMA_OUT_AUTO_WRBACK_CH4 (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH4_M (BIT(4))
#define DMA_OUT_AUTO_WRBACK_CH4_V 0x1
#define DMA_OUT_AUTO_WRBACK_CH4_S 4
/* DMA_OUT_LOOP_TEST_CH4 : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_LOOP_TEST_CH4 (BIT(3))
#define DMA_OUT_LOOP_TEST_CH4_M (BIT(3))
#define DMA_OUT_LOOP_TEST_CH4_V 0x1
#define DMA_OUT_LOOP_TEST_CH4_S 3
/* DMA_IN_LOOP_TEST_CH4 : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_LOOP_TEST_CH4 (BIT(2))
#define DMA_IN_LOOP_TEST_CH4_M (BIT(2))
#define DMA_IN_LOOP_TEST_CH4_V 0x1
#define DMA_IN_LOOP_TEST_CH4_S 2
/* DMA_OUT_RST_CH4 : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: This bit is used to reset DMA channel 4 Tx FSM and Tx FIFO pointer.*/
#define DMA_OUT_RST_CH4 (BIT(1))
#define DMA_OUT_RST_CH4_M (BIT(1))
#define DMA_OUT_RST_CH4_V 0x1
#define DMA_OUT_RST_CH4_S 1
/* DMA_IN_RST_CH4 : R/W ;bitpos:[0] ;default: 1'h0 ; */
/*description: This bit is used to reset DMA channel 4 Rx FSM and Rx FIFO pointer.*/
#define DMA_IN_RST_CH4 (BIT(0))
#define DMA_IN_RST_CH4_M (BIT(0))
#define DMA_IN_RST_CH4_V 0x1
#define DMA_IN_RST_CH4_S 0

#define DMA_CONF1_CH0_REG (DR_REG_DMA_BASE + 0x014)
/* DMA_OUT_EXT_MEM_BK_SIZE_CH0 : R/W ;bitpos:[16:15] ;default: 2'b0 ; */
/*description: Block size of Tx channel 0 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_OUT_EXT_MEM_BK_SIZE_CH0 0x00000003
#define DMA_OUT_EXT_MEM_BK_SIZE_CH0_M ((DMA_OUT_EXT_MEM_BK_SIZE_CH0_V) << (DMA_OUT_EXT_MEM_BK_SIZE_CH0_S))
#define DMA_OUT_EXT_MEM_BK_SIZE_CH0_V 0x3
#define DMA_OUT_EXT_MEM_BK_SIZE_CH0_S 15
/* DMA_IN_EXT_MEM_BK_SIZE_CH0 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Rx channel 0 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_IN_EXT_MEM_BK_SIZE_CH0 0x00000003
#define DMA_IN_EXT_MEM_BK_SIZE_CH0_M ((DMA_IN_EXT_MEM_BK_SIZE_CH0_V) << (DMA_IN_EXT_MEM_BK_SIZE_CH0_S))
#define DMA_IN_EXT_MEM_BK_SIZE_CH0_V 0x3
#define DMA_IN_EXT_MEM_BK_SIZE_CH0_S 13
/* DMA_CHECK_OWNER_CH0 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor.*/
#define DMA_CHECK_OWNER_CH0 (BIT(12))
#define DMA_CHECK_OWNER_CH0_M (BIT(12))
#define DMA_CHECK_OWNER_CH0_V 0x1
#define DMA_CHECK_OWNER_CH0_S 12
/* DMA_INFIFO_FULL_THRS_CH0 : R/W ;bitpos:[11:0] ;default: 12'hc ; */
/*description: This register is used to generate the INFIFO_FULL_WM_INT interrupt
 when Rx channel 0 received byte number in Rx FIFO is up to the value of the register.*/
#define DMA_INFIFO_FULL_THRS_CH0 0x00000FFF
#define DMA_INFIFO_FULL_THRS_CH0_M ((DMA_INFIFO_FULL_THRS_CH0_V) << (DMA_INFIFO_FULL_THRS_CH0_S))
#define DMA_INFIFO_FULL_THRS_CH0_V 0xFFF
#define DMA_INFIFO_FULL_THRS_CH0_S 0

#define DMA_CONF1_CH1_REG (DR_REG_DMA_BASE + 0x018)
/* DMA_OUT_EXT_MEM_BK_SIZE_CH1 : R/W ;bitpos:[16:15] ;default: 2'b0 ; */
/*description: Block size of Tx channel 1 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_OUT_EXT_MEM_BK_SIZE_CH1 0x00000003
#define DMA_OUT_EXT_MEM_BK_SIZE_CH1_M ((DMA_OUT_EXT_MEM_BK_SIZE_CH1_V) << (DMA_OUT_EXT_MEM_BK_SIZE_CH1_S))
#define DMA_OUT_EXT_MEM_BK_SIZE_CH1_V 0x3
#define DMA_OUT_EXT_MEM_BK_SIZE_CH1_S 15
/* DMA_IN_EXT_MEM_BK_SIZE_CH1 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Rx channel 1 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_IN_EXT_MEM_BK_SIZE_CH1 0x00000003
#define DMA_IN_EXT_MEM_BK_SIZE_CH1_M ((DMA_IN_EXT_MEM_BK_SIZE_CH1_V) << (DMA_IN_EXT_MEM_BK_SIZE_CH1_S))
#define DMA_IN_EXT_MEM_BK_SIZE_CH1_V 0x3
#define DMA_IN_EXT_MEM_BK_SIZE_CH1_S 13
/* DMA_CHECK_OWNER_CH1 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor.*/
#define DMA_CHECK_OWNER_CH1 (BIT(12))
#define DMA_CHECK_OWNER_CH1_M (BIT(12))
#define DMA_CHECK_OWNER_CH1_V 0x1
#define DMA_CHECK_OWNER_CH1_S 12
/* DMA_INFIFO_FULL_THRS_CH1 : R/W ;bitpos:[11:0] ;default: 12'hc ; */
/*description: This register is used to generate the INFIFO_FULL_WM_INT interrupt
 when Rx channel 1 received byte number in Rx FIFO is up to the value of the register.*/
#define DMA_INFIFO_FULL_THRS_CH1 0x00000FFF
#define DMA_INFIFO_FULL_THRS_CH1_M ((DMA_INFIFO_FULL_THRS_CH1_V) << (DMA_INFIFO_FULL_THRS_CH1_S))
#define DMA_INFIFO_FULL_THRS_CH1_V 0xFFF
#define DMA_INFIFO_FULL_THRS_CH1_S 0

#define DMA_CONF1_CH2_REG (DR_REG_DMA_BASE + 0x01C)
/* DMA_OUT_EXT_MEM_BK_SIZE_CH2 : R/W ;bitpos:[16:15] ;default: 2'b0 ; */
/*description: Block size of Tx channel 2 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_OUT_EXT_MEM_BK_SIZE_CH2 0x00000003
#define DMA_OUT_EXT_MEM_BK_SIZE_CH2_M ((DMA_OUT_EXT_MEM_BK_SIZE_CH2_V) << (DMA_OUT_EXT_MEM_BK_SIZE_CH2_S))
#define DMA_OUT_EXT_MEM_BK_SIZE_CH2_V 0x3
#define DMA_OUT_EXT_MEM_BK_SIZE_CH2_S 15
/* DMA_IN_EXT_MEM_BK_SIZE_CH2 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Rx channel 2 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_IN_EXT_MEM_BK_SIZE_CH2 0x00000003
#define DMA_IN_EXT_MEM_BK_SIZE_CH2_M ((DMA_IN_EXT_MEM_BK_SIZE_CH2_V) << (DMA_IN_EXT_MEM_BK_SIZE_CH2_S))
#define DMA_IN_EXT_MEM_BK_SIZE_CH2_V 0x3
#define DMA_IN_EXT_MEM_BK_SIZE_CH2_S 13
/* DMA_CHECK_OWNER_CH2 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor.*/
#define DMA_CHECK_OWNER_CH2 (BIT(12))
#define DMA_CHECK_OWNER_CH2_M (BIT(12))
#define DMA_CHECK_OWNER_CH2_V 0x1
#define DMA_CHECK_OWNER_CH2_S 12
/* DMA_INFIFO_FULL_THRS_CH2 : R/W ;bitpos:[11:0] ;default: 12'hc ; */
/*description: This register is used to generate the INFIFO_FULL_WM_INT interrupt
 when Rx channel 2 received byte number in Rx FIFO is up to the value of the register.*/
#define DMA_INFIFO_FULL_THRS_CH2 0x00000FFF
#define DMA_INFIFO_FULL_THRS_CH2_M ((DMA_INFIFO_FULL_THRS_CH2_V) << (DMA_INFIFO_FULL_THRS_CH2_S))
#define DMA_INFIFO_FULL_THRS_CH2_V 0xFFF
#define DMA_INFIFO_FULL_THRS_CH2_S 0

#define DMA_CONF1_CH3_REG (DR_REG_DMA_BASE + 0x020)
/* DMA_OUT_EXT_MEM_BK_SIZE_CH3 : R/W ;bitpos:[16:15] ;default: 2'b0 ; */
/*description: Block size of Tx channel 3 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_OUT_EXT_MEM_BK_SIZE_CH3 0x00000003
#define DMA_OUT_EXT_MEM_BK_SIZE_CH3_M ((DMA_OUT_EXT_MEM_BK_SIZE_CH3_V) << (DMA_OUT_EXT_MEM_BK_SIZE_CH3_S))
#define DMA_OUT_EXT_MEM_BK_SIZE_CH3_V 0x3
#define DMA_OUT_EXT_MEM_BK_SIZE_CH3_S 15
/* DMA_IN_EXT_MEM_BK_SIZE_CH3 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Rx channel 3 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_IN_EXT_MEM_BK_SIZE_CH3 0x00000003
#define DMA_IN_EXT_MEM_BK_SIZE_CH3_M ((DMA_IN_EXT_MEM_BK_SIZE_CH3_V) << (DMA_IN_EXT_MEM_BK_SIZE_CH3_S))
#define DMA_IN_EXT_MEM_BK_SIZE_CH3_V 0x3
#define DMA_IN_EXT_MEM_BK_SIZE_CH3_S 13
/* DMA_CHECK_OWNER_CH3 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor.*/
#define DMA_CHECK_OWNER_CH3 (BIT(12))
#define DMA_CHECK_OWNER_CH3_M (BIT(12))
#define DMA_CHECK_OWNER_CH3_V 0x1
#define DMA_CHECK_OWNER_CH3_S 12
/* DMA_INFIFO_FULL_THRS_CH3 : R/W ;bitpos:[11:0] ;default: 12'hc ; */
/*description: This register is used to generate the INFIFO_FULL_WM_INT interrupt
 when Rx channel 3 received byte number in Rx FIFO is up to the value of the register.*/
#define DMA_INFIFO_FULL_THRS_CH3 0x00000FFF
#define DMA_INFIFO_FULL_THRS_CH3_M ((DMA_INFIFO_FULL_THRS_CH3_V) << (DMA_INFIFO_FULL_THRS_CH3_S))
#define DMA_INFIFO_FULL_THRS_CH3_V 0xFFF
#define DMA_INFIFO_FULL_THRS_CH3_S 0

#define DMA_CONF1_CH4_REG (DR_REG_DMA_BASE + 0x024)
/* DMA_OUT_EXT_MEM_BK_SIZE_CH4 : R/W ;bitpos:[16:15] ;default: 2'b0 ; */
/*description: Block size of Tx channel 4 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_OUT_EXT_MEM_BK_SIZE_CH4 0x00000003
#define DMA_OUT_EXT_MEM_BK_SIZE_CH4_M ((DMA_OUT_EXT_MEM_BK_SIZE_CH4_V) << (DMA_OUT_EXT_MEM_BK_SIZE_CH4_S))
#define DMA_OUT_EXT_MEM_BK_SIZE_CH4_V 0x3
#define DMA_OUT_EXT_MEM_BK_SIZE_CH4_S 15
/* DMA_IN_EXT_MEM_BK_SIZE_CH4 : R/W ;bitpos:[14:13] ;default: 2'b0 ; */
/*description: Block size of Rx channel 4 when DMA access external SRAM. 0:
 16 bytes      1: 32 bytes    2/3:reserved*/
#define DMA_IN_EXT_MEM_BK_SIZE_CH4 0x00000003
#define DMA_IN_EXT_MEM_BK_SIZE_CH4_M ((DMA_IN_EXT_MEM_BK_SIZE_CH4_V) << (DMA_IN_EXT_MEM_BK_SIZE_CH4_S))
#define DMA_IN_EXT_MEM_BK_SIZE_CH4_V 0x3
#define DMA_IN_EXT_MEM_BK_SIZE_CH4_S 13
/* DMA_CHECK_OWNER_CH4 : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to enable checking the owner attribute of the link descriptor.*/
#define DMA_CHECK_OWNER_CH4 (BIT(12))
#define DMA_CHECK_OWNER_CH4_M (BIT(12))
#define DMA_CHECK_OWNER_CH4_V 0x1
#define DMA_CHECK_OWNER_CH4_S 12
/* DMA_INFIFO_FULL_THRS_CH4 : R/W ;bitpos:[11:0] ;default: 12'hc ; */
/*description: This register is used to generate the INFIFO_FULL_WM_INT interrupt
 when Rx channel 4 received byte number in Rx FIFO is up to the value of the register.*/
#define DMA_INFIFO_FULL_THRS_CH4 0x00000FFF
#define DMA_INFIFO_FULL_THRS_CH4_M ((DMA_INFIFO_FULL_THRS_CH4_V) << (DMA_INFIFO_FULL_THRS_CH4_S))
#define DMA_INFIFO_FULL_THRS_CH4_V 0xFFF
#define DMA_INFIFO_FULL_THRS_CH4_S 0

#define DMA_INT_RAW_CH0_REG (DR_REG_DMA_BASE + 0x028)
/* DMA_OUTFIFO_UDF_L3_CH0_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Tx channel 0 is underflow.*/
#define DMA_OUTFIFO_UDF_L3_CH0_INT_RAW (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH0_INT_RAW_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH0_INT_RAW_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH0_INT_RAW_S 17
/* DMA_OUTFIFO_OVF_L3_CH0_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Tx channel 0 is overflow.*/
#define DMA_OUTFIFO_OVF_L3_CH0_INT_RAW (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH0_INT_RAW_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH0_INT_RAW_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH0_INT_RAW_S 16
/* DMA_OUTFIFO_UDF_L1_CH0_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Tx channel 0 is underflow.*/
#define DMA_OUTFIFO_UDF_L1_CH0_INT_RAW (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH0_INT_RAW_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH0_INT_RAW_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH0_INT_RAW_S 15
/* DMA_OUTFIFO_OVF_L1_CH0_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Tx channel 0 is overflow.*/
#define DMA_OUTFIFO_OVF_L1_CH0_INT_RAW (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH0_INT_RAW_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH0_INT_RAW_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH0_INT_RAW_S 14
/* DMA_INFIFO_UDF_L3_CH0_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Rx channel 0 is underflow.*/
#define DMA_INFIFO_UDF_L3_CH0_INT_RAW (BIT(13))
#define DMA_INFIFO_UDF_L3_CH0_INT_RAW_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH0_INT_RAW_V 0x1
#define DMA_INFIFO_UDF_L3_CH0_INT_RAW_S 13
/* DMA_INFIFO_OVF_L3_CH0_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Rx channel 0 is overflow.*/
#define DMA_INFIFO_OVF_L3_CH0_INT_RAW (BIT(12))
#define DMA_INFIFO_OVF_L3_CH0_INT_RAW_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH0_INT_RAW_V 0x1
#define DMA_INFIFO_OVF_L3_CH0_INT_RAW_S 12
/* DMA_INFIFO_UDF_L1_CH0_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Rx channel 0 is underflow.*/
#define DMA_INFIFO_UDF_L1_CH0_INT_RAW (BIT(11))
#define DMA_INFIFO_UDF_L1_CH0_INT_RAW_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH0_INT_RAW_V 0x1
#define DMA_INFIFO_UDF_L1_CH0_INT_RAW_S 11
/* DMA_INFIFO_OVF_L1_CH0_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Rx channel 0 is overflow.*/
#define DMA_INFIFO_OVF_L1_CH0_INT_RAW (BIT(10))
#define DMA_INFIFO_OVF_L1_CH0_INT_RAW_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH0_INT_RAW_V 0x1
#define DMA_INFIFO_OVF_L1_CH0_INT_RAW_S 10
/* DMA_INFIFO_FULL_WM_CH0_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when received data
 byte number is up to threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 0.*/
#define DMA_INFIFO_FULL_WM_CH0_INT_RAW (BIT(9))
#define DMA_INFIFO_FULL_WM_CH0_INT_RAW_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH0_INT_RAW_V 0x1
#define DMA_INFIFO_FULL_WM_CH0_INT_RAW_S 9
/* DMA_OUT_TOTAL_EOF_CH0_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data corresponding
 a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 0.*/
#define DMA_OUT_TOTAL_EOF_CH0_INT_RAW (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH0_INT_RAW_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH0_INT_RAW_V 0x1
#define DMA_OUT_TOTAL_EOF_CH0_INT_RAW_S 8
/* DMA_IN_DSCR_EMPTY_CH0_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when Rx buffer pointed
 by inlink is full and receiving data is not completed  but there is no more inlink for Rx channel 0.*/
#define DMA_IN_DSCR_EMPTY_CH0_INT_RAW (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH0_INT_RAW_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH0_INT_RAW_V 0x1
#define DMA_IN_DSCR_EMPTY_CH0_INT_RAW_S 7
/* DMA_OUT_DSCR_ERR_CH0_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting outlink
 descriptor error  including owner error  the second and third word error of outlink descriptor for Tx channel 0.*/
#define DMA_OUT_DSCR_ERR_CH0_INT_RAW (BIT(6))
#define DMA_OUT_DSCR_ERR_CH0_INT_RAW_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH0_INT_RAW_V 0x1
#define DMA_OUT_DSCR_ERR_CH0_INT_RAW_S 6
/* DMA_IN_DSCR_ERR_CH0_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting inlink
 descriptor error  including owner error  the second and third word error of inlink descriptor for Rx channel 0.*/
#define DMA_IN_DSCR_ERR_CH0_INT_RAW (BIT(5))
#define DMA_IN_DSCR_ERR_CH0_INT_RAW_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH0_INT_RAW_V 0x1
#define DMA_IN_DSCR_ERR_CH0_INT_RAW_S 5
/* DMA_OUT_EOF_CH0_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one outlink descriptor has been read from memory for Tx channel 0.*/
#define DMA_OUT_EOF_CH0_INT_RAW (BIT(4))
#define DMA_OUT_EOF_CH0_INT_RAW_M (BIT(4))
#define DMA_OUT_EOF_CH0_INT_RAW_V 0x1
#define DMA_OUT_EOF_CH0_INT_RAW_S 4
/* DMA_OUT_DONE_CH0_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 0.*/
#define DMA_OUT_DONE_CH0_INT_RAW (BIT(3))
#define DMA_OUT_DONE_CH0_INT_RAW_M (BIT(3))
#define DMA_OUT_DONE_CH0_INT_RAW_V 0x1
#define DMA_OUT_DONE_CH0_INT_RAW_S 3
/* DMA_IN_ERR_EOF_CH0_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data error is
 detected only in the case that the peripheral is UHCI0 for Rx channel 0. For other peripherals  this raw interrupt is reserved.*/
#define DMA_IN_ERR_EOF_CH0_INT_RAW (BIT(2))
#define DMA_IN_ERR_EOF_CH0_INT_RAW_M (BIT(2))
#define DMA_IN_ERR_EOF_CH0_INT_RAW_V 0x1
#define DMA_IN_ERR_EOF_CH0_INT_RAW_S 2
/* DMA_IN_SUC_EOF_CH0_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one inlink descriptor has been received for Rx channel 0. For UHCI0  the raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 0.*/
#define DMA_IN_SUC_EOF_CH0_INT_RAW (BIT(1))
#define DMA_IN_SUC_EOF_CH0_INT_RAW_M (BIT(1))
#define DMA_IN_SUC_EOF_CH0_INT_RAW_V 0x1
#define DMA_IN_SUC_EOF_CH0_INT_RAW_S 1
/* DMA_IN_DONE_CH0_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one inlink descriptor has been received for Rx channel 0.*/
#define DMA_IN_DONE_CH0_INT_RAW (BIT(0))
#define DMA_IN_DONE_CH0_INT_RAW_M (BIT(0))
#define DMA_IN_DONE_CH0_INT_RAW_V 0x1
#define DMA_IN_DONE_CH0_INT_RAW_S 0

