espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_INT_RAW_CH2_REG (DR_REG_DMA_BASE + 0x030)
/* DMA_OUTFIFO_UDF_L3_CH2_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Tx channel 2 is underflow.*/
#define DMA_OUTFIFO_UDF_L3_CH2_INT_RAW (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH2_INT_RAW_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH2_INT_RAW_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH2_INT_RAW_S 17
/* DMA_OUTFIFO_OVF_L3_CH2_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Tx channel 2 is overflow.*/
#define DMA_OUTFIFO_OVF_L3_CH2_INT_RAW (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH2_INT_RAW_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH2_INT_RAW_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH2_INT_RAW_S 16
/* DMA_OUTFIFO_UDF_L1_CH2_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Tx channel 2 is underflow.*/
#define DMA_OUTFIFO_UDF_L1_CH2_INT_RAW (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH2_INT_RAW_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH2_INT_RAW_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH2_INT_RAW_S 15
/* DMA_OUTFIFO_OVF_L1_CH2_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Tx channel 2 is overflow.*/
#define DMA_OUTFIFO_OVF_L1_CH2_INT_RAW (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH2_INT_RAW_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH2_INT_RAW_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH2_INT_RAW_S 14
/* DMA_INFIFO_UDF_L3_CH2_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Rx channel 2 is underflow.*/
#define DMA_INFIFO_UDF_L3_CH2_INT_RAW (BIT(13))
#define DMA_INFIFO_UDF_L3_CH2_INT_RAW_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH2_INT_RAW_V 0x1
#define DMA_INFIFO_UDF_L3_CH2_INT_RAW_S 13
/* DMA_INFIFO_OVF_L3_CH2_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Rx channel 2 is overflow.*/
#define DMA_INFIFO_OVF_L3_CH2_INT_RAW (BIT(12))
#define DMA_INFIFO_OVF_L3_CH2_INT_RAW_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH2_INT_RAW_V 0x1
#define DMA_INFIFO_OVF_L3_CH2_INT_RAW_S 12
/* DMA_INFIFO_UDF_L1_CH2_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Rx channel 2 is underflow.*/
#define DMA_INFIFO_UDF_L1_CH2_INT_RAW (BIT(11))
#define DMA_INFIFO_UDF_L1_CH2_INT_RAW_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH2_INT_RAW_V 0x1
#define DMA_INFIFO_UDF_L1_CH2_INT_RAW_S 11
/* DMA_INFIFO_OVF_L1_CH2_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Rx channel 2 is overflow.*/
#define DMA_INFIFO_OVF_L1_CH2_INT_RAW (BIT(10))
#define DMA_INFIFO_OVF_L1_CH2_INT_RAW_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH2_INT_RAW_V 0x1
#define DMA_INFIFO_OVF_L1_CH2_INT_RAW_S 10
/* DMA_INFIFO_FULL_WM_CH2_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when received data
 byte number is up to threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 2.*/
#define DMA_INFIFO_FULL_WM_CH2_INT_RAW (BIT(9))
#define DMA_INFIFO_FULL_WM_CH2_INT_RAW_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH2_INT_RAW_V 0x1
#define DMA_INFIFO_FULL_WM_CH2_INT_RAW_S 9
/* DMA_OUT_TOTAL_EOF_CH2_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data corresponding
 a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 2.*/
#define DMA_OUT_TOTAL_EOF_CH2_INT_RAW (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH2_INT_RAW_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH2_INT_RAW_V 0x1
#define DMA_OUT_TOTAL_EOF_CH2_INT_RAW_S 8
/* DMA_IN_DSCR_EMPTY_CH2_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when Rx buffer pointed
 by inlink is full and receiving data is not completed  but there is no more inlink for Rx channel 2.*/
#define DMA_IN_DSCR_EMPTY_CH2_INT_RAW (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH2_INT_RAW_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH2_INT_RAW_V 0x1
#define DMA_IN_DSCR_EMPTY_CH2_INT_RAW_S 7
/* DMA_OUT_DSCR_ERR_CH2_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting outlink
 descriptor error  including owner error  the second and third word error of outlink descriptor for Tx channel 2.*/
#define DMA_OUT_DSCR_ERR_CH2_INT_RAW (BIT(6))
#define DMA_OUT_DSCR_ERR_CH2_INT_RAW_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH2_INT_RAW_V 0x1
#define DMA_OUT_DSCR_ERR_CH2_INT_RAW_S 6
/* DMA_IN_DSCR_ERR_CH2_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting inlink
 descriptor error  including owner error  the second and third word error of inlink descriptor for Rx channel 2.*/
#define DMA_IN_DSCR_ERR_CH2_INT_RAW (BIT(5))
#define DMA_IN_DSCR_ERR_CH2_INT_RAW_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH2_INT_RAW_V 0x1
#define DMA_IN_DSCR_ERR_CH2_INT_RAW_S 5
/* DMA_OUT_EOF_CH2_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one outlink descriptor has been read from memory for Tx channel 2.*/
#define DMA_OUT_EOF_CH2_INT_RAW (BIT(4))
#define DMA_OUT_EOF_CH2_INT_RAW_M (BIT(4))
#define DMA_OUT_EOF_CH2_INT_RAW_V 0x1
#define DMA_OUT_EOF_CH2_INT_RAW_S 4
/* DMA_OUT_DONE_CH2_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 2.*/
#define DMA_OUT_DONE_CH2_INT_RAW (BIT(3))
#define DMA_OUT_DONE_CH2_INT_RAW_M (BIT(3))
#define DMA_OUT_DONE_CH2_INT_RAW_V 0x1
#define DMA_OUT_DONE_CH2_INT_RAW_S 3
/* DMA_IN_ERR_EOF_CH2_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data error is
 detected only in the case that the peripheral is UHCI0 for Rx channel 2. For other peripherals  this raw interrupt is reserved.*/
#define DMA_IN_ERR_EOF_CH2_INT_RAW (BIT(2))
#define DMA_IN_ERR_EOF_CH2_INT_RAW_M (BIT(2))
#define DMA_IN_ERR_EOF_CH2_INT_RAW_V 0x1
#define DMA_IN_ERR_EOF_CH2_INT_RAW_S 2
/* DMA_IN_SUC_EOF_CH2_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one inlink descriptor has been received for Rx channel 2. For UHCI0  the raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 2.*/
#define DMA_IN_SUC_EOF_CH2_INT_RAW (BIT(1))
#define DMA_IN_SUC_EOF_CH2_INT_RAW_M (BIT(1))
#define DMA_IN_SUC_EOF_CH2_INT_RAW_V 0x1
#define DMA_IN_SUC_EOF_CH2_INT_RAW_S 1
/* DMA_IN_DONE_CH2_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one inlink descriptor has been received for Rx channel 2.*/
#define DMA_IN_DONE_CH2_INT_RAW (BIT(0))
#define DMA_IN_DONE_CH2_INT_RAW_M (BIT(0))
#define DMA_IN_DONE_CH2_INT_RAW_V 0x1
#define DMA_IN_DONE_CH2_INT_RAW_S 0

#define DMA_INT_RAW_CH3_REG (DR_REG_DMA_BASE + 0x034)
/* DMA_OUTFIFO_UDF_L3_CH3_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Tx channel 3 is underflow.*/
#define DMA_OUTFIFO_UDF_L3_CH3_INT_RAW (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH3_INT_RAW_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH3_INT_RAW_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH3_INT_RAW_S 17
/* DMA_OUTFIFO_OVF_L3_CH3_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Tx channel 3 is overflow.*/
#define DMA_OUTFIFO_OVF_L3_CH3_INT_RAW (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH3_INT_RAW_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH3_INT_RAW_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH3_INT_RAW_S 16
/* DMA_OUTFIFO_UDF_L1_CH3_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Tx channel 3 is underflow.*/
#define DMA_OUTFIFO_UDF_L1_CH3_INT_RAW (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH3_INT_RAW_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH3_INT_RAW_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH3_INT_RAW_S 15
/* DMA_OUTFIFO_OVF_L1_CH3_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Tx channel 3 is overflow.*/
#define DMA_OUTFIFO_OVF_L1_CH3_INT_RAW (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH3_INT_RAW_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH3_INT_RAW_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH3_INT_RAW_S 14
/* DMA_INFIFO_UDF_L3_CH3_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Rx channel 3 is underflow.*/
#define DMA_INFIFO_UDF_L3_CH3_INT_RAW (BIT(13))
#define DMA_INFIFO_UDF_L3_CH3_INT_RAW_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH3_INT_RAW_V 0x1
#define DMA_INFIFO_UDF_L3_CH3_INT_RAW_S 13
/* DMA_INFIFO_OVF_L3_CH3_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Rx channel 3 is overflow.*/
#define DMA_INFIFO_OVF_L3_CH3_INT_RAW (BIT(12))
#define DMA_INFIFO_OVF_L3_CH3_INT_RAW_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH3_INT_RAW_V 0x1
#define DMA_INFIFO_OVF_L3_CH3_INT_RAW_S 12
/* DMA_INFIFO_UDF_L1_CH3_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Rx channel 3 is underflow.*/
#define DMA_INFIFO_UDF_L1_CH3_INT_RAW (BIT(11))
#define DMA_INFIFO_UDF_L1_CH3_INT_RAW_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH3_INT_RAW_V 0x1
#define DMA_INFIFO_UDF_L1_CH3_INT_RAW_S 11
/* DMA_INFIFO_OVF_L1_CH3_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Rx channel 3 is overflow.*/
#define DMA_INFIFO_OVF_L1_CH3_INT_RAW (BIT(10))
#define DMA_INFIFO_OVF_L1_CH3_INT_RAW_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH3_INT_RAW_V 0x1
#define DMA_INFIFO_OVF_L1_CH3_INT_RAW_S 10
/* DMA_INFIFO_FULL_WM_CH3_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when received data
 byte number is up to threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 3.*/
#define DMA_INFIFO_FULL_WM_CH3_INT_RAW (BIT(9))
#define DMA_INFIFO_FULL_WM_CH3_INT_RAW_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH3_INT_RAW_V 0x1
#define DMA_INFIFO_FULL_WM_CH3_INT_RAW_S 9
/* DMA_OUT_TOTAL_EOF_CH3_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data corresponding
 a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 3.*/
#define DMA_OUT_TOTAL_EOF_CH3_INT_RAW (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH3_INT_RAW_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH3_INT_RAW_V 0x1
#define DMA_OUT_TOTAL_EOF_CH3_INT_RAW_S 8
/* DMA_IN_DSCR_EMPTY_CH3_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when Rx buffer pointed
 by inlink is full and receiving data is not completed  but there is no more inlink for Rx channel 3.*/
#define DMA_IN_DSCR_EMPTY_CH3_INT_RAW (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH3_INT_RAW_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH3_INT_RAW_V 0x1
#define DMA_IN_DSCR_EMPTY_CH3_INT_RAW_S 7
/* DMA_OUT_DSCR_ERR_CH3_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting outlink
 descriptor error  including owner error  the second and third word error of outlink descriptor for Tx channel 3.*/
#define DMA_OUT_DSCR_ERR_CH3_INT_RAW (BIT(6))
#define DMA_OUT_DSCR_ERR_CH3_INT_RAW_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH3_INT_RAW_V 0x1
#define DMA_OUT_DSCR_ERR_CH3_INT_RAW_S 6
/* DMA_IN_DSCR_ERR_CH3_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting inlink
 descriptor error  including owner error  the second and third word error of inlink descriptor for Rx channel 3.*/
#define DMA_IN_DSCR_ERR_CH3_INT_RAW (BIT(5))
#define DMA_IN_DSCR_ERR_CH3_INT_RAW_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH3_INT_RAW_V 0x1
#define DMA_IN_DSCR_ERR_CH3_INT_RAW_S 5
/* DMA_OUT_EOF_CH3_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one outlink descriptor has been read from memory for Tx channel 3.*/
#define DMA_OUT_EOF_CH3_INT_RAW (BIT(4))
#define DMA_OUT_EOF_CH3_INT_RAW_M (BIT(4))
#define DMA_OUT_EOF_CH3_INT_RAW_V 0x1
#define DMA_OUT_EOF_CH3_INT_RAW_S 4
/* DMA_OUT_DONE_CH3_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 3.*/
#define DMA_OUT_DONE_CH3_INT_RAW (BIT(3))
#define DMA_OUT_DONE_CH3_INT_RAW_M (BIT(3))
#define DMA_OUT_DONE_CH3_INT_RAW_V 0x1
#define DMA_OUT_DONE_CH3_INT_RAW_S 3
/* DMA_IN_ERR_EOF_CH3_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data error is
 detected only in the case that the peripheral is UHCI0 for Rx channel 3. For other peripherals  this raw interrupt is reserved.*/
#define DMA_IN_ERR_EOF_CH3_INT_RAW (BIT(2))
#define DMA_IN_ERR_EOF_CH3_INT_RAW_M (BIT(2))
#define DMA_IN_ERR_EOF_CH3_INT_RAW_V 0x1
#define DMA_IN_ERR_EOF_CH3_INT_RAW_S 2
/* DMA_IN_SUC_EOF_CH3_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one inlink descriptor has been received for Rx channel 3. For UHCI0  the raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 3.*/
#define DMA_IN_SUC_EOF_CH3_INT_RAW (BIT(1))
#define DMA_IN_SUC_EOF_CH3_INT_RAW_M (BIT(1))
#define DMA_IN_SUC_EOF_CH3_INT_RAW_V 0x1
#define DMA_IN_SUC_EOF_CH3_INT_RAW_S 1
/* DMA_IN_DONE_CH3_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one inlink descriptor has been received for Rx channel 3.*/
#define DMA_IN_DONE_CH3_INT_RAW (BIT(0))
#define DMA_IN_DONE_CH3_INT_RAW_M (BIT(0))
#define DMA_IN_DONE_CH3_INT_RAW_V 0x1
#define DMA_IN_DONE_CH3_INT_RAW_S 0

#define DMA_INT_RAW_CH4_REG (DR_REG_DMA_BASE + 0x038)
/* DMA_OUTFIFO_UDF_L3_CH4_INT_RAW : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Tx channel 4 is underflow.*/
#define DMA_OUTFIFO_UDF_L3_CH4_INT_RAW (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH4_INT_RAW_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH4_INT_RAW_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH4_INT_RAW_S 17
/* DMA_OUTFIFO_OVF_L3_CH4_INT_RAW : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Tx channel 4 is overflow.*/
#define DMA_OUTFIFO_OVF_L3_CH4_INT_RAW (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH4_INT_RAW_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH4_INT_RAW_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH4_INT_RAW_S 16
/* DMA_OUTFIFO_UDF_L1_CH4_INT_RAW : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Tx channel 4 is underflow.*/
#define DMA_OUTFIFO_UDF_L1_CH4_INT_RAW (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH4_INT_RAW_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH4_INT_RAW_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH4_INT_RAW_S 15
/* DMA_OUTFIFO_OVF_L1_CH4_INT_RAW : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Tx channel 4 is overflow.*/
#define DMA_OUTFIFO_OVF_L1_CH4_INT_RAW (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH4_INT_RAW_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH4_INT_RAW_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH4_INT_RAW_S 14
/* DMA_INFIFO_UDF_L3_CH4_INT_RAW : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Rx channel 4 is underflow.*/
#define DMA_INFIFO_UDF_L3_CH4_INT_RAW (BIT(13))
#define DMA_INFIFO_UDF_L3_CH4_INT_RAW_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH4_INT_RAW_V 0x1
#define DMA_INFIFO_UDF_L3_CH4_INT_RAW_S 13
/* DMA_INFIFO_OVF_L3_CH4_INT_RAW : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 3 fifo
 of Rx channel 4 is overflow.*/
#define DMA_INFIFO_OVF_L3_CH4_INT_RAW (BIT(12))
#define DMA_INFIFO_OVF_L3_CH4_INT_RAW_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH4_INT_RAW_V 0x1
#define DMA_INFIFO_OVF_L3_CH4_INT_RAW_S 12
/* DMA_INFIFO_UDF_L1_CH4_INT_RAW : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Rx channel 4 is underflow.*/
#define DMA_INFIFO_UDF_L1_CH4_INT_RAW (BIT(11))
#define DMA_INFIFO_UDF_L1_CH4_INT_RAW_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH4_INT_RAW_V 0x1
#define DMA_INFIFO_UDF_L1_CH4_INT_RAW_S 11
/* DMA_INFIFO_OVF_L1_CH4_INT_RAW : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: This raw interrupt bit turns to high level when level 1 fifo
 of Rx channel 4 is overflow.*/
#define DMA_INFIFO_OVF_L1_CH4_INT_RAW (BIT(10))
#define DMA_INFIFO_OVF_L1_CH4_INT_RAW_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH4_INT_RAW_V 0x1
#define DMA_INFIFO_OVF_L1_CH4_INT_RAW_S 10
/* DMA_INFIFO_FULL_WM_CH4_INT_RAW : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when received data
 byte number is up to threshold configured by REG_DMA_INFIFO_FULL_THRS_CH0 in Rx FIFO of channel 4.*/
#define DMA_INFIFO_FULL_WM_CH4_INT_RAW (BIT(9))
#define DMA_INFIFO_FULL_WM_CH4_INT_RAW_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH4_INT_RAW_V 0x1
#define DMA_INFIFO_FULL_WM_CH4_INT_RAW_S 9
/* DMA_OUT_TOTAL_EOF_CH4_INT_RAW : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data corresponding
 a outlink (includes one link descriptor or few link descriptors) is transmitted out for Tx channel 4.*/
#define DMA_OUT_TOTAL_EOF_CH4_INT_RAW (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH4_INT_RAW_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH4_INT_RAW_V 0x1
#define DMA_OUT_TOTAL_EOF_CH4_INT_RAW_S 8
/* DMA_IN_DSCR_EMPTY_CH4_INT_RAW : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when Rx buffer pointed
 by inlink is full and receiving data is not completed  but there is no more inlink for Rx channel 4.*/
#define DMA_IN_DSCR_EMPTY_CH4_INT_RAW (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH4_INT_RAW_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH4_INT_RAW_V 0x1
#define DMA_IN_DSCR_EMPTY_CH4_INT_RAW_S 7
/* DMA_OUT_DSCR_ERR_CH4_INT_RAW : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting outlink
 descriptor error  including owner error  the second and third word error of outlink descriptor for Tx channel 4.*/
#define DMA_OUT_DSCR_ERR_CH4_INT_RAW (BIT(6))
#define DMA_OUT_DSCR_ERR_CH4_INT_RAW_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH4_INT_RAW_V 0x1
#define DMA_OUT_DSCR_ERR_CH4_INT_RAW_S 6
/* DMA_IN_DSCR_ERR_CH4_INT_RAW : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when detecting inlink
 descriptor error  including owner error  the second and third word error of inlink descriptor for Rx channel 4.*/
#define DMA_IN_DSCR_ERR_CH4_INT_RAW (BIT(5))
#define DMA_IN_DSCR_ERR_CH4_INT_RAW_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH4_INT_RAW_V 0x1
#define DMA_IN_DSCR_ERR_CH4_INT_RAW_S 5
/* DMA_OUT_EOF_CH4_INT_RAW : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one outlink descriptor has been read from memory for Tx channel 4.*/
#define DMA_OUT_EOF_CH4_INT_RAW (BIT(4))
#define DMA_OUT_EOF_CH4_INT_RAW_M (BIT(4))
#define DMA_OUT_EOF_CH4_INT_RAW_V 0x1
#define DMA_OUT_EOF_CH4_INT_RAW_S 4
/* DMA_OUT_DONE_CH4_INT_RAW : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one outlink descriptor has been transmitted to peripherals for Tx channel 4.*/
#define DMA_OUT_DONE_CH4_INT_RAW (BIT(3))
#define DMA_OUT_DONE_CH4_INT_RAW_M (BIT(3))
#define DMA_OUT_DONE_CH4_INT_RAW_V 0x1
#define DMA_OUT_DONE_CH4_INT_RAW_S 3
/* DMA_IN_ERR_EOF_CH4_INT_RAW : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when data error is
 detected only in the case that the peripheral is UHCI0 for Rx channel 4. For other peripherals  this raw interrupt is reserved.*/
#define DMA_IN_ERR_EOF_CH4_INT_RAW (BIT(2))
#define DMA_IN_ERR_EOF_CH4_INT_RAW_M (BIT(2))
#define DMA_IN_ERR_EOF_CH4_INT_RAW_V 0x1
#define DMA_IN_ERR_EOF_CH4_INT_RAW_S 2
/* DMA_IN_SUC_EOF_CH4_INT_RAW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one inlink descriptor has been received for Rx channel 4. For UHCI0  the raw interrupt bit turns to high level when the last data pointed by one inlink descriptor has been received and no data error is detected for Rx channel 4.*/
#define DMA_IN_SUC_EOF_CH4_INT_RAW (BIT(1))
#define DMA_IN_SUC_EOF_CH4_INT_RAW_M (BIT(1))
#define DMA_IN_SUC_EOF_CH4_INT_RAW_V 0x1
#define DMA_IN_SUC_EOF_CH4_INT_RAW_S 1
/* DMA_IN_DONE_CH4_INT_RAW : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt bit turns to high level when the last data
 pointed by one inlink descriptor has been received for Rx channel 4.*/
#define DMA_IN_DONE_CH4_INT_RAW (BIT(0))
#define DMA_IN_DONE_CH4_INT_RAW_M (BIT(0))
#define DMA_IN_DONE_CH4_INT_RAW_V 0x1
#define DMA_IN_DONE_CH4_INT_RAW_S 0

