espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_INT_ST_CH0_REG (DR_REG_DMA_BASE + 0x040)
/* DMA_OUTFIFO_UDF_L3_CH0_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH0_INT_ST (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH0_INT_ST_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH0_INT_ST_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH0_INT_ST_S 17
/* DMA_OUTFIFO_OVF_L3_CH0_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH0_INT_ST (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH0_INT_ST_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH0_INT_ST_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH0_INT_ST_S 16
/* DMA_OUTFIFO_UDF_L1_CH0_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH0_INT_ST (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH0_INT_ST_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH0_INT_ST_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH0_INT_ST_S 15
/* DMA_OUTFIFO_OVF_L1_CH0_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH0_INT_ST (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH0_INT_ST_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH0_INT_ST_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH0_INT_ST_S 14
/* DMA_INFIFO_UDF_L3_CH0_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH0_INT_ST (BIT(13))
#define DMA_INFIFO_UDF_L3_CH0_INT_ST_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH0_INT_ST_V 0x1
#define DMA_INFIFO_UDF_L3_CH0_INT_ST_S 13
/* DMA_INFIFO_OVF_L3_CH0_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH0_INT_ST (BIT(12))
#define DMA_INFIFO_OVF_L3_CH0_INT_ST_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH0_INT_ST_V 0x1
#define DMA_INFIFO_OVF_L3_CH0_INT_ST_S 12
/* DMA_INFIFO_UDF_L1_CH0_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH0_INT_ST (BIT(11))
#define DMA_INFIFO_UDF_L1_CH0_INT_ST_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH0_INT_ST_V 0x1
#define DMA_INFIFO_UDF_L1_CH0_INT_ST_S 11
/* DMA_INFIFO_OVF_L1_CH0_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH0_INT_ST (BIT(10))
#define DMA_INFIFO_OVF_L1_CH0_INT_ST_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH0_INT_ST_V 0x1
#define DMA_INFIFO_OVF_L1_CH0_INT_ST_S 10
/* DMA_INFIFO_FULL_WM_CH0_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH0_INT_ST (BIT(9))
#define DMA_INFIFO_FULL_WM_CH0_INT_ST_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH0_INT_ST_V 0x1
#define DMA_INFIFO_FULL_WM_CH0_INT_ST_S 9
/* DMA_OUT_TOTAL_EOF_CH0_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH0_INT_ST (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH0_INT_ST_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH0_INT_ST_V 0x1
#define DMA_OUT_TOTAL_EOF_CH0_INT_ST_S 8
/* DMA_IN_DSCR_EMPTY_CH0_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH0_INT_ST (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH0_INT_ST_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH0_INT_ST_V 0x1
#define DMA_IN_DSCR_EMPTY_CH0_INT_ST_S 7
/* DMA_OUT_DSCR_ERR_CH0_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH0_INT_ST (BIT(6))
#define DMA_OUT_DSCR_ERR_CH0_INT_ST_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH0_INT_ST_V 0x1
#define DMA_OUT_DSCR_ERR_CH0_INT_ST_S 6
/* DMA_IN_DSCR_ERR_CH0_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH0_INT_ST (BIT(5))
#define DMA_IN_DSCR_ERR_CH0_INT_ST_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH0_INT_ST_V 0x1
#define DMA_IN_DSCR_ERR_CH0_INT_ST_S 5
/* DMA_OUT_EOF_CH0_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH0_INT_ST (BIT(4))
#define DMA_OUT_EOF_CH0_INT_ST_M (BIT(4))
#define DMA_OUT_EOF_CH0_INT_ST_V 0x1
#define DMA_OUT_EOF_CH0_INT_ST_S 4
/* DMA_OUT_DONE_CH0_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH0_INT_ST (BIT(3))
#define DMA_OUT_DONE_CH0_INT_ST_M (BIT(3))
#define DMA_OUT_DONE_CH0_INT_ST_V 0x1
#define DMA_OUT_DONE_CH0_INT_ST_S 3
/* DMA_IN_ERR_EOF_CH0_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH0_INT_ST (BIT(2))
#define DMA_IN_ERR_EOF_CH0_INT_ST_M (BIT(2))
#define DMA_IN_ERR_EOF_CH0_INT_ST_V 0x1
#define DMA_IN_ERR_EOF_CH0_INT_ST_S 2
/* DMA_IN_SUC_EOF_CH0_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH0_INT_ST (BIT(1))
#define DMA_IN_SUC_EOF_CH0_INT_ST_M (BIT(1))
#define DMA_IN_SUC_EOF_CH0_INT_ST_V 0x1
#define DMA_IN_SUC_EOF_CH0_INT_ST_S 1
/* DMA_IN_DONE_CH0_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH0_INT_ST (BIT(0))
#define DMA_IN_DONE_CH0_INT_ST_M (BIT(0))
#define DMA_IN_DONE_CH0_INT_ST_V 0x1
#define DMA_IN_DONE_CH0_INT_ST_S 0

#define DMA_INT_ST_CH1_REG (DR_REG_DMA_BASE + 0x044)
/* DMA_OUTFIFO_UDF_L3_CH1_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH1_INT_ST (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH1_INT_ST_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH1_INT_ST_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH1_INT_ST_S 17
/* DMA_OUTFIFO_OVF_L3_CH1_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH1_INT_ST (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH1_INT_ST_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH1_INT_ST_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH1_INT_ST_S 16
/* DMA_OUTFIFO_UDF_L1_CH1_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH1_INT_ST (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH1_INT_ST_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH1_INT_ST_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH1_INT_ST_S 15
/* DMA_OUTFIFO_OVF_L1_CH1_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH1_INT_ST (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH1_INT_ST_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH1_INT_ST_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH1_INT_ST_S 14
/* DMA_INFIFO_UDF_L3_CH1_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH1_INT_ST (BIT(13))
#define DMA_INFIFO_UDF_L3_CH1_INT_ST_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH1_INT_ST_V 0x1
#define DMA_INFIFO_UDF_L3_CH1_INT_ST_S 13
/* DMA_INFIFO_OVF_L3_CH1_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH1_INT_ST (BIT(12))
#define DMA_INFIFO_OVF_L3_CH1_INT_ST_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH1_INT_ST_V 0x1
#define DMA_INFIFO_OVF_L3_CH1_INT_ST_S 12
/* DMA_INFIFO_UDF_L1_CH1_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH1_INT_ST (BIT(11))
#define DMA_INFIFO_UDF_L1_CH1_INT_ST_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH1_INT_ST_V 0x1
#define DMA_INFIFO_UDF_L1_CH1_INT_ST_S 11
/* DMA_INFIFO_OVF_L1_CH1_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH1_INT_ST (BIT(10))
#define DMA_INFIFO_OVF_L1_CH1_INT_ST_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH1_INT_ST_V 0x1
#define DMA_INFIFO_OVF_L1_CH1_INT_ST_S 10
/* DMA_INFIFO_FULL_WM_CH1_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH1_INT_ST (BIT(9))
#define DMA_INFIFO_FULL_WM_CH1_INT_ST_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH1_INT_ST_V 0x1
#define DMA_INFIFO_FULL_WM_CH1_INT_ST_S 9
/* DMA_OUT_TOTAL_EOF_CH1_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH1_INT_ST (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH1_INT_ST_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH1_INT_ST_V 0x1
#define DMA_OUT_TOTAL_EOF_CH1_INT_ST_S 8
/* DMA_IN_DSCR_EMPTY_CH1_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH1_INT_ST (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH1_INT_ST_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH1_INT_ST_V 0x1
#define DMA_IN_DSCR_EMPTY_CH1_INT_ST_S 7
/* DMA_OUT_DSCR_ERR_CH1_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH1_INT_ST (BIT(6))
#define DMA_OUT_DSCR_ERR_CH1_INT_ST_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH1_INT_ST_V 0x1
#define DMA_OUT_DSCR_ERR_CH1_INT_ST_S 6
/* DMA_IN_DSCR_ERR_CH1_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH1_INT_ST (BIT(5))
#define DMA_IN_DSCR_ERR_CH1_INT_ST_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH1_INT_ST_V 0x1
#define DMA_IN_DSCR_ERR_CH1_INT_ST_S 5
/* DMA_OUT_EOF_CH1_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH1_INT_ST (BIT(4))
#define DMA_OUT_EOF_CH1_INT_ST_M (BIT(4))
#define DMA_OUT_EOF_CH1_INT_ST_V 0x1
#define DMA_OUT_EOF_CH1_INT_ST_S 4
/* DMA_OUT_DONE_CH1_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH1_INT_ST (BIT(3))
#define DMA_OUT_DONE_CH1_INT_ST_M (BIT(3))
#define DMA_OUT_DONE_CH1_INT_ST_V 0x1
#define DMA_OUT_DONE_CH1_INT_ST_S 3
/* DMA_IN_ERR_EOF_CH1_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH1_INT_ST (BIT(2))
#define DMA_IN_ERR_EOF_CH1_INT_ST_M (BIT(2))
#define DMA_IN_ERR_EOF_CH1_INT_ST_V 0x1
#define DMA_IN_ERR_EOF_CH1_INT_ST_S 2
/* DMA_IN_SUC_EOF_CH1_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH1_INT_ST (BIT(1))
#define DMA_IN_SUC_EOF_CH1_INT_ST_M (BIT(1))
#define DMA_IN_SUC_EOF_CH1_INT_ST_V 0x1
#define DMA_IN_SUC_EOF_CH1_INT_ST_S 1
/* DMA_IN_DONE_CH1_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH1_INT_ST (BIT(0))
#define DMA_IN_DONE_CH1_INT_ST_M (BIT(0))
#define DMA_IN_DONE_CH1_INT_ST_V 0x1
#define DMA_IN_DONE_CH1_INT_ST_S 0

#define DMA_INT_ST_CH2_REG (DR_REG_DMA_BASE + 0x048)
/* DMA_OUTFIFO_UDF_L3_CH2_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH2_INT_ST (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH2_INT_ST_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH2_INT_ST_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH2_INT_ST_S 17
/* DMA_OUTFIFO_OVF_L3_CH2_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH2_INT_ST (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH2_INT_ST_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH2_INT_ST_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH2_INT_ST_S 16
/* DMA_OUTFIFO_UDF_L1_CH2_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH2_INT_ST (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH2_INT_ST_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH2_INT_ST_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH2_INT_ST_S 15
/* DMA_OUTFIFO_OVF_L1_CH2_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH2_INT_ST (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH2_INT_ST_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH2_INT_ST_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH2_INT_ST_S 14
/* DMA_INFIFO_UDF_L3_CH2_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH2_INT_ST (BIT(13))
#define DMA_INFIFO_UDF_L3_CH2_INT_ST_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH2_INT_ST_V 0x1
#define DMA_INFIFO_UDF_L3_CH2_INT_ST_S 13
/* DMA_INFIFO_OVF_L3_CH2_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH2_INT_ST (BIT(12))
#define DMA_INFIFO_OVF_L3_CH2_INT_ST_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH2_INT_ST_V 0x1
#define DMA_INFIFO_OVF_L3_CH2_INT_ST_S 12
/* DMA_INFIFO_UDF_L1_CH2_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH2_INT_ST (BIT(11))
#define DMA_INFIFO_UDF_L1_CH2_INT_ST_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH2_INT_ST_V 0x1
#define DMA_INFIFO_UDF_L1_CH2_INT_ST_S 11
/* DMA_INFIFO_OVF_L1_CH2_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH2_INT_ST (BIT(10))
#define DMA_INFIFO_OVF_L1_CH2_INT_ST_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH2_INT_ST_V 0x1
#define DMA_INFIFO_OVF_L1_CH2_INT_ST_S 10
/* DMA_INFIFO_FULL_WM_CH2_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH2_INT_ST (BIT(9))
#define DMA_INFIFO_FULL_WM_CH2_INT_ST_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH2_INT_ST_V 0x1
#define DMA_INFIFO_FULL_WM_CH2_INT_ST_S 9
/* DMA_OUT_TOTAL_EOF_CH2_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH2_INT_ST (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH2_INT_ST_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH2_INT_ST_V 0x1
#define DMA_OUT_TOTAL_EOF_CH2_INT_ST_S 8
/* DMA_IN_DSCR_EMPTY_CH2_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH2_INT_ST (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH2_INT_ST_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH2_INT_ST_V 0x1
#define DMA_IN_DSCR_EMPTY_CH2_INT_ST_S 7
/* DMA_OUT_DSCR_ERR_CH2_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH2_INT_ST (BIT(6))
#define DMA_OUT_DSCR_ERR_CH2_INT_ST_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH2_INT_ST_V 0x1
#define DMA_OUT_DSCR_ERR_CH2_INT_ST_S 6
/* DMA_IN_DSCR_ERR_CH2_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH2_INT_ST (BIT(5))
#define DMA_IN_DSCR_ERR_CH2_INT_ST_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH2_INT_ST_V 0x1
#define DMA_IN_DSCR_ERR_CH2_INT_ST_S 5
/* DMA_OUT_EOF_CH2_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH2_INT_ST (BIT(4))
#define DMA_OUT_EOF_CH2_INT_ST_M (BIT(4))
#define DMA_OUT_EOF_CH2_INT_ST_V 0x1
#define DMA_OUT_EOF_CH2_INT_ST_S 4
/* DMA_OUT_DONE_CH2_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH2_INT_ST (BIT(3))
#define DMA_OUT_DONE_CH2_INT_ST_M (BIT(3))
#define DMA_OUT_DONE_CH2_INT_ST_V 0x1
#define DMA_OUT_DONE_CH2_INT_ST_S 3
/* DMA_IN_ERR_EOF_CH2_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH2_INT_ST (BIT(2))
#define DMA_IN_ERR_EOF_CH2_INT_ST_M (BIT(2))
#define DMA_IN_ERR_EOF_CH2_INT_ST_V 0x1
#define DMA_IN_ERR_EOF_CH2_INT_ST_S 2
/* DMA_IN_SUC_EOF_CH2_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH2_INT_ST (BIT(1))
#define DMA_IN_SUC_EOF_CH2_INT_ST_M (BIT(1))
#define DMA_IN_SUC_EOF_CH2_INT_ST_V 0x1
#define DMA_IN_SUC_EOF_CH2_INT_ST_S 1
/* DMA_IN_DONE_CH2_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH2_INT_ST (BIT(0))
#define DMA_IN_DONE_CH2_INT_ST_M (BIT(0))
#define DMA_IN_DONE_CH2_INT_ST_V 0x1
#define DMA_IN_DONE_CH2_INT_ST_S 0

#define DMA_INT_ST_CH3_REG (DR_REG_DMA_BASE + 0x04C)
/* DMA_OUTFIFO_UDF_L3_CH3_INT_ST : RO ;bitpos:[17] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH3_INT_ST (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH3_INT_ST_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH3_INT_ST_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH3_INT_ST_S 17
/* DMA_OUTFIFO_OVF_L3_CH3_INT_ST : RO ;bitpos:[16] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH3_INT_ST (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH3_INT_ST_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH3_INT_ST_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH3_INT_ST_S 16
/* DMA_OUTFIFO_UDF_L1_CH3_INT_ST : RO ;bitpos:[15] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH3_INT_ST (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH3_INT_ST_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH3_INT_ST_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH3_INT_ST_S 15
/* DMA_OUTFIFO_OVF_L1_CH3_INT_ST : RO ;bitpos:[14] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH3_INT_ST (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH3_INT_ST_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH3_INT_ST_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH3_INT_ST_S 14
/* DMA_INFIFO_UDF_L3_CH3_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH3_INT_ST (BIT(13))
#define DMA_INFIFO_UDF_L3_CH3_INT_ST_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH3_INT_ST_V 0x1
#define DMA_INFIFO_UDF_L3_CH3_INT_ST_S 13
/* DMA_INFIFO_OVF_L3_CH3_INT_ST : RO ;bitpos:[12] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH3_INT_ST (BIT(12))
#define DMA_INFIFO_OVF_L3_CH3_INT_ST_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH3_INT_ST_V 0x1
#define DMA_INFIFO_OVF_L3_CH3_INT_ST_S 12
/* DMA_INFIFO_UDF_L1_CH3_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH3_INT_ST (BIT(11))
#define DMA_INFIFO_UDF_L1_CH3_INT_ST_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH3_INT_ST_V 0x1
#define DMA_INFIFO_UDF_L1_CH3_INT_ST_S 11
/* DMA_INFIFO_OVF_L1_CH3_INT_ST : RO ;bitpos:[10] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH3_INT_ST (BIT(10))
#define DMA_INFIFO_OVF_L1_CH3_INT_ST_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH3_INT_ST_V 0x1
#define DMA_INFIFO_OVF_L1_CH3_INT_ST_S 10
/* DMA_INFIFO_FULL_WM_CH3_INT_ST : RO ;bitpos:[9] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH3_INT_ST (BIT(9))
#define DMA_INFIFO_FULL_WM_CH3_INT_ST_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH3_INT_ST_V 0x1
#define DMA_INFIFO_FULL_WM_CH3_INT_ST_S 9
/* DMA_OUT_TOTAL_EOF_CH3_INT_ST : RO ;bitpos:[8] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH3_INT_ST (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH3_INT_ST_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH3_INT_ST_V 0x1
#define DMA_OUT_TOTAL_EOF_CH3_INT_ST_S 8
/* DMA_IN_DSCR_EMPTY_CH3_INT_ST : RO ;bitpos:[7] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH3_INT_ST (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH3_INT_ST_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH3_INT_ST_V 0x1
#define DMA_IN_DSCR_EMPTY_CH3_INT_ST_S 7
/* DMA_OUT_DSCR_ERR_CH3_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH3_INT_ST (BIT(6))
#define DMA_OUT_DSCR_ERR_CH3_INT_ST_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH3_INT_ST_V 0x1
#define DMA_OUT_DSCR_ERR_CH3_INT_ST_S 6
/* DMA_IN_DSCR_ERR_CH3_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH3_INT_ST (BIT(5))
#define DMA_IN_DSCR_ERR_CH3_INT_ST_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH3_INT_ST_V 0x1
#define DMA_IN_DSCR_ERR_CH3_INT_ST_S 5
/* DMA_OUT_EOF_CH3_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH3_INT_ST (BIT(4))
#define DMA_OUT_EOF_CH3_INT_ST_M (BIT(4))
#define DMA_OUT_EOF_CH3_INT_ST_V 0x1
#define DMA_OUT_EOF_CH3_INT_ST_S 4
/* DMA_OUT_DONE_CH3_INT_ST : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH3_INT_ST (BIT(3))
#define DMA_OUT_DONE_CH3_INT_ST_M (BIT(3))
#define DMA_OUT_DONE_CH3_INT_ST_V 0x1
#define DMA_OUT_DONE_CH3_INT_ST_S 3
/* DMA_IN_ERR_EOF_CH3_INT_ST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH3_INT_ST (BIT(2))
#define DMA_IN_ERR_EOF_CH3_INT_ST_M (BIT(2))
#define DMA_IN_ERR_EOF_CH3_INT_ST_V 0x1
#define DMA_IN_ERR_EOF_CH3_INT_ST_S 2
/* DMA_IN_SUC_EOF_CH3_INT_ST : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH3_INT_ST (BIT(1))
#define DMA_IN_SUC_EOF_CH3_INT_ST_M (BIT(1))
#define DMA_IN_SUC_EOF_CH3_INT_ST_V 0x1
#define DMA_IN_SUC_EOF_CH3_INT_ST_S 1
/* DMA_IN_DONE_CH3_INT_ST : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: The raw interrupt status bit for the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH3_INT_ST (BIT(0))
#define DMA_IN_DONE_CH3_INT_ST_M (BIT(0))
#define DMA_IN_DONE_CH3_INT_ST_V 0x1
#define DMA_IN_DONE_CH3_INT_ST_S 0

