espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_INT_ENA_CH4_REG (DR_REG_DMA_BASE + 0x064)
/* DMA_OUTFIFO_UDF_L3_CH4_INT_ENA : R/W ;bitpos:[17] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH4_INT_ENA (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH4_INT_ENA_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH4_INT_ENA_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH4_INT_ENA_S 17
/* DMA_OUTFIFO_OVF_L3_CH4_INT_ENA : R/W ;bitpos:[16] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH4_INT_ENA (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH4_INT_ENA_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH4_INT_ENA_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH4_INT_ENA_S 16
/* DMA_OUTFIFO_UDF_L1_CH4_INT_ENA : R/W ;bitpos:[15] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH4_INT_ENA (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH4_INT_ENA_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH4_INT_ENA_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH4_INT_ENA_S 15
/* DMA_OUTFIFO_OVF_L1_CH4_INT_ENA : R/W ;bitpos:[14] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH4_INT_ENA (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH4_INT_ENA_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH4_INT_ENA_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH4_INT_ENA_S 14
/* DMA_INFIFO_UDF_L3_CH4_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH4_INT_ENA (BIT(13))
#define DMA_INFIFO_UDF_L3_CH4_INT_ENA_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH4_INT_ENA_V 0x1
#define DMA_INFIFO_UDF_L3_CH4_INT_ENA_S 13
/* DMA_INFIFO_OVF_L3_CH4_INT_ENA : R/W ;bitpos:[12] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH4_INT_ENA (BIT(12))
#define DMA_INFIFO_OVF_L3_CH4_INT_ENA_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH4_INT_ENA_V 0x1
#define DMA_INFIFO_OVF_L3_CH4_INT_ENA_S 12
/* DMA_INFIFO_UDF_L1_CH4_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH4_INT_ENA (BIT(11))
#define DMA_INFIFO_UDF_L1_CH4_INT_ENA_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH4_INT_ENA_V 0x1
#define DMA_INFIFO_UDF_L1_CH4_INT_ENA_S 11
/* DMA_INFIFO_OVF_L1_CH4_INT_ENA : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH4_INT_ENA (BIT(10))
#define DMA_INFIFO_OVF_L1_CH4_INT_ENA_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH4_INT_ENA_V 0x1
#define DMA_INFIFO_OVF_L1_CH4_INT_ENA_S 10
/* DMA_INFIFO_FULL_WM_CH4_INT_ENA : R/W ;bitpos:[9] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH4_INT_ENA (BIT(9))
#define DMA_INFIFO_FULL_WM_CH4_INT_ENA_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH4_INT_ENA_V 0x1
#define DMA_INFIFO_FULL_WM_CH4_INT_ENA_S 9
/* DMA_OUT_TOTAL_EOF_CH4_INT_ENA : R/W ;bitpos:[8] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH4_INT_ENA (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH4_INT_ENA_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH4_INT_ENA_V 0x1
#define DMA_OUT_TOTAL_EOF_CH4_INT_ENA_S 8
/* DMA_IN_DSCR_EMPTY_CH4_INT_ENA : R/W ;bitpos:[7] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH4_INT_ENA (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH4_INT_ENA_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH4_INT_ENA_V 0x1
#define DMA_IN_DSCR_EMPTY_CH4_INT_ENA_S 7
/* DMA_OUT_DSCR_ERR_CH4_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH4_INT_ENA (BIT(6))
#define DMA_OUT_DSCR_ERR_CH4_INT_ENA_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH4_INT_ENA_V 0x1
#define DMA_OUT_DSCR_ERR_CH4_INT_ENA_S 6
/* DMA_IN_DSCR_ERR_CH4_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH4_INT_ENA (BIT(5))
#define DMA_IN_DSCR_ERR_CH4_INT_ENA_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH4_INT_ENA_V 0x1
#define DMA_IN_DSCR_ERR_CH4_INT_ENA_S 5
/* DMA_OUT_EOF_CH4_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH4_INT_ENA (BIT(4))
#define DMA_OUT_EOF_CH4_INT_ENA_M (BIT(4))
#define DMA_OUT_EOF_CH4_INT_ENA_V 0x1
#define DMA_OUT_EOF_CH4_INT_ENA_S 4
/* DMA_OUT_DONE_CH4_INT_ENA : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH4_INT_ENA (BIT(3))
#define DMA_OUT_DONE_CH4_INT_ENA_M (BIT(3))
#define DMA_OUT_DONE_CH4_INT_ENA_V 0x1
#define DMA_OUT_DONE_CH4_INT_ENA_S 3
/* DMA_IN_ERR_EOF_CH4_INT_ENA : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH4_INT_ENA (BIT(2))
#define DMA_IN_ERR_EOF_CH4_INT_ENA_M (BIT(2))
#define DMA_IN_ERR_EOF_CH4_INT_ENA_V 0x1
#define DMA_IN_ERR_EOF_CH4_INT_ENA_S 2
/* DMA_IN_SUC_EOF_CH4_INT_ENA : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH4_INT_ENA (BIT(1))
#define DMA_IN_SUC_EOF_CH4_INT_ENA_M (BIT(1))
#define DMA_IN_SUC_EOF_CH4_INT_ENA_V 0x1
#define DMA_IN_SUC_EOF_CH4_INT_ENA_S 1
/* DMA_IN_DONE_CH4_INT_ENA : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: The interrupt enable bit for the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH4_INT_ENA (BIT(0))
#define DMA_IN_DONE_CH4_INT_ENA_M (BIT(0))
#define DMA_IN_DONE_CH4_INT_ENA_V 0x1
#define DMA_IN_DONE_CH4_INT_ENA_S 0

#define DMA_INT_CLR_CH0_REG (DR_REG_DMA_BASE + 0x068)
/* DMA_OUTFIFO_UDF_L3_CH0_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH0_INT_CLR (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH0_INT_CLR_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH0_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH0_INT_CLR_S 17
/* DMA_OUTFIFO_OVF_L3_CH0_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH0_INT_CLR (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH0_INT_CLR_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH0_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH0_INT_CLR_S 16
/* DMA_OUTFIFO_UDF_L1_CH0_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH0_INT_CLR (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH0_INT_CLR_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH0_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH0_INT_CLR_S 15
/* DMA_OUTFIFO_OVF_L1_CH0_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH0_INT_CLR (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH0_INT_CLR_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH0_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH0_INT_CLR_S 14
/* DMA_INFIFO_UDF_L3_CH0_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH0_INT_CLR (BIT(13))
#define DMA_INFIFO_UDF_L3_CH0_INT_CLR_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH0_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L3_CH0_INT_CLR_S 13
/* DMA_INFIFO_OVF_L3_CH0_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH0_INT_CLR (BIT(12))
#define DMA_INFIFO_OVF_L3_CH0_INT_CLR_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH0_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L3_CH0_INT_CLR_S 12
/* DMA_INFIFO_UDF_L1_CH0_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH0_INT_CLR (BIT(11))
#define DMA_INFIFO_UDF_L1_CH0_INT_CLR_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH0_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L1_CH0_INT_CLR_S 11
/* DMA_INFIFO_OVF_L1_CH0_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH0_INT_CLR (BIT(10))
#define DMA_INFIFO_OVF_L1_CH0_INT_CLR_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH0_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L1_CH0_INT_CLR_S 10
/* DMA_INFIFO_FULL_WM_CH0_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH0_INT_CLR (BIT(9))
#define DMA_INFIFO_FULL_WM_CH0_INT_CLR_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH0_INT_CLR_V 0x1
#define DMA_INFIFO_FULL_WM_CH0_INT_CLR_S 9
/* DMA_OUT_TOTAL_EOF_CH0_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH0_INT_CLR (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH0_INT_CLR_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH0_INT_CLR_V 0x1
#define DMA_OUT_TOTAL_EOF_CH0_INT_CLR_S 8
/* DMA_IN_DSCR_EMPTY_CH0_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH0_INT_CLR (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH0_INT_CLR_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH0_INT_CLR_V 0x1
#define DMA_IN_DSCR_EMPTY_CH0_INT_CLR_S 7
/* DMA_OUT_DSCR_ERR_CH0_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH0_INT_CLR (BIT(6))
#define DMA_OUT_DSCR_ERR_CH0_INT_CLR_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH0_INT_CLR_V 0x1
#define DMA_OUT_DSCR_ERR_CH0_INT_CLR_S 6
/* DMA_IN_DSCR_ERR_CH0_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH0_INT_CLR (BIT(5))
#define DMA_IN_DSCR_ERR_CH0_INT_CLR_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH0_INT_CLR_V 0x1
#define DMA_IN_DSCR_ERR_CH0_INT_CLR_S 5
/* DMA_OUT_EOF_CH0_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH0_INT_CLR (BIT(4))
#define DMA_OUT_EOF_CH0_INT_CLR_M (BIT(4))
#define DMA_OUT_EOF_CH0_INT_CLR_V 0x1
#define DMA_OUT_EOF_CH0_INT_CLR_S 4
/* DMA_OUT_DONE_CH0_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH0_INT_CLR (BIT(3))
#define DMA_OUT_DONE_CH0_INT_CLR_M (BIT(3))
#define DMA_OUT_DONE_CH0_INT_CLR_V 0x1
#define DMA_OUT_DONE_CH0_INT_CLR_S 3
/* DMA_IN_ERR_EOF_CH0_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH0_INT_CLR (BIT(2))
#define DMA_IN_ERR_EOF_CH0_INT_CLR_M (BIT(2))
#define DMA_IN_ERR_EOF_CH0_INT_CLR_V 0x1
#define DMA_IN_ERR_EOF_CH0_INT_CLR_S 2
/* DMA_IN_SUC_EOF_CH0_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH0_INT_CLR (BIT(1))
#define DMA_IN_SUC_EOF_CH0_INT_CLR_M (BIT(1))
#define DMA_IN_SUC_EOF_CH0_INT_CLR_V 0x1
#define DMA_IN_SUC_EOF_CH0_INT_CLR_S 1
/* DMA_IN_DONE_CH0_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH0_INT_CLR (BIT(0))
#define DMA_IN_DONE_CH0_INT_CLR_M (BIT(0))
#define DMA_IN_DONE_CH0_INT_CLR_V 0x1
#define DMA_IN_DONE_CH0_INT_CLR_S 0

#define DMA_INT_CLR_CH1_REG (DR_REG_DMA_BASE + 0x06C)
/* DMA_OUTFIFO_UDF_L3_CH1_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH1_INT_CLR (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH1_INT_CLR_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH1_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH1_INT_CLR_S 17
/* DMA_OUTFIFO_OVF_L3_CH1_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH1_INT_CLR (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH1_INT_CLR_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH1_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH1_INT_CLR_S 16
/* DMA_OUTFIFO_UDF_L1_CH1_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH1_INT_CLR (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH1_INT_CLR_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH1_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH1_INT_CLR_S 15
/* DMA_OUTFIFO_OVF_L1_CH1_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH1_INT_CLR (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH1_INT_CLR_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH1_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH1_INT_CLR_S 14
/* DMA_INFIFO_UDF_L3_CH1_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH1_INT_CLR (BIT(13))
#define DMA_INFIFO_UDF_L3_CH1_INT_CLR_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH1_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L3_CH1_INT_CLR_S 13
/* DMA_INFIFO_OVF_L3_CH1_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH1_INT_CLR (BIT(12))
#define DMA_INFIFO_OVF_L3_CH1_INT_CLR_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH1_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L3_CH1_INT_CLR_S 12
/* DMA_INFIFO_UDF_L1_CH1_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH1_INT_CLR (BIT(11))
#define DMA_INFIFO_UDF_L1_CH1_INT_CLR_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH1_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L1_CH1_INT_CLR_S 11
/* DMA_INFIFO_OVF_L1_CH1_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH1_INT_CLR (BIT(10))
#define DMA_INFIFO_OVF_L1_CH1_INT_CLR_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH1_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L1_CH1_INT_CLR_S 10
/* DMA_INFIFO_FULL_WM_CH1_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH1_INT_CLR (BIT(9))
#define DMA_INFIFO_FULL_WM_CH1_INT_CLR_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH1_INT_CLR_V 0x1
#define DMA_INFIFO_FULL_WM_CH1_INT_CLR_S 9
/* DMA_OUT_TOTAL_EOF_CH1_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH1_INT_CLR (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH1_INT_CLR_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH1_INT_CLR_V 0x1
#define DMA_OUT_TOTAL_EOF_CH1_INT_CLR_S 8
/* DMA_IN_DSCR_EMPTY_CH1_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH1_INT_CLR (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH1_INT_CLR_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH1_INT_CLR_V 0x1
#define DMA_IN_DSCR_EMPTY_CH1_INT_CLR_S 7
/* DMA_OUT_DSCR_ERR_CH1_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH1_INT_CLR (BIT(6))
#define DMA_OUT_DSCR_ERR_CH1_INT_CLR_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH1_INT_CLR_V 0x1
#define DMA_OUT_DSCR_ERR_CH1_INT_CLR_S 6
/* DMA_IN_DSCR_ERR_CH1_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH1_INT_CLR (BIT(5))
#define DMA_IN_DSCR_ERR_CH1_INT_CLR_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH1_INT_CLR_V 0x1
#define DMA_IN_DSCR_ERR_CH1_INT_CLR_S 5
/* DMA_OUT_EOF_CH1_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH1_INT_CLR (BIT(4))
#define DMA_OUT_EOF_CH1_INT_CLR_M (BIT(4))
#define DMA_OUT_EOF_CH1_INT_CLR_V 0x1
#define DMA_OUT_EOF_CH1_INT_CLR_S 4
/* DMA_OUT_DONE_CH1_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH1_INT_CLR (BIT(3))
#define DMA_OUT_DONE_CH1_INT_CLR_M (BIT(3))
#define DMA_OUT_DONE_CH1_INT_CLR_V 0x1
#define DMA_OUT_DONE_CH1_INT_CLR_S 3
/* DMA_IN_ERR_EOF_CH1_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH1_INT_CLR (BIT(2))
#define DMA_IN_ERR_EOF_CH1_INT_CLR_M (BIT(2))
#define DMA_IN_ERR_EOF_CH1_INT_CLR_V 0x1
#define DMA_IN_ERR_EOF_CH1_INT_CLR_S 2
/* DMA_IN_SUC_EOF_CH1_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH1_INT_CLR (BIT(1))
#define DMA_IN_SUC_EOF_CH1_INT_CLR_M (BIT(1))
#define DMA_IN_SUC_EOF_CH1_INT_CLR_V 0x1
#define DMA_IN_SUC_EOF_CH1_INT_CLR_S 1
/* DMA_IN_DONE_CH1_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH1_INT_CLR (BIT(0))
#define DMA_IN_DONE_CH1_INT_CLR_M (BIT(0))
#define DMA_IN_DONE_CH1_INT_CLR_V 0x1
#define DMA_IN_DONE_CH1_INT_CLR_S 0

