espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_INT_CLR_CH2_REG (DR_REG_DMA_BASE + 0x070)
/* DMA_OUTFIFO_UDF_L3_CH2_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH2_INT_CLR (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH2_INT_CLR_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH2_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH2_INT_CLR_S 17
/* DMA_OUTFIFO_OVF_L3_CH2_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH2_INT_CLR (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH2_INT_CLR_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH2_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH2_INT_CLR_S 16
/* DMA_OUTFIFO_UDF_L1_CH2_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH2_INT_CLR (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH2_INT_CLR_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH2_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH2_INT_CLR_S 15
/* DMA_OUTFIFO_OVF_L1_CH2_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH2_INT_CLR (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH2_INT_CLR_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH2_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH2_INT_CLR_S 14
/* DMA_INFIFO_UDF_L3_CH2_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH2_INT_CLR (BIT(13))
#define DMA_INFIFO_UDF_L3_CH2_INT_CLR_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH2_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L3_CH2_INT_CLR_S 13
/* DMA_INFIFO_OVF_L3_CH2_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH2_INT_CLR (BIT(12))
#define DMA_INFIFO_OVF_L3_CH2_INT_CLR_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH2_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L3_CH2_INT_CLR_S 12
/* DMA_INFIFO_UDF_L1_CH2_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH2_INT_CLR (BIT(11))
#define DMA_INFIFO_UDF_L1_CH2_INT_CLR_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH2_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L1_CH2_INT_CLR_S 11
/* DMA_INFIFO_OVF_L1_CH2_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH2_INT_CLR (BIT(10))
#define DMA_INFIFO_OVF_L1_CH2_INT_CLR_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH2_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L1_CH2_INT_CLR_S 10
/* DMA_INFIFO_FULL_WM_CH2_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH2_INT_CLR (BIT(9))
#define DMA_INFIFO_FULL_WM_CH2_INT_CLR_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH2_INT_CLR_V 0x1
#define DMA_INFIFO_FULL_WM_CH2_INT_CLR_S 9
/* DMA_OUT_TOTAL_EOF_CH2_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH2_INT_CLR (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH2_INT_CLR_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH2_INT_CLR_V 0x1
#define DMA_OUT_TOTAL_EOF_CH2_INT_CLR_S 8
/* DMA_IN_DSCR_EMPTY_CH2_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH2_INT_CLR (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH2_INT_CLR_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH2_INT_CLR_V 0x1
#define DMA_IN_DSCR_EMPTY_CH2_INT_CLR_S 7
/* DMA_OUT_DSCR_ERR_CH2_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH2_INT_CLR (BIT(6))
#define DMA_OUT_DSCR_ERR_CH2_INT_CLR_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH2_INT_CLR_V 0x1
#define DMA_OUT_DSCR_ERR_CH2_INT_CLR_S 6
/* DMA_IN_DSCR_ERR_CH2_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH2_INT_CLR (BIT(5))
#define DMA_IN_DSCR_ERR_CH2_INT_CLR_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH2_INT_CLR_V 0x1
#define DMA_IN_DSCR_ERR_CH2_INT_CLR_S 5
/* DMA_OUT_EOF_CH2_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH2_INT_CLR (BIT(4))
#define DMA_OUT_EOF_CH2_INT_CLR_M (BIT(4))
#define DMA_OUT_EOF_CH2_INT_CLR_V 0x1
#define DMA_OUT_EOF_CH2_INT_CLR_S 4
/* DMA_OUT_DONE_CH2_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH2_INT_CLR (BIT(3))
#define DMA_OUT_DONE_CH2_INT_CLR_M (BIT(3))
#define DMA_OUT_DONE_CH2_INT_CLR_V 0x1
#define DMA_OUT_DONE_CH2_INT_CLR_S 3
/* DMA_IN_ERR_EOF_CH2_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH2_INT_CLR (BIT(2))
#define DMA_IN_ERR_EOF_CH2_INT_CLR_M (BIT(2))
#define DMA_IN_ERR_EOF_CH2_INT_CLR_V 0x1
#define DMA_IN_ERR_EOF_CH2_INT_CLR_S 2
/* DMA_IN_SUC_EOF_CH2_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH2_INT_CLR (BIT(1))
#define DMA_IN_SUC_EOF_CH2_INT_CLR_M (BIT(1))
#define DMA_IN_SUC_EOF_CH2_INT_CLR_V 0x1
#define DMA_IN_SUC_EOF_CH2_INT_CLR_S 1
/* DMA_IN_DONE_CH2_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH2_INT_CLR (BIT(0))
#define DMA_IN_DONE_CH2_INT_CLR_M (BIT(0))
#define DMA_IN_DONE_CH2_INT_CLR_V 0x1
#define DMA_IN_DONE_CH2_INT_CLR_S 0

#define DMA_INT_CLR_CH3_REG (DR_REG_DMA_BASE + 0x074)
/* DMA_OUTFIFO_UDF_L3_CH3_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH3_INT_CLR (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH3_INT_CLR_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH3_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH3_INT_CLR_S 17
/* DMA_OUTFIFO_OVF_L3_CH3_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH3_INT_CLR (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH3_INT_CLR_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH3_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH3_INT_CLR_S 16
/* DMA_OUTFIFO_UDF_L1_CH3_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH3_INT_CLR (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH3_INT_CLR_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH3_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH3_INT_CLR_S 15
/* DMA_OUTFIFO_OVF_L1_CH3_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH3_INT_CLR (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH3_INT_CLR_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH3_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH3_INT_CLR_S 14
/* DMA_INFIFO_UDF_L3_CH3_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH3_INT_CLR (BIT(13))
#define DMA_INFIFO_UDF_L3_CH3_INT_CLR_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH3_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L3_CH3_INT_CLR_S 13
/* DMA_INFIFO_OVF_L3_CH3_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH3_INT_CLR (BIT(12))
#define DMA_INFIFO_OVF_L3_CH3_INT_CLR_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH3_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L3_CH3_INT_CLR_S 12
/* DMA_INFIFO_UDF_L1_CH3_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH3_INT_CLR (BIT(11))
#define DMA_INFIFO_UDF_L1_CH3_INT_CLR_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH3_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L1_CH3_INT_CLR_S 11
/* DMA_INFIFO_OVF_L1_CH3_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH3_INT_CLR (BIT(10))
#define DMA_INFIFO_OVF_L1_CH3_INT_CLR_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH3_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L1_CH3_INT_CLR_S 10
/* DMA_INFIFO_FULL_WM_CH3_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH3_INT_CLR (BIT(9))
#define DMA_INFIFO_FULL_WM_CH3_INT_CLR_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH3_INT_CLR_V 0x1
#define DMA_INFIFO_FULL_WM_CH3_INT_CLR_S 9
/* DMA_OUT_TOTAL_EOF_CH3_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH3_INT_CLR (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH3_INT_CLR_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH3_INT_CLR_V 0x1
#define DMA_OUT_TOTAL_EOF_CH3_INT_CLR_S 8
/* DMA_IN_DSCR_EMPTY_CH3_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH3_INT_CLR (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH3_INT_CLR_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH3_INT_CLR_V 0x1
#define DMA_IN_DSCR_EMPTY_CH3_INT_CLR_S 7
/* DMA_OUT_DSCR_ERR_CH3_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH3_INT_CLR (BIT(6))
#define DMA_OUT_DSCR_ERR_CH3_INT_CLR_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH3_INT_CLR_V 0x1
#define DMA_OUT_DSCR_ERR_CH3_INT_CLR_S 6
/* DMA_IN_DSCR_ERR_CH3_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH3_INT_CLR (BIT(5))
#define DMA_IN_DSCR_ERR_CH3_INT_CLR_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH3_INT_CLR_V 0x1
#define DMA_IN_DSCR_ERR_CH3_INT_CLR_S 5
/* DMA_OUT_EOF_CH3_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH3_INT_CLR (BIT(4))
#define DMA_OUT_EOF_CH3_INT_CLR_M (BIT(4))
#define DMA_OUT_EOF_CH3_INT_CLR_V 0x1
#define DMA_OUT_EOF_CH3_INT_CLR_S 4
/* DMA_OUT_DONE_CH3_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH3_INT_CLR (BIT(3))
#define DMA_OUT_DONE_CH3_INT_CLR_M (BIT(3))
#define DMA_OUT_DONE_CH3_INT_CLR_V 0x1
#define DMA_OUT_DONE_CH3_INT_CLR_S 3
/* DMA_IN_ERR_EOF_CH3_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH3_INT_CLR (BIT(2))
#define DMA_IN_ERR_EOF_CH3_INT_CLR_M (BIT(2))
#define DMA_IN_ERR_EOF_CH3_INT_CLR_V 0x1
#define DMA_IN_ERR_EOF_CH3_INT_CLR_S 2
/* DMA_IN_SUC_EOF_CH3_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH3_INT_CLR (BIT(1))
#define DMA_IN_SUC_EOF_CH3_INT_CLR_M (BIT(1))
#define DMA_IN_SUC_EOF_CH3_INT_CLR_V 0x1
#define DMA_IN_SUC_EOF_CH3_INT_CLR_S 1
/* DMA_IN_DONE_CH3_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH3_INT_CLR (BIT(0))
#define DMA_IN_DONE_CH3_INT_CLR_M (BIT(0))
#define DMA_IN_DONE_CH3_INT_CLR_V 0x1
#define DMA_IN_DONE_CH3_INT_CLR_S 0

#define DMA_INT_CLR_CH4_REG (DR_REG_DMA_BASE + 0x078)
/* DMA_OUTFIFO_UDF_L3_CH4_INT_CLR : WO ;bitpos:[17] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L3_CH4_INT_CLR (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH4_INT_CLR_M (BIT(17))
#define DMA_OUTFIFO_UDF_L3_CH4_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L3_CH4_INT_CLR_S 17
/* DMA_OUTFIFO_OVF_L3_CH4_INT_CLR : WO ;bitpos:[16] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L3_CH4_INT_CLR (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH4_INT_CLR_M (BIT(16))
#define DMA_OUTFIFO_OVF_L3_CH4_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L3_CH4_INT_CLR_S 16
/* DMA_OUTFIFO_UDF_L1_CH4_INT_CLR : WO ;bitpos:[15] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_UDF_L1_CH4_INT_CLR (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH4_INT_CLR_M (BIT(15))
#define DMA_OUTFIFO_UDF_L1_CH4_INT_CLR_V 0x1
#define DMA_OUTFIFO_UDF_L1_CH4_INT_CLR_S 15
/* DMA_OUTFIFO_OVF_L1_CH4_INT_CLR : WO ;bitpos:[14] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUTFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_OUTFIFO_OVF_L1_CH4_INT_CLR (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH4_INT_CLR_M (BIT(14))
#define DMA_OUTFIFO_OVF_L1_CH4_INT_CLR_V 0x1
#define DMA_OUTFIFO_OVF_L1_CH4_INT_CLR_S 14
/* DMA_INFIFO_UDF_L3_CH4_INT_CLR : WO ;bitpos:[13] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L3_CH4_INT_CLR (BIT(13))
#define DMA_INFIFO_UDF_L3_CH4_INT_CLR_M (BIT(13))
#define DMA_INFIFO_UDF_L3_CH4_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L3_CH4_INT_CLR_S 13
/* DMA_INFIFO_OVF_L3_CH4_INT_CLR : WO ;bitpos:[12] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L3_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L3_CH4_INT_CLR (BIT(12))
#define DMA_INFIFO_OVF_L3_CH4_INT_CLR_M (BIT(12))
#define DMA_INFIFO_OVF_L3_CH4_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L3_CH4_INT_CLR_S 12
/* DMA_INFIFO_UDF_L1_CH4_INT_CLR : WO ;bitpos:[11] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_UDF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_UDF_L1_CH4_INT_CLR (BIT(11))
#define DMA_INFIFO_UDF_L1_CH4_INT_CLR_M (BIT(11))
#define DMA_INFIFO_UDF_L1_CH4_INT_CLR_V 0x1
#define DMA_INFIFO_UDF_L1_CH4_INT_CLR_S 11
/* DMA_INFIFO_OVF_L1_CH4_INT_CLR : WO ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_OVF_L1_CH_INT interrupt.*/
#define DMA_INFIFO_OVF_L1_CH4_INT_CLR (BIT(10))
#define DMA_INFIFO_OVF_L1_CH4_INT_CLR_M (BIT(10))
#define DMA_INFIFO_OVF_L1_CH4_INT_CLR_V 0x1
#define DMA_INFIFO_OVF_L1_CH4_INT_CLR_S 10
/* DMA_INFIFO_FULL_WM_CH4_INT_CLR : WO ;bitpos:[9] ;default: 1'b0 ; */
/*description: Set this bit to clear the INFIFO_FULL_WM_CH_INT interrupt.*/
#define DMA_INFIFO_FULL_WM_CH4_INT_CLR (BIT(9))
#define DMA_INFIFO_FULL_WM_CH4_INT_CLR_M (BIT(9))
#define DMA_INFIFO_FULL_WM_CH4_INT_CLR_V 0x1
#define DMA_INFIFO_FULL_WM_CH4_INT_CLR_S 9
/* DMA_OUT_TOTAL_EOF_CH4_INT_CLR : WO ;bitpos:[8] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_TOTAL_EOF_CH_INT interrupt.*/
#define DMA_OUT_TOTAL_EOF_CH4_INT_CLR (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH4_INT_CLR_M (BIT(8))
#define DMA_OUT_TOTAL_EOF_CH4_INT_CLR_V 0x1
#define DMA_OUT_TOTAL_EOF_CH4_INT_CLR_S 8
/* DMA_IN_DSCR_EMPTY_CH4_INT_CLR : WO ;bitpos:[7] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_EMPTY_CH_INT interrupt.*/
#define DMA_IN_DSCR_EMPTY_CH4_INT_CLR (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH4_INT_CLR_M (BIT(7))
#define DMA_IN_DSCR_EMPTY_CH4_INT_CLR_V 0x1
#define DMA_IN_DSCR_EMPTY_CH4_INT_CLR_S 7
/* DMA_OUT_DSCR_ERR_CH4_INT_CLR : WO ;bitpos:[6] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DSCR_ERR_CH_INT interrupt.*/
#define DMA_OUT_DSCR_ERR_CH4_INT_CLR (BIT(6))
#define DMA_OUT_DSCR_ERR_CH4_INT_CLR_M (BIT(6))
#define DMA_OUT_DSCR_ERR_CH4_INT_CLR_V 0x1
#define DMA_OUT_DSCR_ERR_CH4_INT_CLR_S 6
/* DMA_IN_DSCR_ERR_CH4_INT_CLR : WO ;bitpos:[5] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DSCR_ERR_CH_INT interrupt.*/
#define DMA_IN_DSCR_ERR_CH4_INT_CLR (BIT(5))
#define DMA_IN_DSCR_ERR_CH4_INT_CLR_M (BIT(5))
#define DMA_IN_DSCR_ERR_CH4_INT_CLR_V 0x1
#define DMA_IN_DSCR_ERR_CH4_INT_CLR_S 5
/* DMA_OUT_EOF_CH4_INT_CLR : WO ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_EOF_CH_INT interrupt.*/
#define DMA_OUT_EOF_CH4_INT_CLR (BIT(4))
#define DMA_OUT_EOF_CH4_INT_CLR_M (BIT(4))
#define DMA_OUT_EOF_CH4_INT_CLR_V 0x1
#define DMA_OUT_EOF_CH4_INT_CLR_S 4
/* DMA_OUT_DONE_CH4_INT_CLR : WO ;bitpos:[3] ;default: 1'b0 ; */
/*description: Set this bit to clear the OUT_DONE_CH_INT interrupt.*/
#define DMA_OUT_DONE_CH4_INT_CLR (BIT(3))
#define DMA_OUT_DONE_CH4_INT_CLR_M (BIT(3))
#define DMA_OUT_DONE_CH4_INT_CLR_V 0x1
#define DMA_OUT_DONE_CH4_INT_CLR_S 3
/* DMA_IN_ERR_EOF_CH4_INT_CLR : WO ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_ERR_EOF_CH_INT interrupt.*/
#define DMA_IN_ERR_EOF_CH4_INT_CLR (BIT(2))
#define DMA_IN_ERR_EOF_CH4_INT_CLR_M (BIT(2))
#define DMA_IN_ERR_EOF_CH4_INT_CLR_V 0x1
#define DMA_IN_ERR_EOF_CH4_INT_CLR_S 2
/* DMA_IN_SUC_EOF_CH4_INT_CLR : WO ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_SUC_EOF_CH_INT interrupt.*/
#define DMA_IN_SUC_EOF_CH4_INT_CLR (BIT(1))
#define DMA_IN_SUC_EOF_CH4_INT_CLR_M (BIT(1))
#define DMA_IN_SUC_EOF_CH4_INT_CLR_V 0x1
#define DMA_IN_SUC_EOF_CH4_INT_CLR_S 1
/* DMA_IN_DONE_CH4_INT_CLR : WO ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit to clear the IN_DONE_CH_INT interrupt.*/
#define DMA_IN_DONE_CH4_INT_CLR (BIT(0))
#define DMA_IN_DONE_CH4_INT_CLR_M (BIT(0))
#define DMA_IN_DONE_CH4_INT_CLR_V 0x1
#define DMA_IN_DONE_CH4_INT_CLR_S 0

#define DMA_INFIFO_STATUS_CH0_REG (DR_REG_DMA_BASE + 0x07C)
/* DMA_IN_BUF_HUNGRY_CH0 : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_BUF_HUNGRY_CH0 (BIT(27))
#define DMA_IN_BUF_HUNGRY_CH0_M (BIT(27))
#define DMA_IN_BUF_HUNGRY_CH0_V 0x1
#define DMA_IN_BUF_HUNGRY_CH0_S 27
/* DMA_IN_REMAIN_UNDER_4B_L3_CH0 : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_4B_L3_CH0 (BIT(26))
#define DMA_IN_REMAIN_UNDER_4B_L3_CH0_M (BIT(26))
#define DMA_IN_REMAIN_UNDER_4B_L3_CH0_V 0x1
#define DMA_IN_REMAIN_UNDER_4B_L3_CH0_S 26
/* DMA_IN_REMAIN_UNDER_3B_L3_CH0 : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_3B_L3_CH0 (BIT(25))
#define DMA_IN_REMAIN_UNDER_3B_L3_CH0_M (BIT(25))
#define DMA_IN_REMAIN_UNDER_3B_L3_CH0_V 0x1
#define DMA_IN_REMAIN_UNDER_3B_L3_CH0_S 25
/* DMA_IN_REMAIN_UNDER_2B_L3_CH0 : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_2B_L3_CH0 (BIT(24))
#define DMA_IN_REMAIN_UNDER_2B_L3_CH0_M (BIT(24))
#define DMA_IN_REMAIN_UNDER_2B_L3_CH0_V 0x1
#define DMA_IN_REMAIN_UNDER_2B_L3_CH0_S 24
/* DMA_IN_REMAIN_UNDER_1B_L3_CH0 : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_1B_L3_CH0 (BIT(23))
#define DMA_IN_REMAIN_UNDER_1B_L3_CH0_M (BIT(23))
#define DMA_IN_REMAIN_UNDER_1B_L3_CH0_V 0x1
#define DMA_IN_REMAIN_UNDER_1B_L3_CH0_S 23
/* DMA_INFIFO_CNT_L3_CH0 : RO ;bitpos:[22:18] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Rx FIFO for Rx channel 0.*/
#define DMA_INFIFO_CNT_L3_CH0 0x0000001F
#define DMA_INFIFO_CNT_L3_CH0_M ((DMA_INFIFO_CNT_L3_CH0_V) << (DMA_INFIFO_CNT_L3_CH0_S))
#define DMA_INFIFO_CNT_L3_CH0_V 0x1F
#define DMA_INFIFO_CNT_L3_CH0_S 18
/* DMA_INFIFO_CNT_L2_CH0 : RO ;bitpos:[17:11] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Rx FIFO for Rx channel 0.*/
#define DMA_INFIFO_CNT_L2_CH0 0x0000007F
#define DMA_INFIFO_CNT_L2_CH0_M ((DMA_INFIFO_CNT_L2_CH0_V) << (DMA_INFIFO_CNT_L2_CH0_S))
#define DMA_INFIFO_CNT_L2_CH0_V 0x7F
#define DMA_INFIFO_CNT_L2_CH0_S 11
/* DMA_INFIFO_CNT_L1_CH0 : RO ;bitpos:[10:6] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L1 Rx FIFO for Rx channel 0.*/
#define DMA_INFIFO_CNT_L1_CH0 0x0000001F
#define DMA_INFIFO_CNT_L1_CH0_M ((DMA_INFIFO_CNT_L1_CH0_V) << (DMA_INFIFO_CNT_L1_CH0_S))
#define DMA_INFIFO_CNT_L1_CH0_V 0x1F
#define DMA_INFIFO_CNT_L1_CH0_S 6
/* DMA_INFIFO_EMPTY_L3_CH0 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Rx FIFO empty signal for Rx channel 0.*/
#define DMA_INFIFO_EMPTY_L3_CH0 (BIT(5))
#define DMA_INFIFO_EMPTY_L3_CH0_M (BIT(5))
#define DMA_INFIFO_EMPTY_L3_CH0_V 0x1
#define DMA_INFIFO_EMPTY_L3_CH0_S 5
/* DMA_INFIFO_FULL_L3_CH0 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: L3 Rx FIFO full signal for Rx channel 0.*/
#define DMA_INFIFO_FULL_L3_CH0 (BIT(4))
#define DMA_INFIFO_FULL_L3_CH0_M (BIT(4))
#define DMA_INFIFO_FULL_L3_CH0_V 0x1
#define DMA_INFIFO_FULL_L3_CH0_S 4
/* DMA_INFIFO_EMPTY_L2_CH0 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Rx FIFO empty signal for Rx channel 0.*/
#define DMA_INFIFO_EMPTY_L2_CH0 (BIT(3))
#define DMA_INFIFO_EMPTY_L2_CH0_M (BIT(3))
#define DMA_INFIFO_EMPTY_L2_CH0_V 0x1
#define DMA_INFIFO_EMPTY_L2_CH0_S 3
/* DMA_INFIFO_FULL_L2_CH0 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Rx FIFO full signal for Rx channel 0.*/
#define DMA_INFIFO_FULL_L2_CH0 (BIT(2))
#define DMA_INFIFO_FULL_L2_CH0_M (BIT(2))
#define DMA_INFIFO_FULL_L2_CH0_V 0x1
#define DMA_INFIFO_FULL_L2_CH0_S 2
/* DMA_INFIFO_EMPTY_L1_CH0 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Rx FIFO empty signal for Rx channel 0.*/
#define DMA_INFIFO_EMPTY_L1_CH0 (BIT(1))
#define DMA_INFIFO_EMPTY_L1_CH0_M (BIT(1))
#define DMA_INFIFO_EMPTY_L1_CH0_V 0x1
#define DMA_INFIFO_EMPTY_L1_CH0_S 1
/* DMA_INFIFO_FULL_L1_CH0 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Rx FIFO full signal for Rx channel 0.*/
#define DMA_INFIFO_FULL_L1_CH0 (BIT(0))
#define DMA_INFIFO_FULL_L1_CH0_M (BIT(0))
#define DMA_INFIFO_FULL_L1_CH0_V 0x1
#define DMA_INFIFO_FULL_L1_CH0_S 0

