espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_INFIFO_STATUS_CH1_REG (DR_REG_DMA_BASE + 0x080)
/* DMA_IN_BUF_HUNGRY_CH1 : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_BUF_HUNGRY_CH1 (BIT(27))
#define DMA_IN_BUF_HUNGRY_CH1_M (BIT(27))
#define DMA_IN_BUF_HUNGRY_CH1_V 0x1
#define DMA_IN_BUF_HUNGRY_CH1_S 27
/* DMA_IN_REMAIN_UNDER_4B_L3_CH1 : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_4B_L3_CH1 (BIT(26))
#define DMA_IN_REMAIN_UNDER_4B_L3_CH1_M (BIT(26))
#define DMA_IN_REMAIN_UNDER_4B_L3_CH1_V 0x1
#define DMA_IN_REMAIN_UNDER_4B_L3_CH1_S 26
/* DMA_IN_REMAIN_UNDER_3B_L3_CH1 : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_3B_L3_CH1 (BIT(25))
#define DMA_IN_REMAIN_UNDER_3B_L3_CH1_M (BIT(25))
#define DMA_IN_REMAIN_UNDER_3B_L3_CH1_V 0x1
#define DMA_IN_REMAIN_UNDER_3B_L3_CH1_S 25
/* DMA_IN_REMAIN_UNDER_2B_L3_CH1 : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_2B_L3_CH1 (BIT(24))
#define DMA_IN_REMAIN_UNDER_2B_L3_CH1_M (BIT(24))
#define DMA_IN_REMAIN_UNDER_2B_L3_CH1_V 0x1
#define DMA_IN_REMAIN_UNDER_2B_L3_CH1_S 24
/* DMA_IN_REMAIN_UNDER_1B_L3_CH1 : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_1B_L3_CH1 (BIT(23))
#define DMA_IN_REMAIN_UNDER_1B_L3_CH1_M (BIT(23))
#define DMA_IN_REMAIN_UNDER_1B_L3_CH1_V 0x1
#define DMA_IN_REMAIN_UNDER_1B_L3_CH1_S 23
/* DMA_INFIFO_CNT_L3_CH1 : RO ;bitpos:[22:18] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Rx FIFO for Rx channel 1.*/
#define DMA_INFIFO_CNT_L3_CH1 0x0000001F
#define DMA_INFIFO_CNT_L3_CH1_M ((DMA_INFIFO_CNT_L3_CH1_V) << (DMA_INFIFO_CNT_L3_CH1_S))
#define DMA_INFIFO_CNT_L3_CH1_V 0x1F
#define DMA_INFIFO_CNT_L3_CH1_S 18
/* DMA_INFIFO_CNT_L2_CH1 : RO ;bitpos:[17:11] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Rx FIFO for Rx channel 1.*/
#define DMA_INFIFO_CNT_L2_CH1 0x0000007F
#define DMA_INFIFO_CNT_L2_CH1_M ((DMA_INFIFO_CNT_L2_CH1_V) << (DMA_INFIFO_CNT_L2_CH1_S))
#define DMA_INFIFO_CNT_L2_CH1_V 0x7F
#define DMA_INFIFO_CNT_L2_CH1_S 11
/* DMA_INFIFO_CNT_L1_CH1 : RO ;bitpos:[10:6] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L1 Rx FIFO for Rx channel 1.*/
#define DMA_INFIFO_CNT_L1_CH1 0x0000001F
#define DMA_INFIFO_CNT_L1_CH1_M ((DMA_INFIFO_CNT_L1_CH1_V) << (DMA_INFIFO_CNT_L1_CH1_S))
#define DMA_INFIFO_CNT_L1_CH1_V 0x1F
#define DMA_INFIFO_CNT_L1_CH1_S 6
/* DMA_INFIFO_EMPTY_L3_CH1 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Rx FIFO empty signal for Rx channel 1.*/
#define DMA_INFIFO_EMPTY_L3_CH1 (BIT(5))
#define DMA_INFIFO_EMPTY_L3_CH1_M (BIT(5))
#define DMA_INFIFO_EMPTY_L3_CH1_V 0x1
#define DMA_INFIFO_EMPTY_L3_CH1_S 5
/* DMA_INFIFO_FULL_L3_CH1 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: L3 Rx FIFO full signal for Rx channel 1.*/
#define DMA_INFIFO_FULL_L3_CH1 (BIT(4))
#define DMA_INFIFO_FULL_L3_CH1_M (BIT(4))
#define DMA_INFIFO_FULL_L3_CH1_V 0x1
#define DMA_INFIFO_FULL_L3_CH1_S 4
/* DMA_INFIFO_EMPTY_L2_CH1 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Rx FIFO empty signal for Rx channel 1.*/
#define DMA_INFIFO_EMPTY_L2_CH1 (BIT(3))
#define DMA_INFIFO_EMPTY_L2_CH1_M (BIT(3))
#define DMA_INFIFO_EMPTY_L2_CH1_V 0x1
#define DMA_INFIFO_EMPTY_L2_CH1_S 3
/* DMA_INFIFO_FULL_L2_CH1 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Rx FIFO full signal for Rx channel 1.*/
#define DMA_INFIFO_FULL_L2_CH1 (BIT(2))
#define DMA_INFIFO_FULL_L2_CH1_M (BIT(2))
#define DMA_INFIFO_FULL_L2_CH1_V 0x1
#define DMA_INFIFO_FULL_L2_CH1_S 2
/* DMA_INFIFO_EMPTY_L1_CH1 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Rx FIFO empty signal for Rx channel 1.*/
#define DMA_INFIFO_EMPTY_L1_CH1 (BIT(1))
#define DMA_INFIFO_EMPTY_L1_CH1_M (BIT(1))
#define DMA_INFIFO_EMPTY_L1_CH1_V 0x1
#define DMA_INFIFO_EMPTY_L1_CH1_S 1
/* DMA_INFIFO_FULL_L1_CH1 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Rx FIFO full signal for Rx channel 1.*/
#define DMA_INFIFO_FULL_L1_CH1 (BIT(0))
#define DMA_INFIFO_FULL_L1_CH1_M (BIT(0))
#define DMA_INFIFO_FULL_L1_CH1_V 0x1
#define DMA_INFIFO_FULL_L1_CH1_S 0

#define DMA_INFIFO_STATUS_CH2_REG (DR_REG_DMA_BASE + 0x084)
/* DMA_IN_BUF_HUNGRY_CH2 : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_BUF_HUNGRY_CH2 (BIT(27))
#define DMA_IN_BUF_HUNGRY_CH2_M (BIT(27))
#define DMA_IN_BUF_HUNGRY_CH2_V 0x1
#define DMA_IN_BUF_HUNGRY_CH2_S 27
/* DMA_IN_REMAIN_UNDER_4B_L3_CH2 : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_4B_L3_CH2 (BIT(26))
#define DMA_IN_REMAIN_UNDER_4B_L3_CH2_M (BIT(26))
#define DMA_IN_REMAIN_UNDER_4B_L3_CH2_V 0x1
#define DMA_IN_REMAIN_UNDER_4B_L3_CH2_S 26
/* DMA_IN_REMAIN_UNDER_3B_L3_CH2 : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_3B_L3_CH2 (BIT(25))
#define DMA_IN_REMAIN_UNDER_3B_L3_CH2_M (BIT(25))
#define DMA_IN_REMAIN_UNDER_3B_L3_CH2_V 0x1
#define DMA_IN_REMAIN_UNDER_3B_L3_CH2_S 25
/* DMA_IN_REMAIN_UNDER_2B_L3_CH2 : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_2B_L3_CH2 (BIT(24))
#define DMA_IN_REMAIN_UNDER_2B_L3_CH2_M (BIT(24))
#define DMA_IN_REMAIN_UNDER_2B_L3_CH2_V 0x1
#define DMA_IN_REMAIN_UNDER_2B_L3_CH2_S 24
/* DMA_IN_REMAIN_UNDER_1B_L3_CH2 : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_1B_L3_CH2 (BIT(23))
#define DMA_IN_REMAIN_UNDER_1B_L3_CH2_M (BIT(23))
#define DMA_IN_REMAIN_UNDER_1B_L3_CH2_V 0x1
#define DMA_IN_REMAIN_UNDER_1B_L3_CH2_S 23
/* DMA_INFIFO_CNT_L3_CH2 : RO ;bitpos:[22:18] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Rx FIFO for Rx channel 2.*/
#define DMA_INFIFO_CNT_L3_CH2 0x0000001F
#define DMA_INFIFO_CNT_L3_CH2_M ((DMA_INFIFO_CNT_L3_CH2_V) << (DMA_INFIFO_CNT_L3_CH2_S))
#define DMA_INFIFO_CNT_L3_CH2_V 0x1F
#define DMA_INFIFO_CNT_L3_CH2_S 18
/* DMA_INFIFO_CNT_L2_CH2 : RO ;bitpos:[17:11] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Rx FIFO for Rx channel 2.*/
#define DMA_INFIFO_CNT_L2_CH2 0x0000007F
#define DMA_INFIFO_CNT_L2_CH2_M ((DMA_INFIFO_CNT_L2_CH2_V) << (DMA_INFIFO_CNT_L2_CH2_S))
#define DMA_INFIFO_CNT_L2_CH2_V 0x7F
#define DMA_INFIFO_CNT_L2_CH2_S 11
/* DMA_INFIFO_CNT_L1_CH2 : RO ;bitpos:[10:6] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L1 Rx FIFO for Rx channel 2.*/
#define DMA_INFIFO_CNT_L1_CH2 0x0000001F
#define DMA_INFIFO_CNT_L1_CH2_M ((DMA_INFIFO_CNT_L1_CH2_V) << (DMA_INFIFO_CNT_L1_CH2_S))
#define DMA_INFIFO_CNT_L1_CH2_V 0x1F
#define DMA_INFIFO_CNT_L1_CH2_S 6
/* DMA_INFIFO_EMPTY_L3_CH2 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Rx FIFO empty signal for Rx channel 2.*/
#define DMA_INFIFO_EMPTY_L3_CH2 (BIT(5))
#define DMA_INFIFO_EMPTY_L3_CH2_M (BIT(5))
#define DMA_INFIFO_EMPTY_L3_CH2_V 0x1
#define DMA_INFIFO_EMPTY_L3_CH2_S 5
/* DMA_INFIFO_FULL_L3_CH2 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: L3 Rx FIFO full signal for Rx channel 2.*/
#define DMA_INFIFO_FULL_L3_CH2 (BIT(4))
#define DMA_INFIFO_FULL_L3_CH2_M (BIT(4))
#define DMA_INFIFO_FULL_L3_CH2_V 0x1
#define DMA_INFIFO_FULL_L3_CH2_S 4
/* DMA_INFIFO_EMPTY_L2_CH2 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Rx FIFO empty signal for Rx channel 2.*/
#define DMA_INFIFO_EMPTY_L2_CH2 (BIT(3))
#define DMA_INFIFO_EMPTY_L2_CH2_M (BIT(3))
#define DMA_INFIFO_EMPTY_L2_CH2_V 0x1
#define DMA_INFIFO_EMPTY_L2_CH2_S 3
/* DMA_INFIFO_FULL_L2_CH2 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Rx FIFO full signal for Rx channel 2.*/
#define DMA_INFIFO_FULL_L2_CH2 (BIT(2))
#define DMA_INFIFO_FULL_L2_CH2_M (BIT(2))
#define DMA_INFIFO_FULL_L2_CH2_V 0x1
#define DMA_INFIFO_FULL_L2_CH2_S 2
/* DMA_INFIFO_EMPTY_L1_CH2 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Rx FIFO empty signal for Rx channel 2.*/
#define DMA_INFIFO_EMPTY_L1_CH2 (BIT(1))
#define DMA_INFIFO_EMPTY_L1_CH2_M (BIT(1))
#define DMA_INFIFO_EMPTY_L1_CH2_V 0x1
#define DMA_INFIFO_EMPTY_L1_CH2_S 1
/* DMA_INFIFO_FULL_L1_CH2 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Rx FIFO full signal for Rx channel 2.*/
#define DMA_INFIFO_FULL_L1_CH2 (BIT(0))
#define DMA_INFIFO_FULL_L1_CH2_M (BIT(0))
#define DMA_INFIFO_FULL_L1_CH2_V 0x1
#define DMA_INFIFO_FULL_L1_CH2_S 0

#define DMA_INFIFO_STATUS_CH3_REG (DR_REG_DMA_BASE + 0x088)
/* DMA_IN_BUF_HUNGRY_CH3 : RO ;bitpos:[27] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_BUF_HUNGRY_CH3 (BIT(27))
#define DMA_IN_BUF_HUNGRY_CH3_M (BIT(27))
#define DMA_IN_BUF_HUNGRY_CH3_V 0x1
#define DMA_IN_BUF_HUNGRY_CH3_S 27
/* DMA_IN_REMAIN_UNDER_4B_L3_CH3 : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_4B_L3_CH3 (BIT(26))
#define DMA_IN_REMAIN_UNDER_4B_L3_CH3_M (BIT(26))
#define DMA_IN_REMAIN_UNDER_4B_L3_CH3_V 0x1
#define DMA_IN_REMAIN_UNDER_4B_L3_CH3_S 26
/* DMA_IN_REMAIN_UNDER_3B_L3_CH3 : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_3B_L3_CH3 (BIT(25))
#define DMA_IN_REMAIN_UNDER_3B_L3_CH3_M (BIT(25))
#define DMA_IN_REMAIN_UNDER_3B_L3_CH3_V 0x1
#define DMA_IN_REMAIN_UNDER_3B_L3_CH3_S 25
/* DMA_IN_REMAIN_UNDER_2B_L3_CH3 : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_2B_L3_CH3 (BIT(24))
#define DMA_IN_REMAIN_UNDER_2B_L3_CH3_M (BIT(24))
#define DMA_IN_REMAIN_UNDER_2B_L3_CH3_V 0x1
#define DMA_IN_REMAIN_UNDER_2B_L3_CH3_S 24
/* DMA_IN_REMAIN_UNDER_1B_L3_CH3 : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_IN_REMAIN_UNDER_1B_L3_CH3 (BIT(23))
#define DMA_IN_REMAIN_UNDER_1B_L3_CH3_M (BIT(23))
#define DMA_IN_REMAIN_UNDER_1B_L3_CH3_V 0x1
#define DMA_IN_REMAIN_UNDER_1B_L3_CH3_S 23
/* DMA_INFIFO_CNT_L3_CH3 : RO ;bitpos:[22:18] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Rx FIFO for Rx channel 3.*/
#define DMA_INFIFO_CNT_L3_CH3 0x0000001F
#define DMA_INFIFO_CNT_L3_CH3_M ((DMA_INFIFO_CNT_L3_CH3_V) << (DMA_INFIFO_CNT_L3_CH3_S))
#define DMA_INFIFO_CNT_L3_CH3_V 0x1F
#define DMA_INFIFO_CNT_L3_CH3_S 18
/* DMA_INFIFO_CNT_L2_CH3 : RO ;bitpos:[17:11] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Rx FIFO for Rx channel 3.*/
#define DMA_INFIFO_CNT_L2_CH3 0x0000007F
#define DMA_INFIFO_CNT_L2_CH3_M ((DMA_INFIFO_CNT_L2_CH3_V) << (DMA_INFIFO_CNT_L2_CH3_S))
#define DMA_INFIFO_CNT_L2_CH3_V 0x7F
#define DMA_INFIFO_CNT_L2_CH3_S 11
/* DMA_INFIFO_CNT_L1_CH3 : RO ;bitpos:[10:6] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L1 Rx FIFO for Rx channel 3.*/
#define DMA_INFIFO_CNT_L1_CH3 0x0000001F
#define DMA_INFIFO_CNT_L1_CH3_M ((DMA_INFIFO_CNT_L1_CH3_V) << (DMA_INFIFO_CNT_L1_CH3_S))
#define DMA_INFIFO_CNT_L1_CH3_V 0x1F
#define DMA_INFIFO_CNT_L1_CH3_S 6
/* DMA_INFIFO_EMPTY_L3_CH3 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Rx FIFO empty signal for Rx channel 3.*/
#define DMA_INFIFO_EMPTY_L3_CH3 (BIT(5))
#define DMA_INFIFO_EMPTY_L3_CH3_M (BIT(5))
#define DMA_INFIFO_EMPTY_L3_CH3_V 0x1
#define DMA_INFIFO_EMPTY_L3_CH3_S 5
/* DMA_INFIFO_FULL_L3_CH3 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: L3 Rx FIFO full signal for Rx channel 3.*/
#define DMA_INFIFO_FULL_L3_CH3 (BIT(4))
#define DMA_INFIFO_FULL_L3_CH3_M (BIT(4))
#define DMA_INFIFO_FULL_L3_CH3_V 0x1
#define DMA_INFIFO_FULL_L3_CH3_S 4
/* DMA_INFIFO_EMPTY_L2_CH3 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Rx FIFO empty signal for Rx channel 3.*/
#define DMA_INFIFO_EMPTY_L2_CH3 (BIT(3))
#define DMA_INFIFO_EMPTY_L2_CH3_M (BIT(3))
#define DMA_INFIFO_EMPTY_L2_CH3_V 0x1
#define DMA_INFIFO_EMPTY_L2_CH3_S 3
/* DMA_INFIFO_FULL_L2_CH3 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Rx FIFO full signal for Rx channel 3.*/
#define DMA_INFIFO_FULL_L2_CH3 (BIT(2))
#define DMA_INFIFO_FULL_L2_CH3_M (BIT(2))
#define DMA_INFIFO_FULL_L2_CH3_V 0x1
#define DMA_INFIFO_FULL_L2_CH3_S 2
/* DMA_INFIFO_EMPTY_L1_CH3 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Rx FIFO empty signal for Rx channel 3.*/
#define DMA_INFIFO_EMPTY_L1_CH3 (BIT(1))
#define DMA_INFIFO_EMPTY_L1_CH3_M (BIT(1))
#define DMA_INFIFO_EMPTY_L1_CH3_V 0x1
#define DMA_INFIFO_EMPTY_L1_CH3_S 1
/* DMA_INFIFO_FULL_L1_CH3 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Rx FIFO full signal for Rx channel 3.*/
#define DMA_INFIFO_FULL_L1_CH3 (BIT(0))
#define DMA_INFIFO_FULL_L1_CH3_M (BIT(0))
#define DMA_INFIFO_FULL_L1_CH3_V 0x1
#define DMA_INFIFO_FULL_L1_CH3_S 0

