espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_OUTFIFO_STATUS_CH2_REG (DR_REG_DMA_BASE + 0x098)
/* DMA_OUT_REMAIN_UNDER_4B_L3_CH2 : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH2 (BIT(26))
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH2_M (BIT(26))
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH2_V 0x1
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH2_S 26
/* DMA_OUT_REMAIN_UNDER_3B_L3_CH2 : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH2 (BIT(25))
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH2_M (BIT(25))
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH2_V 0x1
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH2_S 25
/* DMA_OUT_REMAIN_UNDER_2B_L3_CH2 : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH2 (BIT(24))
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH2_M (BIT(24))
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH2_V 0x1
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH2_S 24
/* DMA_OUT_REMAIN_UNDER_1B_L3_CH2 : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH2 (BIT(23))
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH2_M (BIT(23))
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH2_V 0x1
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH2_S 23
/* DMA_OUTFIFO_CNT_L3_CH2 : RO ;bitpos:[22:18] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Tx FIFO for Tx channel 2.*/
#define DMA_OUTFIFO_CNT_L3_CH2 0x0000001F
#define DMA_OUTFIFO_CNT_L3_CH2_M ((DMA_OUTFIFO_CNT_L3_CH2_V) << (DMA_OUTFIFO_CNT_L3_CH2_S))
#define DMA_OUTFIFO_CNT_L3_CH2_V 0x1F
#define DMA_OUTFIFO_CNT_L3_CH2_S 18
/* DMA_OUTFIFO_CNT_L2_CH2 : RO ;bitpos:[17:11] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Tx FIFO for Tx channel 2.*/
#define DMA_OUTFIFO_CNT_L2_CH2 0x0000007F
#define DMA_OUTFIFO_CNT_L2_CH2_M ((DMA_OUTFIFO_CNT_L2_CH2_V) << (DMA_OUTFIFO_CNT_L2_CH2_S))
#define DMA_OUTFIFO_CNT_L2_CH2_V 0x7F
#define DMA_OUTFIFO_CNT_L2_CH2_S 11
/* DMA_OUTFIFO_CNT_L1_CH2 : RO ;bitpos:[10:6] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L1 Tx FIFO for Tx channel 2.*/
#define DMA_OUTFIFO_CNT_L1_CH2 0x0000001F
#define DMA_OUTFIFO_CNT_L1_CH2_M ((DMA_OUTFIFO_CNT_L1_CH2_V) << (DMA_OUTFIFO_CNT_L1_CH2_S))
#define DMA_OUTFIFO_CNT_L1_CH2_V 0x1F
#define DMA_OUTFIFO_CNT_L1_CH2_S 6
/* DMA_OUTFIFO_EMPTY_L3_CH2 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Tx FIFO empty signal for Tx channel 2.*/
#define DMA_OUTFIFO_EMPTY_L3_CH2 (BIT(5))
#define DMA_OUTFIFO_EMPTY_L3_CH2_M (BIT(5))
#define DMA_OUTFIFO_EMPTY_L3_CH2_V 0x1
#define DMA_OUTFIFO_EMPTY_L3_CH2_S 5
/* DMA_OUTFIFO_FULL_L3_CH2 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: L3 Tx FIFO full signal for Tx channel 2.*/
#define DMA_OUTFIFO_FULL_L3_CH2 (BIT(4))
#define DMA_OUTFIFO_FULL_L3_CH2_M (BIT(4))
#define DMA_OUTFIFO_FULL_L3_CH2_V 0x1
#define DMA_OUTFIFO_FULL_L3_CH2_S 4
/* DMA_OUTFIFO_EMPTY_L2_CH2 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Tx FIFO empty signal for Tx channel 2.*/
#define DMA_OUTFIFO_EMPTY_L2_CH2 (BIT(3))
#define DMA_OUTFIFO_EMPTY_L2_CH2_M (BIT(3))
#define DMA_OUTFIFO_EMPTY_L2_CH2_V 0x1
#define DMA_OUTFIFO_EMPTY_L2_CH2_S 3
/* DMA_OUTFIFO_FULL_L2_CH2 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Tx FIFO full signal for Tx channel 2.*/
#define DMA_OUTFIFO_FULL_L2_CH2 (BIT(2))
#define DMA_OUTFIFO_FULL_L2_CH2_M (BIT(2))
#define DMA_OUTFIFO_FULL_L2_CH2_V 0x1
#define DMA_OUTFIFO_FULL_L2_CH2_S 2
/* DMA_OUTFIFO_EMPTY_L1_CH2 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Tx FIFO empty signal for Tx channel 2.*/
#define DMA_OUTFIFO_EMPTY_L1_CH2 (BIT(1))
#define DMA_OUTFIFO_EMPTY_L1_CH2_M (BIT(1))
#define DMA_OUTFIFO_EMPTY_L1_CH2_V 0x1
#define DMA_OUTFIFO_EMPTY_L1_CH2_S 1
/* DMA_OUTFIFO_FULL_L1_CH2 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Tx FIFO full signal for Tx channel 2.*/
#define DMA_OUTFIFO_FULL_L1_CH2 (BIT(0))
#define DMA_OUTFIFO_FULL_L1_CH2_M (BIT(0))
#define DMA_OUTFIFO_FULL_L1_CH2_V 0x1
#define DMA_OUTFIFO_FULL_L1_CH2_S 0

#define DMA_OUTFIFO_STATUS_CH3_REG (DR_REG_DMA_BASE + 0x09C)
/* DMA_OUT_REMAIN_UNDER_4B_L3_CH3 : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH3 (BIT(26))
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH3_M (BIT(26))
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH3_V 0x1
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH3_S 26
/* DMA_OUT_REMAIN_UNDER_3B_L3_CH3 : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH3 (BIT(25))
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH3_M (BIT(25))
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH3_V 0x1
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH3_S 25
/* DMA_OUT_REMAIN_UNDER_2B_L3_CH3 : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH3 (BIT(24))
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH3_M (BIT(24))
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH3_V 0x1
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH3_S 24
/* DMA_OUT_REMAIN_UNDER_1B_L3_CH3 : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH3 (BIT(23))
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH3_M (BIT(23))
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH3_V 0x1
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH3_S 23
/* DMA_OUTFIFO_CNT_L3_CH3 : RO ;bitpos:[22:18] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Tx FIFO for Tx channel 3.*/
#define DMA_OUTFIFO_CNT_L3_CH3 0x0000001F
#define DMA_OUTFIFO_CNT_L3_CH3_M ((DMA_OUTFIFO_CNT_L3_CH3_V) << (DMA_OUTFIFO_CNT_L3_CH3_S))
#define DMA_OUTFIFO_CNT_L3_CH3_V 0x1F
#define DMA_OUTFIFO_CNT_L3_CH3_S 18
/* DMA_OUTFIFO_CNT_L2_CH3 : RO ;bitpos:[17:11] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Tx FIFO for Tx channel 3.*/
#define DMA_OUTFIFO_CNT_L2_CH3 0x0000007F
#define DMA_OUTFIFO_CNT_L2_CH3_M ((DMA_OUTFIFO_CNT_L2_CH3_V) << (DMA_OUTFIFO_CNT_L2_CH3_S))
#define DMA_OUTFIFO_CNT_L2_CH3_V 0x7F
#define DMA_OUTFIFO_CNT_L2_CH3_S 11
/* DMA_OUTFIFO_CNT_L1_CH3 : RO ;bitpos:[10:6] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L1 Tx FIFO for Tx channel 3.*/
#define DMA_OUTFIFO_CNT_L1_CH3 0x0000001F
#define DMA_OUTFIFO_CNT_L1_CH3_M ((DMA_OUTFIFO_CNT_L1_CH3_V) << (DMA_OUTFIFO_CNT_L1_CH3_S))
#define DMA_OUTFIFO_CNT_L1_CH3_V 0x1F
#define DMA_OUTFIFO_CNT_L1_CH3_S 6
/* DMA_OUTFIFO_EMPTY_L3_CH3 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Tx FIFO empty signal for Tx channel 3.*/
#define DMA_OUTFIFO_EMPTY_L3_CH3 (BIT(5))
#define DMA_OUTFIFO_EMPTY_L3_CH3_M (BIT(5))
#define DMA_OUTFIFO_EMPTY_L3_CH3_V 0x1
#define DMA_OUTFIFO_EMPTY_L3_CH3_S 5
/* DMA_OUTFIFO_FULL_L3_CH3 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: L3 Tx FIFO full signal for Tx channel 3.*/
#define DMA_OUTFIFO_FULL_L3_CH3 (BIT(4))
#define DMA_OUTFIFO_FULL_L3_CH3_M (BIT(4))
#define DMA_OUTFIFO_FULL_L3_CH3_V 0x1
#define DMA_OUTFIFO_FULL_L3_CH3_S 4
/* DMA_OUTFIFO_EMPTY_L2_CH3 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Tx FIFO empty signal for Tx channel 3.*/
#define DMA_OUTFIFO_EMPTY_L2_CH3 (BIT(3))
#define DMA_OUTFIFO_EMPTY_L2_CH3_M (BIT(3))
#define DMA_OUTFIFO_EMPTY_L2_CH3_V 0x1
#define DMA_OUTFIFO_EMPTY_L2_CH3_S 3
/* DMA_OUTFIFO_FULL_L2_CH3 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Tx FIFO full signal for Tx channel 3.*/
#define DMA_OUTFIFO_FULL_L2_CH3 (BIT(2))
#define DMA_OUTFIFO_FULL_L2_CH3_M (BIT(2))
#define DMA_OUTFIFO_FULL_L2_CH3_V 0x1
#define DMA_OUTFIFO_FULL_L2_CH3_S 2
/* DMA_OUTFIFO_EMPTY_L1_CH3 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Tx FIFO empty signal for Tx channel 3.*/
#define DMA_OUTFIFO_EMPTY_L1_CH3 (BIT(1))
#define DMA_OUTFIFO_EMPTY_L1_CH3_M (BIT(1))
#define DMA_OUTFIFO_EMPTY_L1_CH3_V 0x1
#define DMA_OUTFIFO_EMPTY_L1_CH3_S 1
/* DMA_OUTFIFO_FULL_L1_CH3 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Tx FIFO full signal for Tx channel 3.*/
#define DMA_OUTFIFO_FULL_L1_CH3 (BIT(0))
#define DMA_OUTFIFO_FULL_L1_CH3_M (BIT(0))
#define DMA_OUTFIFO_FULL_L1_CH3_V 0x1
#define DMA_OUTFIFO_FULL_L1_CH3_S 0

#define DMA_OUTFIFO_STATUS_CH4_REG (DR_REG_DMA_BASE + 0x0A0)
/* DMA_OUT_REMAIN_UNDER_4B_L3_CH4 : RO ;bitpos:[26] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH4 (BIT(26))
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH4_M (BIT(26))
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH4_V 0x1
#define DMA_OUT_REMAIN_UNDER_4B_L3_CH4_S 26
/* DMA_OUT_REMAIN_UNDER_3B_L3_CH4 : RO ;bitpos:[25] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH4 (BIT(25))
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH4_M (BIT(25))
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH4_V 0x1
#define DMA_OUT_REMAIN_UNDER_3B_L3_CH4_S 25
/* DMA_OUT_REMAIN_UNDER_2B_L3_CH4 : RO ;bitpos:[24] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH4 (BIT(24))
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH4_M (BIT(24))
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH4_V 0x1
#define DMA_OUT_REMAIN_UNDER_2B_L3_CH4_S 24
/* DMA_OUT_REMAIN_UNDER_1B_L3_CH4 : RO ;bitpos:[23] ;default: 1'b0 ; */
/*description: reserved*/
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH4 (BIT(23))
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH4_M (BIT(23))
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH4_V 0x1
#define DMA_OUT_REMAIN_UNDER_1B_L3_CH4_S 23
/* DMA_OUTFIFO_CNT_L3_CH4 : RO ;bitpos:[22:18] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L3 Tx FIFO for Tx channel 4.*/
#define DMA_OUTFIFO_CNT_L3_CH4 0x0000001F
#define DMA_OUTFIFO_CNT_L3_CH4_M ((DMA_OUTFIFO_CNT_L3_CH4_V) << (DMA_OUTFIFO_CNT_L3_CH4_S))
#define DMA_OUTFIFO_CNT_L3_CH4_V 0x1F
#define DMA_OUTFIFO_CNT_L3_CH4_S 18
/* DMA_OUTFIFO_CNT_L2_CH4 : RO ;bitpos:[17:11] ;default: 7'b0 ; */
/*description: The register stores the byte number of the data in L2 Tx FIFO for Tx channel 4.*/
#define DMA_OUTFIFO_CNT_L2_CH4 0x0000007F
#define DMA_OUTFIFO_CNT_L2_CH4_M ((DMA_OUTFIFO_CNT_L2_CH4_V) << (DMA_OUTFIFO_CNT_L2_CH4_S))
#define DMA_OUTFIFO_CNT_L2_CH4_V 0x7F
#define DMA_OUTFIFO_CNT_L2_CH4_S 11
/* DMA_OUTFIFO_CNT_L1_CH4 : RO ;bitpos:[10:6] ;default: 5'b0 ; */
/*description: The register stores the byte number of the data in L1 Tx FIFO for Tx channel 4.*/
#define DMA_OUTFIFO_CNT_L1_CH4 0x0000001F
#define DMA_OUTFIFO_CNT_L1_CH4_M ((DMA_OUTFIFO_CNT_L1_CH4_V) << (DMA_OUTFIFO_CNT_L1_CH4_S))
#define DMA_OUTFIFO_CNT_L1_CH4_V 0x1F
#define DMA_OUTFIFO_CNT_L1_CH4_S 6
/* DMA_OUTFIFO_EMPTY_L3_CH4 : RO ;bitpos:[5] ;default: 1'b1 ; */
/*description: L3 Tx FIFO empty signal for Tx channel 4.*/
#define DMA_OUTFIFO_EMPTY_L3_CH4 (BIT(5))
#define DMA_OUTFIFO_EMPTY_L3_CH4_M (BIT(5))
#define DMA_OUTFIFO_EMPTY_L3_CH4_V 0x1
#define DMA_OUTFIFO_EMPTY_L3_CH4_S 5
/* DMA_OUTFIFO_FULL_L3_CH4 : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: L3 Tx FIFO full signal for Tx channel 4.*/
#define DMA_OUTFIFO_FULL_L3_CH4 (BIT(4))
#define DMA_OUTFIFO_FULL_L3_CH4_M (BIT(4))
#define DMA_OUTFIFO_FULL_L3_CH4_V 0x1
#define DMA_OUTFIFO_FULL_L3_CH4_S 4
/* DMA_OUTFIFO_EMPTY_L2_CH4 : RO ;bitpos:[3] ;default: 1'b1 ; */
/*description: L2 Tx FIFO empty signal for Tx channel 4.*/
#define DMA_OUTFIFO_EMPTY_L2_CH4 (BIT(3))
#define DMA_OUTFIFO_EMPTY_L2_CH4_M (BIT(3))
#define DMA_OUTFIFO_EMPTY_L2_CH4_V 0x1
#define DMA_OUTFIFO_EMPTY_L2_CH4_S 3
/* DMA_OUTFIFO_FULL_L2_CH4 : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: L2 Tx FIFO full signal for Tx channel 4.*/
#define DMA_OUTFIFO_FULL_L2_CH4 (BIT(2))
#define DMA_OUTFIFO_FULL_L2_CH4_M (BIT(2))
#define DMA_OUTFIFO_FULL_L2_CH4_V 0x1
#define DMA_OUTFIFO_FULL_L2_CH4_S 2
/* DMA_OUTFIFO_EMPTY_L1_CH4 : RO ;bitpos:[1] ;default: 1'b1 ; */
/*description: L1 Tx FIFO empty signal for Tx channel 4.*/
#define DMA_OUTFIFO_EMPTY_L1_CH4 (BIT(1))
#define DMA_OUTFIFO_EMPTY_L1_CH4_M (BIT(1))
#define DMA_OUTFIFO_EMPTY_L1_CH4_V 0x1
#define DMA_OUTFIFO_EMPTY_L1_CH4_S 1
/* DMA_OUTFIFO_FULL_L1_CH4 : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: L1 Tx FIFO full signal for Tx channel 4.*/
#define DMA_OUTFIFO_FULL_L1_CH4 (BIT(0))
#define DMA_OUTFIFO_FULL_L1_CH4_M (BIT(0))
#define DMA_OUTFIFO_FULL_L1_CH4_V 0x1
#define DMA_OUTFIFO_FULL_L1_CH4_S 0

#define DMA_OUT_PUSH_CH0_REG (DR_REG_DMA_BASE + 0x0A4)
/* DMA_OUTFIFO_PUSH_CH0 : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: Set this bit to push data into DMA FIFO.*/
#define DMA_OUTFIFO_PUSH_CH0 (BIT(9))
#define DMA_OUTFIFO_PUSH_CH0_M (BIT(9))
#define DMA_OUTFIFO_PUSH_CH0_V 0x1
#define DMA_OUTFIFO_PUSH_CH0_S 9
/* DMA_OUTFIFO_WDATA_CH0 : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: This register stores the data that need to be pushed into DMA FIFO.*/
#define DMA_OUTFIFO_WDATA_CH0 0x000001FF
#define DMA_OUTFIFO_WDATA_CH0_M ((DMA_OUTFIFO_WDATA_CH0_V) << (DMA_OUTFIFO_WDATA_CH0_S))
#define DMA_OUTFIFO_WDATA_CH0_V 0x1FF
#define DMA_OUTFIFO_WDATA_CH0_S 0

#define DMA_OUT_PUSH_CH1_REG (DR_REG_DMA_BASE + 0x0A8)
/* DMA_OUTFIFO_PUSH_CH1 : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: Set this bit to push data into DMA FIFO.*/
#define DMA_OUTFIFO_PUSH_CH1 (BIT(9))
#define DMA_OUTFIFO_PUSH_CH1_M (BIT(9))
#define DMA_OUTFIFO_PUSH_CH1_V 0x1
#define DMA_OUTFIFO_PUSH_CH1_S 9
/* DMA_OUTFIFO_WDATA_CH1 : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: This register stores the data that need to be pushed into DMA FIFO.*/
#define DMA_OUTFIFO_WDATA_CH1 0x000001FF
#define DMA_OUTFIFO_WDATA_CH1_M ((DMA_OUTFIFO_WDATA_CH1_V) << (DMA_OUTFIFO_WDATA_CH1_S))
#define DMA_OUTFIFO_WDATA_CH1_V 0x1FF
#define DMA_OUTFIFO_WDATA_CH1_S 0

#define DMA_OUT_PUSH_CH2_REG (DR_REG_DMA_BASE + 0x0AC)
/* DMA_OUTFIFO_PUSH_CH2 : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: Set this bit to push data into DMA FIFO.*/
#define DMA_OUTFIFO_PUSH_CH2 (BIT(9))
#define DMA_OUTFIFO_PUSH_CH2_M (BIT(9))
#define DMA_OUTFIFO_PUSH_CH2_V 0x1
#define DMA_OUTFIFO_PUSH_CH2_S 9
/* DMA_OUTFIFO_WDATA_CH2 : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: This register stores the data that need to be pushed into DMA FIFO.*/
#define DMA_OUTFIFO_WDATA_CH2 0x000001FF
#define DMA_OUTFIFO_WDATA_CH2_M ((DMA_OUTFIFO_WDATA_CH2_V) << (DMA_OUTFIFO_WDATA_CH2_S))
#define DMA_OUTFIFO_WDATA_CH2_V 0x1FF
#define DMA_OUTFIFO_WDATA_CH2_S 0

