espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_OUT_PUSH_CH3_REG (DR_REG_DMA_BASE + 0x0B0)
/* DMA_OUTFIFO_PUSH_CH3 : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: Set this bit to push data into DMA FIFO.*/
#define DMA_OUTFIFO_PUSH_CH3 (BIT(9))
#define DMA_OUTFIFO_PUSH_CH3_M (BIT(9))
#define DMA_OUTFIFO_PUSH_CH3_V 0x1
#define DMA_OUTFIFO_PUSH_CH3_S 9
/* DMA_OUTFIFO_WDATA_CH3 : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: This register stores the data that need to be pushed into DMA FIFO.*/
#define DMA_OUTFIFO_WDATA_CH3 0x000001FF
#define DMA_OUTFIFO_WDATA_CH3_M ((DMA_OUTFIFO_WDATA_CH3_V) << (DMA_OUTFIFO_WDATA_CH3_S))
#define DMA_OUTFIFO_WDATA_CH3_V 0x1FF
#define DMA_OUTFIFO_WDATA_CH3_S 0

#define DMA_OUT_PUSH_CH4_REG (DR_REG_DMA_BASE + 0x0B4)
/* DMA_OUTFIFO_PUSH_CH4 : R/W ;bitpos:[9] ;default: 1'h0 ; */
/*description: Set this bit to push data into DMA FIFO.*/
#define DMA_OUTFIFO_PUSH_CH4 (BIT(9))
#define DMA_OUTFIFO_PUSH_CH4_M (BIT(9))
#define DMA_OUTFIFO_PUSH_CH4_V 0x1
#define DMA_OUTFIFO_PUSH_CH4_S 9
/* DMA_OUTFIFO_WDATA_CH4 : R/W ;bitpos:[8:0] ;default: 9'h0 ; */
/*description: This register stores the data that need to be pushed into DMA FIFO.*/
#define DMA_OUTFIFO_WDATA_CH4 0x000001FF
#define DMA_OUTFIFO_WDATA_CH4_M ((DMA_OUTFIFO_WDATA_CH4_V) << (DMA_OUTFIFO_WDATA_CH4_S))
#define DMA_OUTFIFO_WDATA_CH4_V 0x1FF
#define DMA_OUTFIFO_WDATA_CH4_S 0

#define DMA_IN_POP_CH0_REG (DR_REG_DMA_BASE + 0x0B8)
/* DMA_INFIFO_POP_CH0 : R/W ;bitpos:[12] ;default: 1'h0 ; */
/*description: Set this bit to pop data from DMA FIFO.*/
#define DMA_INFIFO_POP_CH0 (BIT(12))
#define DMA_INFIFO_POP_CH0_M (BIT(12))
#define DMA_INFIFO_POP_CH0_V 0x1
#define DMA_INFIFO_POP_CH0_S 12
/* DMA_INFIFO_RDATA_CH0 : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: This register stores the data popping from DMA FIFO.*/
#define DMA_INFIFO_RDATA_CH0 0x00000FFF
#define DMA_INFIFO_RDATA_CH0_M ((DMA_INFIFO_RDATA_CH0_V) << (DMA_INFIFO_RDATA_CH0_S))
#define DMA_INFIFO_RDATA_CH0_V 0xFFF
#define DMA_INFIFO_RDATA_CH0_S 0

#define DMA_IN_POP_CH1_REG (DR_REG_DMA_BASE + 0x0BC)
/* DMA_INFIFO_POP_CH1 : R/W ;bitpos:[12] ;default: 1'h0 ; */
/*description: Set this bit to pop data from DMA FIFO.*/
#define DMA_INFIFO_POP_CH1 (BIT(12))
#define DMA_INFIFO_POP_CH1_M (BIT(12))
#define DMA_INFIFO_POP_CH1_V 0x1
#define DMA_INFIFO_POP_CH1_S 12
/* DMA_INFIFO_RDATA_CH1 : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: This register stores the data popping from DMA FIFO.*/
#define DMA_INFIFO_RDATA_CH1 0x00000FFF
#define DMA_INFIFO_RDATA_CH1_M ((DMA_INFIFO_RDATA_CH1_V) << (DMA_INFIFO_RDATA_CH1_S))
#define DMA_INFIFO_RDATA_CH1_V 0xFFF
#define DMA_INFIFO_RDATA_CH1_S 0

#define DMA_IN_POP_CH2_REG (DR_REG_DMA_BASE + 0x0C0)
/* DMA_INFIFO_POP_CH2 : R/W ;bitpos:[12] ;default: 1'h0 ; */
/*description: Set this bit to pop data from DMA FIFO.*/
#define DMA_INFIFO_POP_CH2 (BIT(12))
#define DMA_INFIFO_POP_CH2_M (BIT(12))
#define DMA_INFIFO_POP_CH2_V 0x1
#define DMA_INFIFO_POP_CH2_S 12
/* DMA_INFIFO_RDATA_CH2 : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: This register stores the data popping from DMA FIFO.*/
#define DMA_INFIFO_RDATA_CH2 0x00000FFF
#define DMA_INFIFO_RDATA_CH2_M ((DMA_INFIFO_RDATA_CH2_V) << (DMA_INFIFO_RDATA_CH2_S))
#define DMA_INFIFO_RDATA_CH2_V 0xFFF
#define DMA_INFIFO_RDATA_CH2_S 0

#define DMA_IN_POP_CH3_REG (DR_REG_DMA_BASE + 0x0C4)
/* DMA_INFIFO_POP_CH3 : R/W ;bitpos:[12] ;default: 1'h0 ; */
/*description: Set this bit to pop data from DMA FIFO.*/
#define DMA_INFIFO_POP_CH3 (BIT(12))
#define DMA_INFIFO_POP_CH3_M (BIT(12))
#define DMA_INFIFO_POP_CH3_V 0x1
#define DMA_INFIFO_POP_CH3_S 12
/* DMA_INFIFO_RDATA_CH3 : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: This register stores the data popping from DMA FIFO.*/
#define DMA_INFIFO_RDATA_CH3 0x00000FFF
#define DMA_INFIFO_RDATA_CH3_M ((DMA_INFIFO_RDATA_CH3_V) << (DMA_INFIFO_RDATA_CH3_S))
#define DMA_INFIFO_RDATA_CH3_V 0xFFF
#define DMA_INFIFO_RDATA_CH3_S 0

#define DMA_IN_POP_CH4_REG (DR_REG_DMA_BASE + 0x0C8)
/* DMA_INFIFO_POP_CH4 : R/W ;bitpos:[12] ;default: 1'h0 ; */
/*description: Set this bit to pop data from DMA FIFO.*/
#define DMA_INFIFO_POP_CH4 (BIT(12))
#define DMA_INFIFO_POP_CH4_M (BIT(12))
#define DMA_INFIFO_POP_CH4_V 0x1
#define DMA_INFIFO_POP_CH4_S 12
/* DMA_INFIFO_RDATA_CH4 : RO ;bitpos:[11:0] ;default: 12'h0 ; */
/*description: This register stores the data popping from DMA FIFO.*/
#define DMA_INFIFO_RDATA_CH4 0x00000FFF
#define DMA_INFIFO_RDATA_CH4_M ((DMA_INFIFO_RDATA_CH4_V) << (DMA_INFIFO_RDATA_CH4_S))
#define DMA_INFIFO_RDATA_CH4_V 0xFFF
#define DMA_INFIFO_RDATA_CH4_S 0

#define DMA_OUT_LINK_CH0_REG (DR_REG_DMA_BASE + 0x0CC)
/* DMA_OUTLINK_PARK_CH0 : RO ;bitpos:[23] ;default: 1'h1 ; */
/*description: 1: the outlink descriptor's FSM is in idle state.  0: the outlink
 descriptor's FSM is working.*/
#define DMA_OUTLINK_PARK_CH0 (BIT(23))
#define DMA_OUTLINK_PARK_CH0_M (BIT(23))
#define DMA_OUTLINK_PARK_CH0_V 0x1
#define DMA_OUTLINK_PARK_CH0_S 23
/* DMA_OUTLINK_RESTART_CH0 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to restart a new outlink from the last address.*/
#define DMA_OUTLINK_RESTART_CH0 (BIT(22))
#define DMA_OUTLINK_RESTART_CH0_M (BIT(22))
#define DMA_OUTLINK_RESTART_CH0_V 0x1
#define DMA_OUTLINK_RESTART_CH0_S 22
/* DMA_OUTLINK_START_CH0 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the outlink descriptors.*/
#define DMA_OUTLINK_START_CH0 (BIT(21))
#define DMA_OUTLINK_START_CH0_M (BIT(21))
#define DMA_OUTLINK_START_CH0_V 0x1
#define DMA_OUTLINK_START_CH0_S 21
/* DMA_OUTLINK_STOP_CH0 : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the outlink descriptors.*/
#define DMA_OUTLINK_STOP_CH0 (BIT(20))
#define DMA_OUTLINK_STOP_CH0_M (BIT(20))
#define DMA_OUTLINK_STOP_CH0_V 0x1
#define DMA_OUTLINK_STOP_CH0_S 20
/* DMA_OUTLINK_ADDR_CH0 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 outlink descriptor's address.*/
#define DMA_OUTLINK_ADDR_CH0 0x000FFFFF
#define DMA_OUTLINK_ADDR_CH0_M ((DMA_OUTLINK_ADDR_CH0_V) << (DMA_OUTLINK_ADDR_CH0_S))
#define DMA_OUTLINK_ADDR_CH0_V 0xFFFFF
#define DMA_OUTLINK_ADDR_CH0_S 0

#define DMA_OUT_LINK_CH1_REG (DR_REG_DMA_BASE + 0x0D0)
/* DMA_OUTLINK_PARK_CH1 : RO ;bitpos:[23] ;default: 1'h1 ; */
/*description: 1: the outlink descriptor's FSM is in idle state.  0: the outlink
 descriptor's FSM is working.*/
#define DMA_OUTLINK_PARK_CH1 (BIT(23))
#define DMA_OUTLINK_PARK_CH1_M (BIT(23))
#define DMA_OUTLINK_PARK_CH1_V 0x1
#define DMA_OUTLINK_PARK_CH1_S 23
/* DMA_OUTLINK_RESTART_CH1 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to restart a new outlink from the last address.*/
#define DMA_OUTLINK_RESTART_CH1 (BIT(22))
#define DMA_OUTLINK_RESTART_CH1_M (BIT(22))
#define DMA_OUTLINK_RESTART_CH1_V 0x1
#define DMA_OUTLINK_RESTART_CH1_S 22
/* DMA_OUTLINK_START_CH1 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the outlink descriptors.*/
#define DMA_OUTLINK_START_CH1 (BIT(21))
#define DMA_OUTLINK_START_CH1_M (BIT(21))
#define DMA_OUTLINK_START_CH1_V 0x1
#define DMA_OUTLINK_START_CH1_S 21
/* DMA_OUTLINK_STOP_CH1 : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the outlink descriptors.*/
#define DMA_OUTLINK_STOP_CH1 (BIT(20))
#define DMA_OUTLINK_STOP_CH1_M (BIT(20))
#define DMA_OUTLINK_STOP_CH1_V 0x1
#define DMA_OUTLINK_STOP_CH1_S 20
/* DMA_OUTLINK_ADDR_CH1 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 outlink descriptor's address.*/
#define DMA_OUTLINK_ADDR_CH1 0x000FFFFF
#define DMA_OUTLINK_ADDR_CH1_M ((DMA_OUTLINK_ADDR_CH1_V) << (DMA_OUTLINK_ADDR_CH1_S))
#define DMA_OUTLINK_ADDR_CH1_V 0xFFFFF
#define DMA_OUTLINK_ADDR_CH1_S 0

#define DMA_OUT_LINK_CH2_REG (DR_REG_DMA_BASE + 0x0D4)
/* DMA_OUTLINK_PARK_CH2 : RO ;bitpos:[23] ;default: 1'h1 ; */
/*description: 1: the outlink descriptor's FSM is in idle state.  0: the outlink
 descriptor's FSM is working.*/
#define DMA_OUTLINK_PARK_CH2 (BIT(23))
#define DMA_OUTLINK_PARK_CH2_M (BIT(23))
#define DMA_OUTLINK_PARK_CH2_V 0x1
#define DMA_OUTLINK_PARK_CH2_S 23
/* DMA_OUTLINK_RESTART_CH2 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to restart a new outlink from the last address.*/
#define DMA_OUTLINK_RESTART_CH2 (BIT(22))
#define DMA_OUTLINK_RESTART_CH2_M (BIT(22))
#define DMA_OUTLINK_RESTART_CH2_V 0x1
#define DMA_OUTLINK_RESTART_CH2_S 22
/* DMA_OUTLINK_START_CH2 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the outlink descriptors.*/
#define DMA_OUTLINK_START_CH2 (BIT(21))
#define DMA_OUTLINK_START_CH2_M (BIT(21))
#define DMA_OUTLINK_START_CH2_V 0x1
#define DMA_OUTLINK_START_CH2_S 21
/* DMA_OUTLINK_STOP_CH2 : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the outlink descriptors.*/
#define DMA_OUTLINK_STOP_CH2 (BIT(20))
#define DMA_OUTLINK_STOP_CH2_M (BIT(20))
#define DMA_OUTLINK_STOP_CH2_V 0x1
#define DMA_OUTLINK_STOP_CH2_S 20
/* DMA_OUTLINK_ADDR_CH2 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 outlink descriptor's address.*/
#define DMA_OUTLINK_ADDR_CH2 0x000FFFFF
#define DMA_OUTLINK_ADDR_CH2_M ((DMA_OUTLINK_ADDR_CH2_V) << (DMA_OUTLINK_ADDR_CH2_S))
#define DMA_OUTLINK_ADDR_CH2_V 0xFFFFF
#define DMA_OUTLINK_ADDR_CH2_S 0

#define DMA_OUT_LINK_CH3_REG (DR_REG_DMA_BASE + 0x0D8)
/* DMA_OUTLINK_PARK_CH3 : RO ;bitpos:[23] ;default: 1'h1 ; */
/*description: 1: the outlink descriptor's FSM is in idle state.  0: the outlink
 descriptor's FSM is working.*/
#define DMA_OUTLINK_PARK_CH3 (BIT(23))
#define DMA_OUTLINK_PARK_CH3_M (BIT(23))
#define DMA_OUTLINK_PARK_CH3_V 0x1
#define DMA_OUTLINK_PARK_CH3_S 23
/* DMA_OUTLINK_RESTART_CH3 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to restart a new outlink from the last address.*/
#define DMA_OUTLINK_RESTART_CH3 (BIT(22))
#define DMA_OUTLINK_RESTART_CH3_M (BIT(22))
#define DMA_OUTLINK_RESTART_CH3_V 0x1
#define DMA_OUTLINK_RESTART_CH3_S 22
/* DMA_OUTLINK_START_CH3 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the outlink descriptors.*/
#define DMA_OUTLINK_START_CH3 (BIT(21))
#define DMA_OUTLINK_START_CH3_M (BIT(21))
#define DMA_OUTLINK_START_CH3_V 0x1
#define DMA_OUTLINK_START_CH3_S 21
/* DMA_OUTLINK_STOP_CH3 : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the outlink descriptors.*/
#define DMA_OUTLINK_STOP_CH3 (BIT(20))
#define DMA_OUTLINK_STOP_CH3_M (BIT(20))
#define DMA_OUTLINK_STOP_CH3_V 0x1
#define DMA_OUTLINK_STOP_CH3_S 20
/* DMA_OUTLINK_ADDR_CH3 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 outlink descriptor's address.*/
#define DMA_OUTLINK_ADDR_CH3 0x000FFFFF
#define DMA_OUTLINK_ADDR_CH3_M ((DMA_OUTLINK_ADDR_CH3_V) << (DMA_OUTLINK_ADDR_CH3_S))
#define DMA_OUTLINK_ADDR_CH3_V 0xFFFFF
#define DMA_OUTLINK_ADDR_CH3_S 0

#define DMA_OUT_LINK_CH4_REG (DR_REG_DMA_BASE + 0x0DC)
/* DMA_OUTLINK_PARK_CH4 : RO ;bitpos:[23] ;default: 1'h1 ; */
/*description: 1: the outlink descriptor's FSM is in idle state.  0: the outlink
 descriptor's FSM is working.*/
#define DMA_OUTLINK_PARK_CH4 (BIT(23))
#define DMA_OUTLINK_PARK_CH4_M (BIT(23))
#define DMA_OUTLINK_PARK_CH4_V 0x1
#define DMA_OUTLINK_PARK_CH4_S 23
/* DMA_OUTLINK_RESTART_CH4 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to restart a new outlink from the last address.*/
#define DMA_OUTLINK_RESTART_CH4 (BIT(22))
#define DMA_OUTLINK_RESTART_CH4_M (BIT(22))
#define DMA_OUTLINK_RESTART_CH4_V 0x1
#define DMA_OUTLINK_RESTART_CH4_S 22
/* DMA_OUTLINK_START_CH4 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the outlink descriptors.*/
#define DMA_OUTLINK_START_CH4 (BIT(21))
#define DMA_OUTLINK_START_CH4_M (BIT(21))
#define DMA_OUTLINK_START_CH4_V 0x1
#define DMA_OUTLINK_START_CH4_S 21
/* DMA_OUTLINK_STOP_CH4 : R/W ;bitpos:[20] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the outlink descriptors.*/
#define DMA_OUTLINK_STOP_CH4 (BIT(20))
#define DMA_OUTLINK_STOP_CH4_M (BIT(20))
#define DMA_OUTLINK_STOP_CH4_V 0x1
#define DMA_OUTLINK_STOP_CH4_S 20
/* DMA_OUTLINK_ADDR_CH4 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 outlink descriptor's address.*/
#define DMA_OUTLINK_ADDR_CH4 0x000FFFFF
#define DMA_OUTLINK_ADDR_CH4_M ((DMA_OUTLINK_ADDR_CH4_V) << (DMA_OUTLINK_ADDR_CH4_S))
#define DMA_OUTLINK_ADDR_CH4_V 0xFFFFF
#define DMA_OUTLINK_ADDR_CH4_S 0

#define DMA_IN_LINK_CH0_REG (DR_REG_DMA_BASE + 0x0E0)
/* DMA_INLINK_PARK_CH0 : RO ;bitpos:[24] ;default: 1'h1 ; */
/*description: 1: the inlink descriptor's FSM is in idle state.  0: the inlink
 descriptor's FSM is working.*/
#define DMA_INLINK_PARK_CH0 (BIT(24))
#define DMA_INLINK_PARK_CH0_M (BIT(24))
#define DMA_INLINK_PARK_CH0_V 0x1
#define DMA_INLINK_PARK_CH0_S 24
/* DMA_INLINK_RESTART_CH0 : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: Set this bit to mount a new inlink descriptor.*/
#define DMA_INLINK_RESTART_CH0 (BIT(23))
#define DMA_INLINK_RESTART_CH0_M (BIT(23))
#define DMA_INLINK_RESTART_CH0_V 0x1
#define DMA_INLINK_RESTART_CH0_S 23
/* DMA_INLINK_START_CH0 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the inlink descriptors.*/
#define DMA_INLINK_START_CH0 (BIT(22))
#define DMA_INLINK_START_CH0_M (BIT(22))
#define DMA_INLINK_START_CH0_V 0x1
#define DMA_INLINK_START_CH0_S 22
/* DMA_INLINK_STOP_CH0 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the inlink descriptors.*/
#define DMA_INLINK_STOP_CH0 (BIT(21))
#define DMA_INLINK_STOP_CH0_M (BIT(21))
#define DMA_INLINK_STOP_CH0_V 0x1
#define DMA_INLINK_STOP_CH0_S 21
/* DMA_INLINK_AUTO_RET_CH0 : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: Set this bit to return to current inlink descriptor's address
  when there are some errors in current receiving data.*/
#define DMA_INLINK_AUTO_RET_CH0 (BIT(20))
#define DMA_INLINK_AUTO_RET_CH0_M (BIT(20))
#define DMA_INLINK_AUTO_RET_CH0_V 0x1
#define DMA_INLINK_AUTO_RET_CH0_S 20
/* DMA_INLINK_ADDR_CH0 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 inlink descriptor's address.*/
#define DMA_INLINK_ADDR_CH0 0x000FFFFF
#define DMA_INLINK_ADDR_CH0_M ((DMA_INLINK_ADDR_CH0_V) << (DMA_INLINK_ADDR_CH0_S))
#define DMA_INLINK_ADDR_CH0_V 0xFFFFF
#define DMA_INLINK_ADDR_CH0_S 0

#define DMA_IN_LINK_CH1_REG (DR_REG_DMA_BASE + 0x0E4)
/* DMA_INLINK_PARK_CH1 : RO ;bitpos:[24] ;default: 1'h1 ; */
/*description: 1: the inlink descriptor's FSM is in idle state.  0: the inlink
 descriptor's FSM is working.*/
#define DMA_INLINK_PARK_CH1 (BIT(24))
#define DMA_INLINK_PARK_CH1_M (BIT(24))
#define DMA_INLINK_PARK_CH1_V 0x1
#define DMA_INLINK_PARK_CH1_S 24
/* DMA_INLINK_RESTART_CH1 : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: Set this bit to mount a new inlink descriptor.*/
#define DMA_INLINK_RESTART_CH1 (BIT(23))
#define DMA_INLINK_RESTART_CH1_M (BIT(23))
#define DMA_INLINK_RESTART_CH1_V 0x1
#define DMA_INLINK_RESTART_CH1_S 23
/* DMA_INLINK_START_CH1 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the inlink descriptors.*/
#define DMA_INLINK_START_CH1 (BIT(22))
#define DMA_INLINK_START_CH1_M (BIT(22))
#define DMA_INLINK_START_CH1_V 0x1
#define DMA_INLINK_START_CH1_S 22
/* DMA_INLINK_STOP_CH1 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the inlink descriptors.*/
#define DMA_INLINK_STOP_CH1 (BIT(21))
#define DMA_INLINK_STOP_CH1_M (BIT(21))
#define DMA_INLINK_STOP_CH1_V 0x1
#define DMA_INLINK_STOP_CH1_S 21
/* DMA_INLINK_AUTO_RET_CH1 : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: Set this bit to return to current inlink descriptor's address
  when there are some errors in current receiving data.*/
#define DMA_INLINK_AUTO_RET_CH1 (BIT(20))
#define DMA_INLINK_AUTO_RET_CH1_M (BIT(20))
#define DMA_INLINK_AUTO_RET_CH1_V 0x1
#define DMA_INLINK_AUTO_RET_CH1_S 20
/* DMA_INLINK_ADDR_CH1 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 inlink descriptor's address.*/
#define DMA_INLINK_ADDR_CH1 0x000FFFFF
#define DMA_INLINK_ADDR_CH1_M ((DMA_INLINK_ADDR_CH1_V) << (DMA_INLINK_ADDR_CH1_S))
#define DMA_INLINK_ADDR_CH1_V 0xFFFFF
#define DMA_INLINK_ADDR_CH1_S 0

