espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_IN_LINK_CH2_REG (DR_REG_DMA_BASE + 0x0E8)
/* DMA_INLINK_PARK_CH2 : RO ;bitpos:[24] ;default: 1'h1 ; */
/*description: 1: the inlink descriptor's FSM is in idle state.  0: the inlink
 descriptor's FSM is working.*/
#define DMA_INLINK_PARK_CH2 (BIT(24))
#define DMA_INLINK_PARK_CH2_M (BIT(24))
#define DMA_INLINK_PARK_CH2_V 0x1
#define DMA_INLINK_PARK_CH2_S 24
/* DMA_INLINK_RESTART_CH2 : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: Set this bit to mount a new inlink descriptor.*/
#define DMA_INLINK_RESTART_CH2 (BIT(23))
#define DMA_INLINK_RESTART_CH2_M (BIT(23))
#define DMA_INLINK_RESTART_CH2_V 0x1
#define DMA_INLINK_RESTART_CH2_S 23
/* DMA_INLINK_START_CH2 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the inlink descriptors.*/
#define DMA_INLINK_START_CH2 (BIT(22))
#define DMA_INLINK_START_CH2_M (BIT(22))
#define DMA_INLINK_START_CH2_V 0x1
#define DMA_INLINK_START_CH2_S 22
/* DMA_INLINK_STOP_CH2 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the inlink descriptors.*/
#define DMA_INLINK_STOP_CH2 (BIT(21))
#define DMA_INLINK_STOP_CH2_M (BIT(21))
#define DMA_INLINK_STOP_CH2_V 0x1
#define DMA_INLINK_STOP_CH2_S 21
/* DMA_INLINK_AUTO_RET_CH2 : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: Set this bit to return to current inlink descriptor's address
  when there are some errors in current receiving data.*/
#define DMA_INLINK_AUTO_RET_CH2 (BIT(20))
#define DMA_INLINK_AUTO_RET_CH2_M (BIT(20))
#define DMA_INLINK_AUTO_RET_CH2_V 0x1
#define DMA_INLINK_AUTO_RET_CH2_S 20
/* DMA_INLINK_ADDR_CH2 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 inlink descriptor's address.*/
#define DMA_INLINK_ADDR_CH2 0x000FFFFF
#define DMA_INLINK_ADDR_CH2_M ((DMA_INLINK_ADDR_CH2_V) << (DMA_INLINK_ADDR_CH2_S))
#define DMA_INLINK_ADDR_CH2_V 0xFFFFF
#define DMA_INLINK_ADDR_CH2_S 0

#define DMA_IN_LINK_CH3_REG (DR_REG_DMA_BASE + 0x0EC)
/* DMA_INLINK_PARK_CH3 : RO ;bitpos:[24] ;default: 1'h1 ; */
/*description: 1: the inlink descriptor's FSM is in idle state.  0: the inlink
 descriptor's FSM is working.*/
#define DMA_INLINK_PARK_CH3 (BIT(24))
#define DMA_INLINK_PARK_CH3_M (BIT(24))
#define DMA_INLINK_PARK_CH3_V 0x1
#define DMA_INLINK_PARK_CH3_S 24
/* DMA_INLINK_RESTART_CH3 : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: Set this bit to mount a new inlink descriptor.*/
#define DMA_INLINK_RESTART_CH3 (BIT(23))
#define DMA_INLINK_RESTART_CH3_M (BIT(23))
#define DMA_INLINK_RESTART_CH3_V 0x1
#define DMA_INLINK_RESTART_CH3_S 23
/* DMA_INLINK_START_CH3 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the inlink descriptors.*/
#define DMA_INLINK_START_CH3 (BIT(22))
#define DMA_INLINK_START_CH3_M (BIT(22))
#define DMA_INLINK_START_CH3_V 0x1
#define DMA_INLINK_START_CH3_S 22
/* DMA_INLINK_STOP_CH3 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the inlink descriptors.*/
#define DMA_INLINK_STOP_CH3 (BIT(21))
#define DMA_INLINK_STOP_CH3_M (BIT(21))
#define DMA_INLINK_STOP_CH3_V 0x1
#define DMA_INLINK_STOP_CH3_S 21
/* DMA_INLINK_AUTO_RET_CH3 : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: Set this bit to return to current inlink descriptor's address
  when there are some errors in current receiving data.*/
#define DMA_INLINK_AUTO_RET_CH3 (BIT(20))
#define DMA_INLINK_AUTO_RET_CH3_M (BIT(20))
#define DMA_INLINK_AUTO_RET_CH3_V 0x1
#define DMA_INLINK_AUTO_RET_CH3_S 20
/* DMA_INLINK_ADDR_CH3 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 inlink descriptor's address.*/
#define DMA_INLINK_ADDR_CH3 0x000FFFFF
#define DMA_INLINK_ADDR_CH3_M ((DMA_INLINK_ADDR_CH3_V) << (DMA_INLINK_ADDR_CH3_S))
#define DMA_INLINK_ADDR_CH3_V 0xFFFFF
#define DMA_INLINK_ADDR_CH3_S 0

#define DMA_IN_LINK_CH4_REG (DR_REG_DMA_BASE + 0x0F0)
/* DMA_INLINK_PARK_CH4 : RO ;bitpos:[24] ;default: 1'h1 ; */
/*description: 1: the inlink descriptor's FSM is in idle state.  0: the inlink
 descriptor's FSM is working.*/
#define DMA_INLINK_PARK_CH4 (BIT(24))
#define DMA_INLINK_PARK_CH4_M (BIT(24))
#define DMA_INLINK_PARK_CH4_V 0x1
#define DMA_INLINK_PARK_CH4_S 24
/* DMA_INLINK_RESTART_CH4 : R/W ;bitpos:[23] ;default: 1'b0 ; */
/*description: Set this bit to mount a new inlink descriptor.*/
#define DMA_INLINK_RESTART_CH4 (BIT(23))
#define DMA_INLINK_RESTART_CH4_M (BIT(23))
#define DMA_INLINK_RESTART_CH4_V 0x1
#define DMA_INLINK_RESTART_CH4_S 23
/* DMA_INLINK_START_CH4 : R/W ;bitpos:[22] ;default: 1'b0 ; */
/*description: Set this bit to start dealing with the inlink descriptors.*/
#define DMA_INLINK_START_CH4 (BIT(22))
#define DMA_INLINK_START_CH4_M (BIT(22))
#define DMA_INLINK_START_CH4_V 0x1
#define DMA_INLINK_START_CH4_S 22
/* DMA_INLINK_STOP_CH4 : R/W ;bitpos:[21] ;default: 1'b0 ; */
/*description: Set this bit to stop dealing with the inlink descriptors.*/
#define DMA_INLINK_STOP_CH4 (BIT(21))
#define DMA_INLINK_STOP_CH4_M (BIT(21))
#define DMA_INLINK_STOP_CH4_V 0x1
#define DMA_INLINK_STOP_CH4_S 21
/* DMA_INLINK_AUTO_RET_CH4 : R/W ;bitpos:[20] ;default: 1'b1 ; */
/*description: Set this bit to return to current inlink descriptor's address
  when there are some errors in current receiving data.*/
#define DMA_INLINK_AUTO_RET_CH4 (BIT(20))
#define DMA_INLINK_AUTO_RET_CH4_M (BIT(20))
#define DMA_INLINK_AUTO_RET_CH4_V 0x1
#define DMA_INLINK_AUTO_RET_CH4_S 20
/* DMA_INLINK_ADDR_CH4 : R/W ;bitpos:[19:0] ;default: 20'h0 ; */
/*description: This register stores the 20 least significant bits of the first
 inlink descriptor's address.*/
#define DMA_INLINK_ADDR_CH4 0x000FFFFF
#define DMA_INLINK_ADDR_CH4_M ((DMA_INLINK_ADDR_CH4_V) << (DMA_INLINK_ADDR_CH4_S))
#define DMA_INLINK_ADDR_CH4_V 0xFFFFF
#define DMA_INLINK_ADDR_CH4_S 0

#define DMA_IN_STATE_CH0_REG (DR_REG_DMA_BASE + 0x0F4)
/* DMA_IN_STATE_CH0 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_IN_STATE_CH0 0x00000007
#define DMA_IN_STATE_CH0_M ((DMA_IN_STATE_CH0_V) << (DMA_IN_STATE_CH0_S))
#define DMA_IN_STATE_CH0_V 0x7
#define DMA_IN_STATE_CH0_S 20
/* DMA_IN_DSCR_STATE_CH0 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_IN_DSCR_STATE_CH0 0x00000003
#define DMA_IN_DSCR_STATE_CH0_M ((DMA_IN_DSCR_STATE_CH0_V) << (DMA_IN_DSCR_STATE_CH0_S))
#define DMA_IN_DSCR_STATE_CH0_V 0x3
#define DMA_IN_DSCR_STATE_CH0_S 18
/* DMA_INLINK_DSCR_ADDR_CH0 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current inlink descriptor's address.*/
#define DMA_INLINK_DSCR_ADDR_CH0 0x0003FFFF
#define DMA_INLINK_DSCR_ADDR_CH0_M ((DMA_INLINK_DSCR_ADDR_CH0_V) << (DMA_INLINK_DSCR_ADDR_CH0_S))
#define DMA_INLINK_DSCR_ADDR_CH0_V 0x3FFFF
#define DMA_INLINK_DSCR_ADDR_CH0_S 0

