espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_IN_STATE_CH1_REG (DR_REG_DMA_BASE + 0x0F8)
/* DMA_IN_STATE_CH1 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_IN_STATE_CH1 0x00000007
#define DMA_IN_STATE_CH1_M ((DMA_IN_STATE_CH1_V) << (DMA_IN_STATE_CH1_S))
#define DMA_IN_STATE_CH1_V 0x7
#define DMA_IN_STATE_CH1_S 20
/* DMA_IN_DSCR_STATE_CH1 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_IN_DSCR_STATE_CH1 0x00000003
#define DMA_IN_DSCR_STATE_CH1_M ((DMA_IN_DSCR_STATE_CH1_V) << (DMA_IN_DSCR_STATE_CH1_S))
#define DMA_IN_DSCR_STATE_CH1_V 0x3
#define DMA_IN_DSCR_STATE_CH1_S 18
/* DMA_INLINK_DSCR_ADDR_CH1 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current inlink descriptor's address.*/
#define DMA_INLINK_DSCR_ADDR_CH1 0x0003FFFF
#define DMA_INLINK_DSCR_ADDR_CH1_M ((DMA_INLINK_DSCR_ADDR_CH1_V) << (DMA_INLINK_DSCR_ADDR_CH1_S))
#define DMA_INLINK_DSCR_ADDR_CH1_V 0x3FFFF
#define DMA_INLINK_DSCR_ADDR_CH1_S 0

#define DMA_IN_STATE_CH2_REG (DR_REG_DMA_BASE + 0x0FC)
/* DMA_IN_STATE_CH2 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_IN_STATE_CH2 0x00000007
#define DMA_IN_STATE_CH2_M ((DMA_IN_STATE_CH2_V) << (DMA_IN_STATE_CH2_S))
#define DMA_IN_STATE_CH2_V 0x7
#define DMA_IN_STATE_CH2_S 20
/* DMA_IN_DSCR_STATE_CH2 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_IN_DSCR_STATE_CH2 0x00000003
#define DMA_IN_DSCR_STATE_CH2_M ((DMA_IN_DSCR_STATE_CH2_V) << (DMA_IN_DSCR_STATE_CH2_S))
#define DMA_IN_DSCR_STATE_CH2_V 0x3
#define DMA_IN_DSCR_STATE_CH2_S 18
/* DMA_INLINK_DSCR_ADDR_CH2 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current inlink descriptor's address.*/
#define DMA_INLINK_DSCR_ADDR_CH2 0x0003FFFF
#define DMA_INLINK_DSCR_ADDR_CH2_M ((DMA_INLINK_DSCR_ADDR_CH2_V) << (DMA_INLINK_DSCR_ADDR_CH2_S))
#define DMA_INLINK_DSCR_ADDR_CH2_V 0x3FFFF
#define DMA_INLINK_DSCR_ADDR_CH2_S 0

#define DMA_IN_STATE_CH3_REG (DR_REG_DMA_BASE + 0x100)
/* DMA_IN_STATE_CH3 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_IN_STATE_CH3 0x00000007
#define DMA_IN_STATE_CH3_M ((DMA_IN_STATE_CH3_V) << (DMA_IN_STATE_CH3_S))
#define DMA_IN_STATE_CH3_V 0x7
#define DMA_IN_STATE_CH3_S 20
/* DMA_IN_DSCR_STATE_CH3 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_IN_DSCR_STATE_CH3 0x00000003
#define DMA_IN_DSCR_STATE_CH3_M ((DMA_IN_DSCR_STATE_CH3_V) << (DMA_IN_DSCR_STATE_CH3_S))
#define DMA_IN_DSCR_STATE_CH3_V 0x3
#define DMA_IN_DSCR_STATE_CH3_S 18
/* DMA_INLINK_DSCR_ADDR_CH3 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current inlink descriptor's address.*/
#define DMA_INLINK_DSCR_ADDR_CH3 0x0003FFFF
#define DMA_INLINK_DSCR_ADDR_CH3_M ((DMA_INLINK_DSCR_ADDR_CH3_V) << (DMA_INLINK_DSCR_ADDR_CH3_S))
#define DMA_INLINK_DSCR_ADDR_CH3_V 0x3FFFF
#define DMA_INLINK_DSCR_ADDR_CH3_S 0

#define DMA_IN_STATE_CH4_REG (DR_REG_DMA_BASE + 0x104)
/* DMA_IN_STATE_CH4 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_IN_STATE_CH4 0x00000007
#define DMA_IN_STATE_CH4_M ((DMA_IN_STATE_CH4_V) << (DMA_IN_STATE_CH4_S))
#define DMA_IN_STATE_CH4_V 0x7
#define DMA_IN_STATE_CH4_S 20
/* DMA_IN_DSCR_STATE_CH4 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_IN_DSCR_STATE_CH4 0x00000003
#define DMA_IN_DSCR_STATE_CH4_M ((DMA_IN_DSCR_STATE_CH4_V) << (DMA_IN_DSCR_STATE_CH4_S))
#define DMA_IN_DSCR_STATE_CH4_V 0x3
#define DMA_IN_DSCR_STATE_CH4_S 18
/* DMA_INLINK_DSCR_ADDR_CH4 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current inlink descriptor's address.*/
#define DMA_INLINK_DSCR_ADDR_CH4 0x0003FFFF
#define DMA_INLINK_DSCR_ADDR_CH4_M ((DMA_INLINK_DSCR_ADDR_CH4_V) << (DMA_INLINK_DSCR_ADDR_CH4_S))
#define DMA_INLINK_DSCR_ADDR_CH4_V 0x3FFFF
#define DMA_INLINK_DSCR_ADDR_CH4_S 0

#define DMA_OUT_STATE_CH0_REG (DR_REG_DMA_BASE + 0x108)
/* DMA_OUT_STATE_CH0 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_OUT_STATE_CH0 0x00000007
#define DMA_OUT_STATE_CH0_M ((DMA_OUT_STATE_CH0_V) << (DMA_OUT_STATE_CH0_S))
#define DMA_OUT_STATE_CH0_V 0x7
#define DMA_OUT_STATE_CH0_S 20
/* DMA_OUT_DSCR_STATE_CH0 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_OUT_DSCR_STATE_CH0 0x00000003
#define DMA_OUT_DSCR_STATE_CH0_M ((DMA_OUT_DSCR_STATE_CH0_V) << (DMA_OUT_DSCR_STATE_CH0_S))
#define DMA_OUT_DSCR_STATE_CH0_V 0x3
#define DMA_OUT_DSCR_STATE_CH0_S 18
/* DMA_OUTLINK_DSCR_ADDR_CH0 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current outlink descriptor's address.*/
#define DMA_OUTLINK_DSCR_ADDR_CH0 0x0003FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH0_M ((DMA_OUTLINK_DSCR_ADDR_CH0_V) << (DMA_OUTLINK_DSCR_ADDR_CH0_S))
#define DMA_OUTLINK_DSCR_ADDR_CH0_V 0x3FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH0_S 0

#define DMA_OUT_STATE_CH1_REG (DR_REG_DMA_BASE + 0x10C)
/* DMA_OUT_STATE_CH1 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_OUT_STATE_CH1 0x00000007
#define DMA_OUT_STATE_CH1_M ((DMA_OUT_STATE_CH1_V) << (DMA_OUT_STATE_CH1_S))
#define DMA_OUT_STATE_CH1_V 0x7
#define DMA_OUT_STATE_CH1_S 20
/* DMA_OUT_DSCR_STATE_CH1 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_OUT_DSCR_STATE_CH1 0x00000003
#define DMA_OUT_DSCR_STATE_CH1_M ((DMA_OUT_DSCR_STATE_CH1_V) << (DMA_OUT_DSCR_STATE_CH1_S))
#define DMA_OUT_DSCR_STATE_CH1_V 0x3
#define DMA_OUT_DSCR_STATE_CH1_S 18
/* DMA_OUTLINK_DSCR_ADDR_CH1 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current outlink descriptor's address.*/
#define DMA_OUTLINK_DSCR_ADDR_CH1 0x0003FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH1_M ((DMA_OUTLINK_DSCR_ADDR_CH1_V) << (DMA_OUTLINK_DSCR_ADDR_CH1_S))
#define DMA_OUTLINK_DSCR_ADDR_CH1_V 0x3FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH1_S 0

#define DMA_OUT_STATE_CH2_REG (DR_REG_DMA_BASE + 0x110)
/* DMA_OUT_STATE_CH2 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_OUT_STATE_CH2 0x00000007
#define DMA_OUT_STATE_CH2_M ((DMA_OUT_STATE_CH2_V) << (DMA_OUT_STATE_CH2_S))
#define DMA_OUT_STATE_CH2_V 0x7
#define DMA_OUT_STATE_CH2_S 20
/* DMA_OUT_DSCR_STATE_CH2 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_OUT_DSCR_STATE_CH2 0x00000003
#define DMA_OUT_DSCR_STATE_CH2_M ((DMA_OUT_DSCR_STATE_CH2_V) << (DMA_OUT_DSCR_STATE_CH2_S))
#define DMA_OUT_DSCR_STATE_CH2_V 0x3
#define DMA_OUT_DSCR_STATE_CH2_S 18
/* DMA_OUTLINK_DSCR_ADDR_CH2 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current outlink descriptor's address.*/
#define DMA_OUTLINK_DSCR_ADDR_CH2 0x0003FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH2_M ((DMA_OUTLINK_DSCR_ADDR_CH2_V) << (DMA_OUTLINK_DSCR_ADDR_CH2_S))
#define DMA_OUTLINK_DSCR_ADDR_CH2_V 0x3FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH2_S 0

#define DMA_OUT_STATE_CH3_REG (DR_REG_DMA_BASE + 0x114)
/* DMA_OUT_STATE_CH3 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_OUT_STATE_CH3 0x00000007
#define DMA_OUT_STATE_CH3_M ((DMA_OUT_STATE_CH3_V) << (DMA_OUT_STATE_CH3_S))
#define DMA_OUT_STATE_CH3_V 0x7
#define DMA_OUT_STATE_CH3_S 20
/* DMA_OUT_DSCR_STATE_CH3 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_OUT_DSCR_STATE_CH3 0x00000003
#define DMA_OUT_DSCR_STATE_CH3_M ((DMA_OUT_DSCR_STATE_CH3_V) << (DMA_OUT_DSCR_STATE_CH3_S))
#define DMA_OUT_DSCR_STATE_CH3_V 0x3
#define DMA_OUT_DSCR_STATE_CH3_S 18
/* DMA_OUTLINK_DSCR_ADDR_CH3 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current outlink descriptor's address.*/
#define DMA_OUTLINK_DSCR_ADDR_CH3 0x0003FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH3_M ((DMA_OUTLINK_DSCR_ADDR_CH3_V) << (DMA_OUTLINK_DSCR_ADDR_CH3_S))
#define DMA_OUTLINK_DSCR_ADDR_CH3_V 0x3FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH3_S 0

#define DMA_OUT_STATE_CH4_REG (DR_REG_DMA_BASE + 0x118)
/* DMA_OUT_STATE_CH4 : RO ;bitpos:[22:20] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_OUT_STATE_CH4 0x00000007
#define DMA_OUT_STATE_CH4_M ((DMA_OUT_STATE_CH4_V) << (DMA_OUT_STATE_CH4_S))
#define DMA_OUT_STATE_CH4_V 0x7
#define DMA_OUT_STATE_CH4_S 20
/* DMA_OUT_DSCR_STATE_CH4 : RO ;bitpos:[19:18] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_OUT_DSCR_STATE_CH4 0x00000003
#define DMA_OUT_DSCR_STATE_CH4_M ((DMA_OUT_DSCR_STATE_CH4_V) << (DMA_OUT_DSCR_STATE_CH4_S))
#define DMA_OUT_DSCR_STATE_CH4_V 0x3
#define DMA_OUT_DSCR_STATE_CH4_S 18
/* DMA_OUTLINK_DSCR_ADDR_CH4 : RO ;bitpos:[17:0] ;default: 18'b0 ; */
/*description: This register stores the current outlink descriptor's address.*/
#define DMA_OUTLINK_DSCR_ADDR_CH4 0x0003FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH4_M ((DMA_OUTLINK_DSCR_ADDR_CH4_V) << (DMA_OUTLINK_DSCR_ADDR_CH4_S))
#define DMA_OUTLINK_DSCR_ADDR_CH4_V 0x3FFFF
#define DMA_OUTLINK_DSCR_ADDR_CH4_S 0

#define DMA_OUT_EOF_DES_ADDR_CH0_REG (DR_REG_DMA_BASE + 0x11C)
/* DMA_OUT_EOF_DES_ADDR_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_OUT_EOF_DES_ADDR_CH0 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH0_M ((DMA_OUT_EOF_DES_ADDR_CH0_V) << (DMA_OUT_EOF_DES_ADDR_CH0_S))
#define DMA_OUT_EOF_DES_ADDR_CH0_V 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH0_S 0

#define DMA_OUT_EOF_DES_ADDR_CH1_REG (DR_REG_DMA_BASE + 0x120)
/* DMA_OUT_EOF_DES_ADDR_CH1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_OUT_EOF_DES_ADDR_CH1 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH1_M ((DMA_OUT_EOF_DES_ADDR_CH1_V) << (DMA_OUT_EOF_DES_ADDR_CH1_S))
#define DMA_OUT_EOF_DES_ADDR_CH1_V 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH1_S 0

#define DMA_OUT_EOF_DES_ADDR_CH2_REG (DR_REG_DMA_BASE + 0x124)
/* DMA_OUT_EOF_DES_ADDR_CH2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_OUT_EOF_DES_ADDR_CH2 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH2_M ((DMA_OUT_EOF_DES_ADDR_CH2_V) << (DMA_OUT_EOF_DES_ADDR_CH2_S))
#define DMA_OUT_EOF_DES_ADDR_CH2_V 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH2_S 0

