espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_OUT_EOF_DES_ADDR_CH3_REG (DR_REG_DMA_BASE + 0x128)
/* DMA_OUT_EOF_DES_ADDR_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_OUT_EOF_DES_ADDR_CH3 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH3_M ((DMA_OUT_EOF_DES_ADDR_CH3_V) << (DMA_OUT_EOF_DES_ADDR_CH3_S))
#define DMA_OUT_EOF_DES_ADDR_CH3_V 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH3_S 0

#define DMA_OUT_EOF_DES_ADDR_CH4_REG (DR_REG_DMA_BASE + 0x12C)
/* DMA_OUT_EOF_DES_ADDR_CH4 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_OUT_EOF_DES_ADDR_CH4 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH4_M ((DMA_OUT_EOF_DES_ADDR_CH4_V) << (DMA_OUT_EOF_DES_ADDR_CH4_S))
#define DMA_OUT_EOF_DES_ADDR_CH4_V 0xFFFFFFFF
#define DMA_OUT_EOF_DES_ADDR_CH4_S 0

#define DMA_IN_SUC_EOF_DES_ADDR_CH0_REG (DR_REG_DMA_BASE + 0x130)
/* DMA_IN_SUC_EOF_DES_ADDR_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_IN_SUC_EOF_DES_ADDR_CH0 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH0_M ((DMA_IN_SUC_EOF_DES_ADDR_CH0_V) << (DMA_IN_SUC_EOF_DES_ADDR_CH0_S))
#define DMA_IN_SUC_EOF_DES_ADDR_CH0_V 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH0_S 0

#define DMA_IN_SUC_EOF_DES_ADDR_CH1_REG (DR_REG_DMA_BASE + 0x134)
/* DMA_IN_SUC_EOF_DES_ADDR_CH1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_IN_SUC_EOF_DES_ADDR_CH1 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH1_M ((DMA_IN_SUC_EOF_DES_ADDR_CH1_V) << (DMA_IN_SUC_EOF_DES_ADDR_CH1_S))
#define DMA_IN_SUC_EOF_DES_ADDR_CH1_V 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH1_S 0

#define DMA_IN_SUC_EOF_DES_ADDR_CH2_REG (DR_REG_DMA_BASE + 0x138)
/* DMA_IN_SUC_EOF_DES_ADDR_CH2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_IN_SUC_EOF_DES_ADDR_CH2 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH2_M ((DMA_IN_SUC_EOF_DES_ADDR_CH2_V) << (DMA_IN_SUC_EOF_DES_ADDR_CH2_S))
#define DMA_IN_SUC_EOF_DES_ADDR_CH2_V 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH2_S 0

#define DMA_IN_SUC_EOF_DES_ADDR_CH3_REG (DR_REG_DMA_BASE + 0x13C)
/* DMA_IN_SUC_EOF_DES_ADDR_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_IN_SUC_EOF_DES_ADDR_CH3 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH3_M ((DMA_IN_SUC_EOF_DES_ADDR_CH3_V) << (DMA_IN_SUC_EOF_DES_ADDR_CH3_S))
#define DMA_IN_SUC_EOF_DES_ADDR_CH3_V 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH3_S 0

#define DMA_IN_SUC_EOF_DES_ADDR_CH4_REG (DR_REG_DMA_BASE + 0x140)
/* DMA_IN_SUC_EOF_DES_ADDR_CH4 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 the EOF bit in this descriptor is 1.*/
#define DMA_IN_SUC_EOF_DES_ADDR_CH4 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH4_M ((DMA_IN_SUC_EOF_DES_ADDR_CH4_V) << (DMA_IN_SUC_EOF_DES_ADDR_CH4_S))
#define DMA_IN_SUC_EOF_DES_ADDR_CH4_V 0xFFFFFFFF
#define DMA_IN_SUC_EOF_DES_ADDR_CH4_S 0

#define DMA_IN_ERR_EOF_DES_ADDR_CH0_REG (DR_REG_DMA_BASE + 0x144)
/* DMA_IN_ERR_EOF_DES_ADDR_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
#define DMA_IN_ERR_EOF_DES_ADDR_CH0 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH0_M ((DMA_IN_ERR_EOF_DES_ADDR_CH0_V) << (DMA_IN_ERR_EOF_DES_ADDR_CH0_S))
#define DMA_IN_ERR_EOF_DES_ADDR_CH0_V 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH0_S 0

#define DMA_IN_ERR_EOF_DES_ADDR_CH1_REG (DR_REG_DMA_BASE + 0x148)
/* DMA_IN_ERR_EOF_DES_ADDR_CH1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
#define DMA_IN_ERR_EOF_DES_ADDR_CH1 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH1_M ((DMA_IN_ERR_EOF_DES_ADDR_CH1_V) << (DMA_IN_ERR_EOF_DES_ADDR_CH1_S))
#define DMA_IN_ERR_EOF_DES_ADDR_CH1_V 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH1_S 0

#define DMA_IN_ERR_EOF_DES_ADDR_CH2_REG (DR_REG_DMA_BASE + 0x14C)
/* DMA_IN_ERR_EOF_DES_ADDR_CH2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
#define DMA_IN_ERR_EOF_DES_ADDR_CH2 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH2_M ((DMA_IN_ERR_EOF_DES_ADDR_CH2_V) << (DMA_IN_ERR_EOF_DES_ADDR_CH2_S))
#define DMA_IN_ERR_EOF_DES_ADDR_CH2_V 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH2_S 0

#define DMA_IN_ERR_EOF_DES_ADDR_CH3_REG (DR_REG_DMA_BASE + 0x150)
/* DMA_IN_ERR_EOF_DES_ADDR_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
#define DMA_IN_ERR_EOF_DES_ADDR_CH3 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH3_M ((DMA_IN_ERR_EOF_DES_ADDR_CH3_V) << (DMA_IN_ERR_EOF_DES_ADDR_CH3_S))
#define DMA_IN_ERR_EOF_DES_ADDR_CH3_V 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH3_S 0

#define DMA_IN_ERR_EOF_DES_ADDR_CH4_REG (DR_REG_DMA_BASE + 0x154)
/* DMA_IN_ERR_EOF_DES_ADDR_CH4 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the inlink descriptor when
 there are some errors in current receiving data. Only used when peripheral is UHCI0.*/
#define DMA_IN_ERR_EOF_DES_ADDR_CH4 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH4_M ((DMA_IN_ERR_EOF_DES_ADDR_CH4_V) << (DMA_IN_ERR_EOF_DES_ADDR_CH4_S))
#define DMA_IN_ERR_EOF_DES_ADDR_CH4_V 0xFFFFFFFF
#define DMA_IN_ERR_EOF_DES_ADDR_CH4_S 0

#define DMA_OUT_EOF_BFR_DES_ADDR_CH0_REG (DR_REG_DMA_BASE + 0x158)
/* DMA_OUT_EOF_BFR_DES_ADDR_CH0 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor before
 the last outlink descriptor.*/
#define DMA_OUT_EOF_BFR_DES_ADDR_CH0 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH0_M ((DMA_OUT_EOF_BFR_DES_ADDR_CH0_V) << (DMA_OUT_EOF_BFR_DES_ADDR_CH0_S))
#define DMA_OUT_EOF_BFR_DES_ADDR_CH0_V 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH0_S 0

#define DMA_OUT_EOF_BFR_DES_ADDR_CH1_REG (DR_REG_DMA_BASE + 0x15C)
/* DMA_OUT_EOF_BFR_DES_ADDR_CH1 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor before
 the last outlink descriptor.*/
#define DMA_OUT_EOF_BFR_DES_ADDR_CH1 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH1_M ((DMA_OUT_EOF_BFR_DES_ADDR_CH1_V) << (DMA_OUT_EOF_BFR_DES_ADDR_CH1_S))
#define DMA_OUT_EOF_BFR_DES_ADDR_CH1_V 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH1_S 0

#define DMA_OUT_EOF_BFR_DES_ADDR_CH2_REG (DR_REG_DMA_BASE + 0x160)
/* DMA_OUT_EOF_BFR_DES_ADDR_CH2 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor before
 the last outlink descriptor.*/
#define DMA_OUT_EOF_BFR_DES_ADDR_CH2 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH2_M ((DMA_OUT_EOF_BFR_DES_ADDR_CH2_V) << (DMA_OUT_EOF_BFR_DES_ADDR_CH2_S))
#define DMA_OUT_EOF_BFR_DES_ADDR_CH2_V 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH2_S 0

