espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_OUT_EOF_BFR_DES_ADDR_CH3_REG (DR_REG_DMA_BASE + 0x164)
/* DMA_OUT_EOF_BFR_DES_ADDR_CH3 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor before
 the last outlink descriptor.*/
#define DMA_OUT_EOF_BFR_DES_ADDR_CH3 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH3_M ((DMA_OUT_EOF_BFR_DES_ADDR_CH3_V) << (DMA_OUT_EOF_BFR_DES_ADDR_CH3_S))
#define DMA_OUT_EOF_BFR_DES_ADDR_CH3_V 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH3_S 0

#define DMA_OUT_EOF_BFR_DES_ADDR_CH4_REG (DR_REG_DMA_BASE + 0x168)
/* DMA_OUT_EOF_BFR_DES_ADDR_CH4 : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: This register stores the address of the outlink descriptor before
 the last outlink descriptor.*/
#define DMA_OUT_EOF_BFR_DES_ADDR_CH4 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH4_M ((DMA_OUT_EOF_BFR_DES_ADDR_CH4_V) << (DMA_OUT_EOF_BFR_DES_ADDR_CH4_S))
#define DMA_OUT_EOF_BFR_DES_ADDR_CH4_V 0xFFFFFFFF
#define DMA_OUT_EOF_BFR_DES_ADDR_CH4_S 0

#define DMA_AHB_TEST_REG (DR_REG_DMA_BASE + 0x16C)
/* DMA_AHB_TESTADDR : R/W ;bitpos:[5:4] ;default: 2'b0 ; */
/*description: reserved*/
#define DMA_AHB_TESTADDR 0x00000003
#define DMA_AHB_TESTADDR_M ((DMA_AHB_TESTADDR_V) << (DMA_AHB_TESTADDR_S))
#define DMA_AHB_TESTADDR_V 0x3
#define DMA_AHB_TESTADDR_S 4
/* DMA_AHB_TESTMODE : R/W ;bitpos:[2:0] ;default: 3'b0 ; */
/*description: reserved*/
#define DMA_AHB_TESTMODE 0x00000007
#define DMA_AHB_TESTMODE_M ((DMA_AHB_TESTMODE_V) << (DMA_AHB_TESTMODE_S))
#define DMA_AHB_TESTMODE_V 0x7
#define DMA_AHB_TESTMODE_S 0

#define DMA_IN_DSCR_CH0_REG (DR_REG_DMA_BASE + 0x170)
/* DMA_INLINK_DSCR_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current inlink descriptor x.*/
#define DMA_INLINK_DSCR_CH0 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH0_M ((DMA_INLINK_DSCR_CH0_V) << (DMA_INLINK_DSCR_CH0_S))
#define DMA_INLINK_DSCR_CH0_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH0_S 0

#define DMA_IN_DSCR_CH1_REG (DR_REG_DMA_BASE + 0x174)
/* DMA_INLINK_DSCR_CH1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current inlink descriptor x.*/
#define DMA_INLINK_DSCR_CH1 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH1_M ((DMA_INLINK_DSCR_CH1_V) << (DMA_INLINK_DSCR_CH1_S))
#define DMA_INLINK_DSCR_CH1_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH1_S 0

#define DMA_IN_DSCR_CH2_REG (DR_REG_DMA_BASE + 0x178)
/* DMA_INLINK_DSCR_CH2 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current inlink descriptor x.*/
#define DMA_INLINK_DSCR_CH2 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH2_M ((DMA_INLINK_DSCR_CH2_V) << (DMA_INLINK_DSCR_CH2_S))
#define DMA_INLINK_DSCR_CH2_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH2_S 0

#define DMA_IN_DSCR_CH3_REG (DR_REG_DMA_BASE + 0x17C)
/* DMA_INLINK_DSCR_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current inlink descriptor x.*/
#define DMA_INLINK_DSCR_CH3 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH3_M ((DMA_INLINK_DSCR_CH3_V) << (DMA_INLINK_DSCR_CH3_S))
#define DMA_INLINK_DSCR_CH3_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH3_S 0

#define DMA_IN_DSCR_CH4_REG (DR_REG_DMA_BASE + 0x180)
/* DMA_INLINK_DSCR_CH4 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current inlink descriptor x.*/
#define DMA_INLINK_DSCR_CH4 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH4_M ((DMA_INLINK_DSCR_CH4_V) << (DMA_INLINK_DSCR_CH4_S))
#define DMA_INLINK_DSCR_CH4_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_CH4_S 0

#define DMA_IN_DSCR_BF0_CH0_REG (DR_REG_DMA_BASE + 0x184)
/* DMA_INLINK_DSCR_BF0_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last inlink descriptor x-1.*/
#define DMA_INLINK_DSCR_BF0_CH0 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH0_M ((DMA_INLINK_DSCR_BF0_CH0_V) << (DMA_INLINK_DSCR_BF0_CH0_S))
#define DMA_INLINK_DSCR_BF0_CH0_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH0_S 0

#define DMA_IN_DSCR_BF0_CH1_REG (DR_REG_DMA_BASE + 0x188)
/* DMA_INLINK_DSCR_BF0_CH1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last inlink descriptor x-1.*/
#define DMA_INLINK_DSCR_BF0_CH1 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH1_M ((DMA_INLINK_DSCR_BF0_CH1_V) << (DMA_INLINK_DSCR_BF0_CH1_S))
#define DMA_INLINK_DSCR_BF0_CH1_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH1_S 0

#define DMA_IN_DSCR_BF0_CH2_REG (DR_REG_DMA_BASE + 0x18C)
/* DMA_INLINK_DSCR_BF0_CH2 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last inlink descriptor x-1.*/
#define DMA_INLINK_DSCR_BF0_CH2 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH2_M ((DMA_INLINK_DSCR_BF0_CH2_V) << (DMA_INLINK_DSCR_BF0_CH2_S))
#define DMA_INLINK_DSCR_BF0_CH2_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH2_S 0

#define DMA_IN_DSCR_BF0_CH3_REG (DR_REG_DMA_BASE + 0x190)
/* DMA_INLINK_DSCR_BF0_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last inlink descriptor x-1.*/
#define DMA_INLINK_DSCR_BF0_CH3 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH3_M ((DMA_INLINK_DSCR_BF0_CH3_V) << (DMA_INLINK_DSCR_BF0_CH3_S))
#define DMA_INLINK_DSCR_BF0_CH3_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH3_S 0

#define DMA_IN_DSCR_BF0_CH4_REG (DR_REG_DMA_BASE + 0x194)
/* DMA_INLINK_DSCR_BF0_CH4 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last inlink descriptor x-1.*/
#define DMA_INLINK_DSCR_BF0_CH4 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH4_M ((DMA_INLINK_DSCR_BF0_CH4_V) << (DMA_INLINK_DSCR_BF0_CH4_S))
#define DMA_INLINK_DSCR_BF0_CH4_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF0_CH4_S 0

#define DMA_IN_DSCR_BF1_CH0_REG (DR_REG_DMA_BASE + 0x198)
/* DMA_INLINK_DSCR_BF1_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_INLINK_DSCR_BF1_CH0 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH0_M ((DMA_INLINK_DSCR_BF1_CH0_V) << (DMA_INLINK_DSCR_BF1_CH0_S))
#define DMA_INLINK_DSCR_BF1_CH0_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH0_S 0

#define DMA_IN_DSCR_BF1_CH1_REG (DR_REG_DMA_BASE + 0x19C)
/* DMA_INLINK_DSCR_BF1_CH1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_INLINK_DSCR_BF1_CH1 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH1_M ((DMA_INLINK_DSCR_BF1_CH1_V) << (DMA_INLINK_DSCR_BF1_CH1_S))
#define DMA_INLINK_DSCR_BF1_CH1_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH1_S 0

#define DMA_IN_DSCR_BF1_CH2_REG (DR_REG_DMA_BASE + 0x1A0)
/* DMA_INLINK_DSCR_BF1_CH2 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_INLINK_DSCR_BF1_CH2 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH2_M ((DMA_INLINK_DSCR_BF1_CH2_V) << (DMA_INLINK_DSCR_BF1_CH2_S))
#define DMA_INLINK_DSCR_BF1_CH2_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH2_S 0

#define DMA_IN_DSCR_BF1_CH3_REG (DR_REG_DMA_BASE + 0x1A4)
/* DMA_INLINK_DSCR_BF1_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_INLINK_DSCR_BF1_CH3 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH3_M ((DMA_INLINK_DSCR_BF1_CH3_V) << (DMA_INLINK_DSCR_BF1_CH3_S))
#define DMA_INLINK_DSCR_BF1_CH3_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH3_S 0

