espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_IN_DSCR_BF1_CH4_REG (DR_REG_DMA_BASE + 0x1A8)
/* DMA_INLINK_DSCR_BF1_CH4 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_INLINK_DSCR_BF1_CH4 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH4_M ((DMA_INLINK_DSCR_BF1_CH4_V) << (DMA_INLINK_DSCR_BF1_CH4_S))
#define DMA_INLINK_DSCR_BF1_CH4_V 0xFFFFFFFF
#define DMA_INLINK_DSCR_BF1_CH4_S 0

#define DMA_OUT_DSCR_CH0_REG (DR_REG_DMA_BASE + 0x1AC)
/* DMA_OUTLINK_DSCR_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current outlink descriptor y.*/
#define DMA_OUTLINK_DSCR_CH0 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH0_M ((DMA_OUTLINK_DSCR_CH0_V) << (DMA_OUTLINK_DSCR_CH0_S))
#define DMA_OUTLINK_DSCR_CH0_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH0_S 0

#define DMA_OUT_DSCR_CH1_REG (DR_REG_DMA_BASE + 0x1B0)
/* DMA_OUTLINK_DSCR_CH1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current outlink descriptor y.*/
#define DMA_OUTLINK_DSCR_CH1 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH1_M ((DMA_OUTLINK_DSCR_CH1_V) << (DMA_OUTLINK_DSCR_CH1_S))
#define DMA_OUTLINK_DSCR_CH1_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH1_S 0

#define DMA_OUT_DSCR_CH2_REG (DR_REG_DMA_BASE + 0x1B4)
/* DMA_OUTLINK_DSCR_CH2 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current outlink descriptor y.*/
#define DMA_OUTLINK_DSCR_CH2 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH2_M ((DMA_OUTLINK_DSCR_CH2_V) << (DMA_OUTLINK_DSCR_CH2_S))
#define DMA_OUTLINK_DSCR_CH2_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH2_S 0

#define DMA_OUT_DSCR_CH3_REG (DR_REG_DMA_BASE + 0x1B8)
/* DMA_OUTLINK_DSCR_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current outlink descriptor y.*/
#define DMA_OUTLINK_DSCR_CH3 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH3_M ((DMA_OUTLINK_DSCR_CH3_V) << (DMA_OUTLINK_DSCR_CH3_S))
#define DMA_OUTLINK_DSCR_CH3_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH3_S 0

#define DMA_OUT_DSCR_CH4_REG (DR_REG_DMA_BASE + 0x1BC)
/* DMA_OUTLINK_DSCR_CH4 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the current outlink descriptor y.*/
#define DMA_OUTLINK_DSCR_CH4 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH4_M ((DMA_OUTLINK_DSCR_CH4_V) << (DMA_OUTLINK_DSCR_CH4_S))
#define DMA_OUTLINK_DSCR_CH4_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_CH4_S 0

#define DMA_OUT_DSCR_BF0_CH0_REG (DR_REG_DMA_BASE + 0x1C0)
/* DMA_OUTLINK_DSCR_BF0_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last outlink descriptor y-1.*/
#define DMA_OUTLINK_DSCR_BF0_CH0 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH0_M ((DMA_OUTLINK_DSCR_BF0_CH0_V) << (DMA_OUTLINK_DSCR_BF0_CH0_S))
#define DMA_OUTLINK_DSCR_BF0_CH0_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH0_S 0

#define DMA_OUT_DSCR_BF0_CH1_REG (DR_REG_DMA_BASE + 0x1C4)
/* DMA_OUTLINK_DSCR_BF0_CH1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last outlink descriptor y-1.*/
#define DMA_OUTLINK_DSCR_BF0_CH1 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH1_M ((DMA_OUTLINK_DSCR_BF0_CH1_V) << (DMA_OUTLINK_DSCR_BF0_CH1_S))
#define DMA_OUTLINK_DSCR_BF0_CH1_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH1_S 0

#define DMA_OUT_DSCR_BF0_CH2_REG (DR_REG_DMA_BASE + 0x1C8)
/* DMA_OUTLINK_DSCR_BF0_CH2 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last outlink descriptor y-1.*/
#define DMA_OUTLINK_DSCR_BF0_CH2 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH2_M ((DMA_OUTLINK_DSCR_BF0_CH2_V) << (DMA_OUTLINK_DSCR_BF0_CH2_S))
#define DMA_OUTLINK_DSCR_BF0_CH2_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH2_S 0

#define DMA_OUT_DSCR_BF0_CH3_REG (DR_REG_DMA_BASE + 0x1CC)
/* DMA_OUTLINK_DSCR_BF0_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last outlink descriptor y-1.*/
#define DMA_OUTLINK_DSCR_BF0_CH3 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH3_M ((DMA_OUTLINK_DSCR_BF0_CH3_V) << (DMA_OUTLINK_DSCR_BF0_CH3_S))
#define DMA_OUTLINK_DSCR_BF0_CH3_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH3_S 0

#define DMA_OUT_DSCR_BF0_CH4_REG (DR_REG_DMA_BASE + 0x1D0)
/* DMA_OUTLINK_DSCR_BF0_CH4 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the last outlink descriptor y-1.*/
#define DMA_OUTLINK_DSCR_BF0_CH4 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH4_M ((DMA_OUTLINK_DSCR_BF0_CH4_V) << (DMA_OUTLINK_DSCR_BF0_CH4_S))
#define DMA_OUTLINK_DSCR_BF0_CH4_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF0_CH4_S 0

#define DMA_OUT_DSCR_BF1_CH0_REG (DR_REG_DMA_BASE + 0x1D4)
/* DMA_OUTLINK_DSCR_BF1_CH0 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_OUTLINK_DSCR_BF1_CH0 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH0_M ((DMA_OUTLINK_DSCR_BF1_CH0_V) << (DMA_OUTLINK_DSCR_BF1_CH0_S))
#define DMA_OUTLINK_DSCR_BF1_CH0_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH0_S 0

#define DMA_OUT_DSCR_BF1_CH1_REG (DR_REG_DMA_BASE + 0x1D8)
/* DMA_OUTLINK_DSCR_BF1_CH1 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_OUTLINK_DSCR_BF1_CH1 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH1_M ((DMA_OUTLINK_DSCR_BF1_CH1_V) << (DMA_OUTLINK_DSCR_BF1_CH1_S))
#define DMA_OUTLINK_DSCR_BF1_CH1_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH1_S 0

#define DMA_OUT_DSCR_BF1_CH2_REG (DR_REG_DMA_BASE + 0x1DC)
/* DMA_OUTLINK_DSCR_BF1_CH2 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_OUTLINK_DSCR_BF1_CH2 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH2_M ((DMA_OUTLINK_DSCR_BF1_CH2_V) << (DMA_OUTLINK_DSCR_BF1_CH2_S))
#define DMA_OUTLINK_DSCR_BF1_CH2_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH2_S 0

#define DMA_OUT_DSCR_BF1_CH3_REG (DR_REG_DMA_BASE + 0x1E0)
/* DMA_OUTLINK_DSCR_BF1_CH3 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_OUTLINK_DSCR_BF1_CH3 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH3_M ((DMA_OUTLINK_DSCR_BF1_CH3_V) << (DMA_OUTLINK_DSCR_BF1_CH3_S))
#define DMA_OUTLINK_DSCR_BF1_CH3_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH3_S 0

#define DMA_OUT_DSCR_BF1_CH4_REG (DR_REG_DMA_BASE + 0x1E4)
/* DMA_OUTLINK_DSCR_BF1_CH4 : RO ;bitpos:[31:0] ;default: 32'b0 ; */
/*description: The address of the second-to-last inlink descriptor x-2.*/
#define DMA_OUTLINK_DSCR_BF1_CH4 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH4_M ((DMA_OUTLINK_DSCR_BF1_CH4_V) << (DMA_OUTLINK_DSCR_BF1_CH4_S))
#define DMA_OUTLINK_DSCR_BF1_CH4_V 0xFFFFFFFF
#define DMA_OUTLINK_DSCR_BF1_CH4_S 0

#define DMA_PD_CONF_REG (DR_REG_DMA_BASE + 0x1E8)
/* DMA_RAM_CLK_FO : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: 1: Force to open the clock and bypass the gate-clock when accessing
 the RAM in DMA. 0: A gate-clock will be used when accessing the RAM in DMA.*/
#define DMA_RAM_CLK_FO (BIT(6))
#define DMA_RAM_CLK_FO_M (BIT(6))
#define DMA_RAM_CLK_FO_V 0x1
#define DMA_RAM_CLK_FO_S 6
/* DMA_RAM_FORCE_PU : R/W ;bitpos:[5] ;default: 1'b1 ; */
/*description: */
#define DMA_RAM_FORCE_PU (BIT(5))
#define DMA_RAM_FORCE_PU_M (BIT(5))
#define DMA_RAM_FORCE_PU_V 0x1
#define DMA_RAM_FORCE_PU_S 5
/* DMA_RAM_FORCE_PD : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: power down*/
#define DMA_RAM_FORCE_PD (BIT(4))
#define DMA_RAM_FORCE_PD_M (BIT(4))
#define DMA_RAM_FORCE_PD_V 0x1
#define DMA_RAM_FORCE_PD_S 4

#define DMA_WIGHT_CH0_REG (DR_REG_DMA_BASE + 0x1EC)
/* DMA_RX_WEIGHT_CH0 : R/W ;bitpos:[7:4] ;default: 4'hF ; */
/*description: The weight of Rx channel 0.*/
#define DMA_RX_WEIGHT_CH0 0x0000000F
#define DMA_RX_WEIGHT_CH0_M ((DMA_RX_WEIGHT_CH0_V) << (DMA_RX_WEIGHT_CH0_S))
#define DMA_RX_WEIGHT_CH0_V 0xF
#define DMA_RX_WEIGHT_CH0_S 4
/* DMA_TX_WEIGHT_CH0 : R/W ;bitpos:[3:0] ;default: 4'hF ; */
/*description: The weight of Tx channel 0.*/
#define DMA_TX_WEIGHT_CH0 0x0000000F
#define DMA_TX_WEIGHT_CH0_M ((DMA_TX_WEIGHT_CH0_V) << (DMA_TX_WEIGHT_CH0_S))
#define DMA_TX_WEIGHT_CH0_V 0xF
#define DMA_TX_WEIGHT_CH0_S 0

#define DMA_WIGHT_CH1_REG (DR_REG_DMA_BASE + 0x1F0)
/* DMA_RX_WEIGHT_CH1 : R/W ;bitpos:[7:4] ;default: 4'hF ; */
/*description: The weight of Rx channel 1.*/
#define DMA_RX_WEIGHT_CH1 0x0000000F
#define DMA_RX_WEIGHT_CH1_M ((DMA_RX_WEIGHT_CH1_V) << (DMA_RX_WEIGHT_CH1_S))
#define DMA_RX_WEIGHT_CH1_V 0xF
#define DMA_RX_WEIGHT_CH1_S 4
/* DMA_TX_WEIGHT_CH1 : R/W ;bitpos:[3:0] ;default: 4'hF ; */
/*description: The weight of Tx channel 1.*/
#define DMA_TX_WEIGHT_CH1 0x0000000F
#define DMA_TX_WEIGHT_CH1_M ((DMA_TX_WEIGHT_CH1_V) << (DMA_TX_WEIGHT_CH1_S))
#define DMA_TX_WEIGHT_CH1_V 0xF
#define DMA_TX_WEIGHT_CH1_S 0

#define DMA_WIGHT_CH2_REG (DR_REG_DMA_BASE + 0x1F4)
/* DMA_RX_WEIGHT_CH2 : R/W ;bitpos:[7:4] ;default: 4'hF ; */
/*description: The weight of Rx channel 2.*/
#define DMA_RX_WEIGHT_CH2 0x0000000F
#define DMA_RX_WEIGHT_CH2_M ((DMA_RX_WEIGHT_CH2_V) << (DMA_RX_WEIGHT_CH2_S))
#define DMA_RX_WEIGHT_CH2_V 0xF
#define DMA_RX_WEIGHT_CH2_S 4
/* DMA_TX_WEIGHT_CH2 : R/W ;bitpos:[3:0] ;default: 4'hF ; */
/*description: The weight of Tx channel 2.*/
#define DMA_TX_WEIGHT_CH2 0x0000000F
#define DMA_TX_WEIGHT_CH2_M ((DMA_TX_WEIGHT_CH2_V) << (DMA_TX_WEIGHT_CH2_S))
#define DMA_TX_WEIGHT_CH2_V 0xF
#define DMA_TX_WEIGHT_CH2_S 0

