espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_WIGHT_CH3_REG (DR_REG_DMA_BASE + 0x1F8)
/* DMA_RX_WEIGHT_CH3 : R/W ;bitpos:[7:4] ;default: 4'hF ; */
/*description: The weight of Rx channel 3.*/
#define DMA_RX_WEIGHT_CH3 0x0000000F
#define DMA_RX_WEIGHT_CH3_M ((DMA_RX_WEIGHT_CH3_V) << (DMA_RX_WEIGHT_CH3_S))
#define DMA_RX_WEIGHT_CH3_V 0xF
#define DMA_RX_WEIGHT_CH3_S 4
/* DMA_TX_WEIGHT_CH3 : R/W ;bitpos:[3:0] ;default: 4'hF ; */
/*description: The weight of Tx channel 3.*/
#define DMA_TX_WEIGHT_CH3 0x0000000F
#define DMA_TX_WEIGHT_CH3_M ((DMA_TX_WEIGHT_CH3_V) << (DMA_TX_WEIGHT_CH3_S))
#define DMA_TX_WEIGHT_CH3_V 0xF
#define DMA_TX_WEIGHT_CH3_S 0

#define DMA_WIGHT_CH4_REG (DR_REG_DMA_BASE + 0x1FC)
/* DMA_RX_WEIGHT_CH4 : R/W ;bitpos:[7:4] ;default: 4'hF ; */
/*description: The weight of Rx channel 4.*/
#define DMA_RX_WEIGHT_CH4 0x0000000F
#define DMA_RX_WEIGHT_CH4_M ((DMA_RX_WEIGHT_CH4_V) << (DMA_RX_WEIGHT_CH4_S))
#define DMA_RX_WEIGHT_CH4_V 0xF
#define DMA_RX_WEIGHT_CH4_S 4
/* DMA_TX_WEIGHT_CH4 : R/W ;bitpos:[3:0] ;default: 4'hF ; */
/*description: The weight of Tx channel 4.*/
#define DMA_TX_WEIGHT_CH4 0x0000000F
#define DMA_TX_WEIGHT_CH4_M ((DMA_TX_WEIGHT_CH4_V) << (DMA_TX_WEIGHT_CH4_S))
#define DMA_TX_WEIGHT_CH4_V 0xF
#define DMA_TX_WEIGHT_CH4_S 0

#define DMA_PRI_CH0_REG (DR_REG_DMA_BASE + 0x200)
/* DMA_RX_PRI_CH0 : R/W ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: The priority of Rx channel 0. The larger of the value  the higher
 of the priority.*/
#define DMA_RX_PRI_CH0 0x0000000F
#define DMA_RX_PRI_CH0_M ((DMA_RX_PRI_CH0_V) << (DMA_RX_PRI_CH0_S))
#define DMA_RX_PRI_CH0_V 0xF
#define DMA_RX_PRI_CH0_S 4
/* DMA_TX_PRI_CH0 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Tx channel 0. The larger of the value  the higher
 of the priority.*/
#define DMA_TX_PRI_CH0 0x0000000F
#define DMA_TX_PRI_CH0_M ((DMA_TX_PRI_CH0_V) << (DMA_TX_PRI_CH0_S))
#define DMA_TX_PRI_CH0_V 0xF
#define DMA_TX_PRI_CH0_S 0

#define DMA_PRI_CH1_REG (DR_REG_DMA_BASE + 0x204)
/* DMA_RX_PRI_CH1 : R/W ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: The priority of Rx channel 1. The larger of the value  the higher
 of the priority.*/
#define DMA_RX_PRI_CH1 0x0000000F
#define DMA_RX_PRI_CH1_M ((DMA_RX_PRI_CH1_V) << (DMA_RX_PRI_CH1_S))
#define DMA_RX_PRI_CH1_V 0xF
#define DMA_RX_PRI_CH1_S 4
/* DMA_TX_PRI_CH1 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Tx channel 1. The larger of the value  the higher
 of the priority.*/
#define DMA_TX_PRI_CH1 0x0000000F
#define DMA_TX_PRI_CH1_M ((DMA_TX_PRI_CH1_V) << (DMA_TX_PRI_CH1_S))
#define DMA_TX_PRI_CH1_V 0xF
#define DMA_TX_PRI_CH1_S 0

#define DMA_PRI_CH2_REG (DR_REG_DMA_BASE + 0x208)
/* DMA_RX_PRI_CH2 : R/W ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: The priority of Rx channel 2. The larger of the value  the higher
 of the priority.*/
#define DMA_RX_PRI_CH2 0x0000000F
#define DMA_RX_PRI_CH2_M ((DMA_RX_PRI_CH2_V) << (DMA_RX_PRI_CH2_S))
#define DMA_RX_PRI_CH2_V 0xF
#define DMA_RX_PRI_CH2_S 4
/* DMA_TX_PRI_CH2 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Tx channel 2. The larger of the value  the higher
 of the priority.*/
#define DMA_TX_PRI_CH2 0x0000000F
#define DMA_TX_PRI_CH2_M ((DMA_TX_PRI_CH2_V) << (DMA_TX_PRI_CH2_S))
#define DMA_TX_PRI_CH2_V 0xF
#define DMA_TX_PRI_CH2_S 0

#define DMA_PRI_CH3_REG (DR_REG_DMA_BASE + 0x20C)
/* DMA_RX_PRI_CH3 : R/W ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: The priority of Rx channel 3. The larger of the value  the higher
 of the priority.*/
#define DMA_RX_PRI_CH3 0x0000000F
#define DMA_RX_PRI_CH3_M ((DMA_RX_PRI_CH3_V) << (DMA_RX_PRI_CH3_S))
#define DMA_RX_PRI_CH3_V 0xF
#define DMA_RX_PRI_CH3_S 4
/* DMA_TX_PRI_CH3 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Tx channel 3. The larger of the value  the higher
 of the priority.*/
#define DMA_TX_PRI_CH3 0x0000000F
#define DMA_TX_PRI_CH3_M ((DMA_TX_PRI_CH3_V) << (DMA_TX_PRI_CH3_S))
#define DMA_TX_PRI_CH3_V 0xF
#define DMA_TX_PRI_CH3_S 0

#define DMA_PRI_CH4_REG (DR_REG_DMA_BASE + 0x210)
/* DMA_RX_PRI_CH4 : R/W ;bitpos:[7:4] ;default: 4'b0 ; */
/*description: The priority of Rx channel 4. The larger of the value  the higher
 of the priority.*/
#define DMA_RX_PRI_CH4 0x0000000F
#define DMA_RX_PRI_CH4_M ((DMA_RX_PRI_CH4_V) << (DMA_RX_PRI_CH4_S))
#define DMA_RX_PRI_CH4_V 0xF
#define DMA_RX_PRI_CH4_S 4
/* DMA_TX_PRI_CH4 : R/W ;bitpos:[3:0] ;default: 4'b0 ; */
/*description: The priority of Tx channel 4. The larger of the value  the higher
 of the priority.*/
#define DMA_TX_PRI_CH4 0x0000000F
#define DMA_TX_PRI_CH4_M ((DMA_TX_PRI_CH4_V) << (DMA_TX_PRI_CH4_S))
#define DMA_TX_PRI_CH4_V 0xF
#define DMA_TX_PRI_CH4_S 0

#define DMA_MISC_CONF_REG (DR_REG_DMA_BASE + 0x214)
/* DMA_CLK_EN : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: */
#define DMA_CLK_EN (BIT(3))
#define DMA_CLK_EN_M (BIT(3))
#define DMA_CLK_EN_V 0x1
#define DMA_CLK_EN_S 3
/* DMA_ARB_PRI_DIS : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: Set this bit to disable priority arbitration function.*/
#define DMA_ARB_PRI_DIS (BIT(2))
#define DMA_ARB_PRI_DIS_M (BIT(2))
#define DMA_ARB_PRI_DIS_V 0x1
#define DMA_ARB_PRI_DIS_S 2
/* DMA_AHBM_RST_EXTER : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: Set this bit  then clear this bit to reset the external ahb FSM.*/
#define DMA_AHBM_RST_EXTER (BIT(1))
#define DMA_AHBM_RST_EXTER_M (BIT(1))
#define DMA_AHBM_RST_EXTER_V 0x1
#define DMA_AHBM_RST_EXTER_S 1
/* DMA_AHBM_RST_INTER : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: Set this bit  then clear this bit to reset the internal ahb FSM.*/
#define DMA_AHBM_RST_INTER (BIT(0))
#define DMA_AHBM_RST_INTER_M (BIT(0))
#define DMA_AHBM_RST_INTER_V 0x1
#define DMA_AHBM_RST_INTER_S 0

#define DMA_PERI_SEL_CH0_REG (DR_REG_DMA_BASE + 0x218)
/* DMA_PERI_OUT_SEL_CH0 : R/W ;bitpos:[11:6] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Tx channel 0. 0:SPI2*/
#define DMA_PERI_OUT_SEL_CH0 0x0000003F
#define DMA_PERI_OUT_SEL_CH0_M ((DMA_PERI_OUT_SEL_CH0_V) << (DMA_PERI_OUT_SEL_CH0_S))
#define DMA_PERI_OUT_SEL_CH0_V 0x3F
#define DMA_PERI_OUT_SEL_CH0_S 6
/* DMA_PERI_IN_SEL_CH0 : R/W ;bitpos:[5:0] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Rx channel 0. 0:SPI2*/
#define DMA_PERI_IN_SEL_CH0 0x0000003F
#define DMA_PERI_IN_SEL_CH0_M ((DMA_PERI_IN_SEL_CH0_V) << (DMA_PERI_IN_SEL_CH0_S))
#define DMA_PERI_IN_SEL_CH0_V 0x3F
#define DMA_PERI_IN_SEL_CH0_S 0

#define DMA_PERI_SEL_CH1_REG (DR_REG_DMA_BASE + 0x21C)
/* DMA_PERI_OUT_SEL_CH1 : R/W ;bitpos:[11:6] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Tx channel 1. 0:SPI2*/
#define DMA_PERI_OUT_SEL_CH1 0x0000003F
#define DMA_PERI_OUT_SEL_CH1_M ((DMA_PERI_OUT_SEL_CH1_V) << (DMA_PERI_OUT_SEL_CH1_S))
#define DMA_PERI_OUT_SEL_CH1_V 0x3F
#define DMA_PERI_OUT_SEL_CH1_S 6
/* DMA_PERI_IN_SEL_CH1 : R/W ;bitpos:[5:0] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Rx channel 1. 0:SPI2*/
#define DMA_PERI_IN_SEL_CH1 0x0000003F
#define DMA_PERI_IN_SEL_CH1_M ((DMA_PERI_IN_SEL_CH1_V) << (DMA_PERI_IN_SEL_CH1_S))
#define DMA_PERI_IN_SEL_CH1_V 0x3F
#define DMA_PERI_IN_SEL_CH1_S 0

#define DMA_PERI_SEL_CH2_REG (DR_REG_DMA_BASE + 0x220)
/* DMA_PERI_OUT_SEL_CH2 : R/W ;bitpos:[11:6] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Tx channel 2. 0:SPI2*/
#define DMA_PERI_OUT_SEL_CH2 0x0000003F
#define DMA_PERI_OUT_SEL_CH2_M ((DMA_PERI_OUT_SEL_CH2_V) << (DMA_PERI_OUT_SEL_CH2_S))
#define DMA_PERI_OUT_SEL_CH2_V 0x3F
#define DMA_PERI_OUT_SEL_CH2_S 6
/* DMA_PERI_IN_SEL_CH2 : R/W ;bitpos:[5:0] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Rx channel 2. 0:SPI2*/
#define DMA_PERI_IN_SEL_CH2 0x0000003F
#define DMA_PERI_IN_SEL_CH2_M ((DMA_PERI_IN_SEL_CH2_V) << (DMA_PERI_IN_SEL_CH2_S))
#define DMA_PERI_IN_SEL_CH2_V 0x3F
#define DMA_PERI_IN_SEL_CH2_S 0

#define DMA_PERI_SEL_CH3_REG (DR_REG_DMA_BASE + 0x224)
/* DMA_PERI_OUT_SEL_CH3 : R/W ;bitpos:[11:6] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Tx channel 3. 0:SPI2*/
#define DMA_PERI_OUT_SEL_CH3 0x0000003F
#define DMA_PERI_OUT_SEL_CH3_M ((DMA_PERI_OUT_SEL_CH3_V) << (DMA_PERI_OUT_SEL_CH3_S))
#define DMA_PERI_OUT_SEL_CH3_V 0x3F
#define DMA_PERI_OUT_SEL_CH3_S 6
/* DMA_PERI_IN_SEL_CH3 : R/W ;bitpos:[5:0] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Rx channel 3. 0:SPI2*/
#define DMA_PERI_IN_SEL_CH3 0x0000003F
#define DMA_PERI_IN_SEL_CH3_M ((DMA_PERI_IN_SEL_CH3_V) << (DMA_PERI_IN_SEL_CH3_S))
#define DMA_PERI_IN_SEL_CH3_V 0x3F
#define DMA_PERI_IN_SEL_CH3_S 0

