espressif/esp-idf/components/soc/soc/esp32s3/include/soc/dma_reg.h
#define DMA_PERI_SEL_CH4_REG (DR_REG_DMA_BASE + 0x228)
/* DMA_PERI_OUT_SEL_CH4 : R/W ;bitpos:[11:6] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Tx channel 4. 0:SPI2*/
#define DMA_PERI_OUT_SEL_CH4 0x0000003F
#define DMA_PERI_OUT_SEL_CH4_M ((DMA_PERI_OUT_SEL_CH4_V) << (DMA_PERI_OUT_SEL_CH4_S))
#define DMA_PERI_OUT_SEL_CH4_V 0x3F
#define DMA_PERI_OUT_SEL_CH4_S 6
/* DMA_PERI_IN_SEL_CH4 : R/W ;bitpos:[5:0] ;default: 6'h3F ; */
/*description: This register is used to select peripheral for Rx channel 4. 0:SPI2*/
#define DMA_PERI_IN_SEL_CH4 0x0000003F
#define DMA_PERI_IN_SEL_CH4_M ((DMA_PERI_IN_SEL_CH4_V) << (DMA_PERI_IN_SEL_CH4_S))
#define DMA_PERI_IN_SEL_CH4_V 0x3F
#define DMA_PERI_IN_SEL_CH4_S 0

#define DMA_SRAM_SIZE_CH0_REG (DR_REG_DMA_BASE + 0x22C)
/* DMA_OUT_SIZE_CH0 : R/W ;bitpos:[9:5] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for
 Tx channel 0. 0:16 bytes*/
#define DMA_OUT_SIZE_CH0 0x0000001F
#define DMA_OUT_SIZE_CH0_M ((DMA_OUT_SIZE_CH0_V) << (DMA_OUT_SIZE_CH0_S))
#define DMA_OUT_SIZE_CH0_V 0x1F
#define DMA_OUT_SIZE_CH0_S 5
/* DMA_IN_SIZE_CH0 : R/W ;bitpos:[4:0] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Rx FIFO for
 Rx channel 0. 0:16 bytes*/
#define DMA_IN_SIZE_CH0 0x0000001F
#define DMA_IN_SIZE_CH0_M ((DMA_IN_SIZE_CH0_V) << (DMA_IN_SIZE_CH0_S))
#define DMA_IN_SIZE_CH0_V 0x1F
#define DMA_IN_SIZE_CH0_S 0

#define DMA_SRAM_SIZE_CH1_REG (DR_REG_DMA_BASE + 0x230)
/* DMA_OUT_SIZE_CH1 : R/W ;bitpos:[9:5] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for
 Tx channel 1. 0:16 bytes*/
#define DMA_OUT_SIZE_CH1 0x0000001F
#define DMA_OUT_SIZE_CH1_M ((DMA_OUT_SIZE_CH1_V) << (DMA_OUT_SIZE_CH1_S))
#define DMA_OUT_SIZE_CH1_V 0x1F
#define DMA_OUT_SIZE_CH1_S 5
/* DMA_IN_SIZE_CH1 : R/W ;bitpos:[4:0] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Rx FIFO for
 Rx channel 1. 0:16 bytes*/
#define DMA_IN_SIZE_CH1 0x0000001F
#define DMA_IN_SIZE_CH1_M ((DMA_IN_SIZE_CH1_V) << (DMA_IN_SIZE_CH1_S))
#define DMA_IN_SIZE_CH1_V 0x1F
#define DMA_IN_SIZE_CH1_S 0

#define DMA_SRAM_SIZE_CH2_REG (DR_REG_DMA_BASE + 0x234)
/* DMA_OUT_SIZE_CH2 : R/W ;bitpos:[9:5] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for
 Tx channel 2. 0:16 bytes*/
#define DMA_OUT_SIZE_CH2 0x0000001F
#define DMA_OUT_SIZE_CH2_M ((DMA_OUT_SIZE_CH2_V) << (DMA_OUT_SIZE_CH2_S))
#define DMA_OUT_SIZE_CH2_V 0x1F
#define DMA_OUT_SIZE_CH2_S 5
/* DMA_IN_SIZE_CH2 : R/W ;bitpos:[4:0] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Rx FIFO for
 Rx channel 2. 0:16 bytes*/
#define DMA_IN_SIZE_CH2 0x0000001F
#define DMA_IN_SIZE_CH2_M ((DMA_IN_SIZE_CH2_V) << (DMA_IN_SIZE_CH2_S))
#define DMA_IN_SIZE_CH2_V 0x1F
#define DMA_IN_SIZE_CH2_S 0

#define DMA_SRAM_SIZE_CH3_REG (DR_REG_DMA_BASE + 0x238)
/* DMA_OUT_SIZE_CH3 : R/W ;bitpos:[9:5] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for
 Tx channel 3. 0:16 bytes*/
#define DMA_OUT_SIZE_CH3 0x0000001F
#define DMA_OUT_SIZE_CH3_M ((DMA_OUT_SIZE_CH3_V) << (DMA_OUT_SIZE_CH3_S))
#define DMA_OUT_SIZE_CH3_V 0x1F
#define DMA_OUT_SIZE_CH3_S 5
/* DMA_IN_SIZE_CH3 : R/W ;bitpos:[4:0] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Rx FIFO for
 Rx channel 3. 0:16 bytes*/
#define DMA_IN_SIZE_CH3 0x0000001F
#define DMA_IN_SIZE_CH3_M ((DMA_IN_SIZE_CH3_V) << (DMA_IN_SIZE_CH3_S))
#define DMA_IN_SIZE_CH3_V 0x1F
#define DMA_IN_SIZE_CH3_S 0

#define DMA_SRAM_SIZE_CH4_REG (DR_REG_DMA_BASE + 0x23C)
/* DMA_OUT_SIZE_CH4 : R/W ;bitpos:[9:5] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Tx FIFO for
 Tx channel 4. 0:16 bytes*/
#define DMA_OUT_SIZE_CH4 0x0000001F
#define DMA_OUT_SIZE_CH4_M ((DMA_OUT_SIZE_CH4_V) << (DMA_OUT_SIZE_CH4_S))
#define DMA_OUT_SIZE_CH4_V 0x1F
#define DMA_OUT_SIZE_CH4_S 5
/* DMA_IN_SIZE_CH4 : R/W ;bitpos:[4:0] ;default: 5'b0 ; */
/*description: This register is used to configure the size of L2 Rx FIFO for
 Rx channel 4. 0:16 bytes*/
#define DMA_IN_SIZE_CH4 0x0000001F
#define DMA_IN_SIZE_CH4_M ((DMA_IN_SIZE_CH4_V) << (DMA_IN_SIZE_CH4_S))
#define DMA_IN_SIZE_CH4_V 0x1F
#define DMA_IN_SIZE_CH4_S 0

#define DMA_DATE_REG (DR_REG_DMA_BASE + 0x240)
/* DMA_DATE : R/W ;bitpos:[31:0] ;default: 32'h2002260 ; */
/*description: register version.*/
#define DMA_DATE 0xFFFFFFFF
#define DMA_DATE_M ((DMA_DATE_V) << (DMA_DATE_S))
#define DMA_DATE_V 0xFFFFFFFF
#define DMA_DATE_S 0

#ifdef __cplusplus
}
#endif
